wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AA.h
typedef struct {                                    /*!< (@ 0x50006000) ECC Structure                                          */
  __IO uint32_t  ECC_CONFIG_REG;                    /*!< (@ 0x50006000) Configuration register                                 */
  __IO uint32_t  ECC_COMMAND_REG;                   /*!< (@ 0x50006004) Command register                                       */
  __IO uint32_t  ECC_CONTROL_REG;                   /*!< (@ 0x50006008) Control register                                       */
  __IO uint32_t  ECC_STATUS_REG;                    /*!< (@ 0x5000600C) Status register                                        */
  __IO uint32_t  ECC_VERSION_REG;                   /*!< (@ 0x50006010) Version register                                       */
  __IO uint32_t  ECC_LOADMICROCODE_REG;             /*!< (@ 0x50006014) Used to upload Crypto Code from CPU into the
                                                         uCode ram                                                             */
} ECC_Type;


/* ================================================================================ */
/* ================                      FTDF                      ================ */
/* ================================================================================ */


/**
  * @brief FTDF registers (FTDF)
  */

typedef struct {                                    /*!< (@ 0x40080000) FTDF Structure                                         */
  __IO uint32_t  FTDF_TX_FIFO_0_0_REG;              /*!< (@ 0x40080000) Address transmit fifo 0                                */
  __I  uint32_t  RESERVED[31];
  __IO uint32_t  FTDF_TX_FIFO_1_0_REG;              /*!< (@ 0x40080080) Address transmit fifo 1                                */
  __I  uint32_t  RESERVED1[31];
  __IO uint32_t  FTDF_TX_FIFO_2_0_REG;              /*!< (@ 0x40080100) Address transmit fifo 2                                */
  __I  uint32_t  RESERVED2[31];
  __IO uint32_t  FTDF_TX_FIFO_3_0_REG;              /*!< (@ 0x40080180) Address transmit fifo 3                                */
  __I  uint32_t  RESERVED3[31];
  __IO uint32_t  FTDF_TX_META_DATA_0_0_REG;         /*!< (@ 0x40080200) Transmit metadata register 0                           */
  __IO uint32_t  FTDF_TX_META_DATA_1_0_REG;         /*!< (@ 0x40080204) Transmit metadata register 0                           */
  __I  uint32_t  RESERVED4[2];
  __IO uint32_t  FTDF_TX_META_DATA_0_1_REG;         /*!< (@ 0x40080210) Transmit metadata register 1                           */
  __IO uint32_t  FTDF_TX_META_DATA_1_1_REG;         /*!< (@ 0x40080214) Transmit metadata register 1                           */
  __I  uint32_t  RESERVED5[2];
  __IO uint32_t  FTDF_TX_META_DATA_0_2_REG;         /*!< (@ 0x40080220) Transmit metadata register 2                           */
  __IO uint32_t  FTDF_TX_META_DATA_1_2_REG;         /*!< (@ 0x40080224) Transmit metadata register 2                           */
  __I  uint32_t  RESERVED6[2];
  __IO uint32_t  FTDF_TX_META_DATA_0_3_REG;         /*!< (@ 0x40080230) Transmit metadata register 3                           */
  __IO uint32_t  FTDF_TX_META_DATA_1_3_REG;         /*!< (@ 0x40080234) Transmit metadata register 3                           */
  __I  uint32_t  RESERVED7[2];
  __IO uint32_t  FTDF_TX_RETURN_STATUS_0_0_REG;     /*!< (@ 0x40080240) Transmit status register 0                             */
  __IO uint32_t  FTDF_TX_RETURN_STATUS_1_0_REG;     /*!< (@ 0x40080244) Transmit status register 0                             */
  __I  uint32_t  RESERVED8[2];
  __IO uint32_t  FTDF_TX_RETURN_STATUS_0_1_REG;     /*!< (@ 0x40080250) Transmit status register 1                             */
  __IO uint32_t  FTDF_TX_RETURN_STATUS_1_1_REG;     /*!< (@ 0x40080254) Transmit status register 1                             */
  __I  uint32_t  RESERVED9[2];
  __IO uint32_t  FTDF_TX_RETURN_STATUS_0_2_REG;     /*!< (@ 0x40080260) Transmit status register 2                             */
  __IO uint32_t  FTDF_TX_RETURN_STATUS_1_2_REG;     /*!< (@ 0x40080264) Transmit status register 2                             */
  __I  uint32_t  RESERVED10[2];
  __IO uint32_t  FTDF_TX_RETURN_STATUS_0_3_REG;     /*!< (@ 0x40080270) Transmit status register 3                             */
  __IO uint32_t  FTDF_TX_RETURN_STATUS_1_3_REG;     /*!< (@ 0x40080274) Transmit status register 3                             */
  __I  uint32_t  RESERVED11[2];
  __IO uint32_t  FTDF_RX_META_0_0_REG;              /*!< (@ 0x40080280) Receive metadata register 0                            */
  __IO uint32_t  FTDF_RX_META_1_0_REG;              /*!< (@ 0x40080284) Receive metadata register 0                            */
  __I  uint32_t  RESERVED12[2];
  __IO uint32_t  FTDF_RX_META_0_1_REG;              /*!< (@ 0x40080290) Receive metadata register 1                            */
  __IO uint32_t  FTDF_RX_META_1_1_REG;              /*!< (@ 0x40080294) Receive metadata register 1                            */
  __I  uint32_t  RESERVED13[2];
  __IO uint32_t  FTDF_RX_META_0_2_REG;              /*!< (@ 0x400802A0) Receive metadata register 2                            */
  __IO uint32_t  FTDF_RX_META_1_2_REG;              /*!< (@ 0x400802A4) Receive metadata register 2                            */
  __I  uint32_t  RESERVED14[2];
  __IO uint32_t  FTDF_RX_META_0_3_REG;              /*!< (@ 0x400802B0) Receive metadata register 3                            */
  __IO uint32_t  FTDF_RX_META_1_3_REG;              /*!< (@ 0x400802B4) Receive metadata register 3                            */
  __I  uint32_t  RESERVED15[2];
  __IO uint32_t  FTDF_RX_META_0_4_REG;              /*!< (@ 0x400802C0) Receive metadata register 4                            */
  __IO uint32_t  FTDF_RX_META_1_4_REG;              /*!< (@ 0x400802C4) Receive metadata register 4                            */
  __I  uint32_t  RESERVED16[2];
  __IO uint32_t  FTDF_RX_META_0_5_REG;              /*!< (@ 0x400802D0) Receive metadata register 5                            */
  __IO uint32_t  FTDF_RX_META_1_5_REG;              /*!< (@ 0x400802D4) Receive metadata register 5                            */
  __I  uint32_t  RESERVED17[2];
  __IO uint32_t  FTDF_RX_META_0_6_REG;              /*!< (@ 0x400802E0) Receive metadata register 6                            */
  __IO uint32_t  FTDF_RX_META_1_6_REG;              /*!< (@ 0x400802E4) Receive metadata register 6                            */
  __I  uint32_t  RESERVED18[2];
  __IO uint32_t  FTDF_RX_META_0_7_REG;              /*!< (@ 0x400802F0) Receive metadata register 7                            */
  __IO uint32_t  FTDF_RX_META_1_7_REG;              /*!< (@ 0x400802F4) Receive metadata register 7                            */
  __I  uint32_t  RESERVED19[8002];
  __IO uint32_t  FTDF_RX_FIFO_0_0_REG;              /*!< (@ 0x40088000) Address receive fifo 0                                 */
  __I  uint32_t  RESERVED20[31];
  __IO uint32_t  FTDF_RX_FIFO_1_0_REG;              /*!< (@ 0x40088080) Address transmit fifo 1                                */
  __I  uint32_t  RESERVED21[31];
  __IO uint32_t  FTDF_RX_FIFO_2_0_REG;              /*!< (@ 0x40088100) Address transmit fifo 2                                */
  __I  uint32_t  RESERVED22[31];
  __IO uint32_t  FTDF_RX_FIFO_3_0_REG;              /*!< (@ 0x40088180) Address transmit fifo 3                                */
  __I  uint32_t  RESERVED23[31];
  __IO uint32_t  FTDF_RX_FIFO_4_0_REG;              /*!< (@ 0x40088200) Address transmit fifo 4                                */
  __I  uint32_t  RESERVED24[31];
  __IO uint32_t  FTDF_RX_FIFO_5_0_REG;              /*!< (@ 0x40088280) Address transmit fifo 5                                */
  __I  uint32_t  RESERVED25[31];
  __IO uint32_t  FTDF_RX_FIFO_6_0_REG;              /*!< (@ 0x40088300) Address transmit fifo 6                                */
  __I  uint32_t  RESERVED26[31];
  __IO uint32_t  FTDF_RX_FIFO_7_0_REG;              /*!< (@ 0x40088380) Address transmit fifo 7                                */
  __I  uint32_t  RESERVED27[7967];
  __IO uint32_t  FTDF_REL_NAME_0_REG;               /*!< (@ 0x40090000) Name of the release                                    */
  __IO uint32_t  FTDF_REL_NAME_1_REG;               /*!< (@ 0x40090004) Name of the release                                    */
  __IO uint32_t  FTDF_REL_NAME_2_REG;               /*!< (@ 0x40090008) Name of the release                                    */
  __IO uint32_t  FTDF_REL_NAME_3_REG;               /*!< (@ 0x4009000C) Name of the release                                    */
  __IO uint32_t  FTDF_BUILDTIME_0_REG;              /*!< (@ 0x40090010) Build time                                             */
  __IO uint32_t  FTDF_BUILDTIME_1_REG;              /*!< (@ 0x40090014) Build time                                             */
  __IO uint32_t  FTDF_BUILDTIME_2_REG;              /*!< (@ 0x40090018) Build time                                             */
  __IO uint32_t  FTDF_BUILDTIME_3_REG;              /*!< (@ 0x4009001C) Build time                                             */
  __IO uint32_t  FTDF_GLOB_CONTROL_0_REG;           /*!< (@ 0x40090020) Global control register                                */
  __IO uint32_t  FTDF_GLOB_CONTROL_1_REG;           /*!< (@ 0x40090024) Global control register                                */
  __IO uint32_t  FTDF_GLOB_CONTROL_2_REG;           /*!< (@ 0x40090028) Global control register                                */
  __IO uint32_t  FTDF_GLOB_CONTROL_3_REG;           /*!< (@ 0x4009002C) Global control register                                */
  __IO uint32_t  FTDF_LMAC_CONTROL_0_REG;           /*!< (@ 0x40090030) Lmac control register                                  */
  __IO uint32_t  FTDF_TXPIPEPROPDELAY_REG;          /*!< (@ 0x40090034) Prop delay transmit register                           */
  __IO uint32_t  FTDF_MACACKWAITDURATION_REG;       /*!< (@ 0x40090038) Maximum time to wait for a ACK                         */
  __IO uint32_t  FTDF_MACENHACKWAITDURATION_REG;    /*!< (@ 0x4009003C) Maximum time to wait for an enhanced ACK frame         */
  __IO uint32_t  FTDF_LMAC_CONTROL_1_REG;           /*!< (@ 0x40090040) Lmac control register                                  */
  __IO uint32_t  FTDF_LMAC_CONTROL_2_REG;           /*!< (@ 0x40090044) Lmac control register                                  */
  __IO uint32_t  FTDF_LMAC_CONTROL_3_REG;           /*!< (@ 0x40090048) Lmac control register                                  */
  __I  uint32_t  RESERVED28;
  __IO uint32_t  FTDF_LMAC_CONTROL_OS_REG;          /*!< (@ 0x40090050) Lmac control register                                  */
  __IO uint32_t  FTDF_LMAC_CONTROL_STATUS_REG;      /*!< (@ 0x40090054) Lmac status register                                   */
  __IO uint32_t  FTDF_EVENTCURRVAL_REG;             /*!< (@ 0x40090058) Value of event generator                               */
  __IO uint32_t  FTDF_TIMESTAMPCURRVAL_REG;         /*!< (@ 0x4009005C) Value of timestamp generator                           */
  __IO uint32_t  FTDF_LMAC_CONTROL_4_REG;           /*!< (@ 0x40090060) Lmac control register                                  */
  __IO uint32_t  FTDF_LMAC_CONTROL_5_REG;           /*!< (@ 0x40090064) Lmac control register                                  */
  __IO uint32_t  FTDF_LMAC_CONTROL_6_REG;           /*!< (@ 0x40090068) Lmac control register                                  */
  __IO uint32_t  FTDF_LMAC_CONTROL_11_REG;          /*!< (@ 0x4009006C) Lmac control register                                  */
  __IO uint32_t  FTDF_LMAC_CONTROL_DELTA_REG;       /*!< (@ 0x40090070) Lmac delta control register                            */
  __IO uint32_t  FTDF_TIMESTAMPCURRPHASEVAL_REG;    /*!< (@ 0x40090074) Value of timestamp generator phase within a symbol     */
  __IO uint32_t  FTDF_MACTSTXACKDELAYVAL_REG;       /*!< (@ 0x40090078) Time left until next ACK is sent (us)                  */
  __I  uint32_t  RESERVED29;
  __IO uint32_t  FTDF_LMAC_CONTROL_MASK_REG;        /*!< (@ 0x40090080) Lmac mask control register                             */
  __I  uint32_t  RESERVED30[3];
  __IO uint32_t  FTDF_LMAC_EVENT_REG;               /*!< (@ 0x40090090) Lmac event regsiter                                    */
  __IO uint32_t  FTDF_LMAC_MASK_REG;                /*!< (@ 0x40090094) Lmac mask register                                     */
  __I  uint32_t  RESERVED31[2];
  __IO uint32_t  FTDF_LMAC_MANUAL_1_REG;            /*!< (@ 0x400900A0) Lmax manual PHY register                               */
  __IO uint32_t  FTDF_LMAC_MANUAL_OS_REG;           /*!< (@ 0x400900A4) One shot register triggers transmission in manual
                                                         mode                                                                  */
  __IO uint32_t  FTDF_LMAC_MANUAL_STATUS_REG;       /*!< (@ 0x400900A8) Lmac status register in manual mode                    */
  __I  uint32_t  RESERVED32[21];
  __IO uint32_t  FTDF_LMAC_CONTROL_7_REG;           /*!< (@ 0x40090100) Lmac control register                                  */
  __IO uint32_t  FTDF_LMAC_CONTROL_8_REG;           /*!< (@ 0x40090104) Lmac control register                                  */
  __IO uint32_t  FTDF_LMAC_CONTROL_9_REG;           /*!< (@ 0x40090108) Lmac control register                                  */
  __IO uint32_t  FTDF_LMAC_CONTROL_10_REG;          /*!< (@ 0x4009010C) Lmac control register                                  */
  __IO uint32_t  FTDF_SECURITY_0_REG;               /*!< (@ 0x40090110) Security register                                      */
  __IO uint32_t  FTDF_SECURITY_1_REG;               /*!< (@ 0x40090114) Security register                                      */
  __IO uint32_t  FTDF_SECKEY_0_REG;                 /*!< (@ 0x40090118) Seckey register                                        */
  __IO uint32_t  FTDF_SECKEY_1_REG;                 /*!< (@ 0x4009011C) Seckey register                                        */
  __IO uint32_t  FTDF_SECKEY_2_REG;                 /*!< (@ 0x40090120) SecKey register                                        */
  __IO uint32_t  FTDF_SECKEY_3_REG;                 /*!< (@ 0x40090124) Seckey register                                        */
  __IO uint32_t  FTDF_SECNONCE_0_REG;               /*!< (@ 0x40090128) Nonce register used for encryption/decryption          */
  __IO uint32_t  FTDF_SECNONCE_1_REG;               /*!< (@ 0x4009012C) Nonce register used for encryption/decryption          */
  __IO uint32_t  FTDF_SECNONCE_2_REG;               /*!< (@ 0x40090130) Nonce register used for encryption/decryption          */
  __IO uint32_t  FTDF_SECNONCE_3_REG;               /*!< (@ 0x40090134) Nonce register used for encryption/decryption          */
  __IO uint32_t  FTDF_SECURITY_OS_REG;              /*!< (@ 0x40090138) One shot register to start encryption/decryption       */
  __I  uint32_t  RESERVED33;
  __IO uint32_t  FTDF_SECURITY_STATUS_REG;          /*!< (@ 0x40090140) Security status register                               */
  __I  uint32_t  RESERVED34[3];
  __IO uint32_t  FTDF_SECURITY_EVENT_REG;           /*!< (@ 0x40090150) security event register                                */
  __IO uint32_t  FTDF_SECURITY_EVENTMASK_REG;       /*!< (@ 0x40090154) security event mask register                           */
  __I  uint32_t  RESERVED35[2];
  __IO uint32_t  FTDF_TSCH_CONTROL_0_REG;           /*!< (@ 0x40090160) Lmac tsch control register                             */
  __IO uint32_t  FTDF_TSCH_CONTROL_1_REG;           /*!< (@ 0x40090164) Lmac tsch control register                             */
  __IO uint32_t  FTDF_TSCH_CONTROL_2_REG;           /*!< (@ 0x40090168) Lmac tsch control register                             */
  __I  uint32_t  RESERVED36[5];
  __IO uint32_t  FTDF_PHY_PARAMETERS_0_REG;         /*!< (@ 0x40090180) Lmac PHY parameter register                            */
  __IO uint32_t  FTDF_PHY_PARAMETERS_1_REG;         /*!< (@ 0x40090184) Lmac PHY parameter register                            */
  __IO uint32_t  FTDF_PHY_PARAMETERS_2_REG;         /*!< (@ 0x40090188) Lmac PHY parameter register                            */
  __IO uint32_t  FTDF_PHY_PARAMETERS_3_REG;         /*!< (@ 0x4009018C) Lmac PHY parameter register                            */
  __I  uint32_t  RESERVED37[28];
  __IO uint32_t  FTDF_RX_CONTROL_0_REG;             /*!< (@ 0x40090200) Receive control register                               */
  __IO uint32_t  FTDF_RX_EVENT_REG;                 /*!< (@ 0x40090204) Receive event register                                 */
  __IO uint32_t  FTDF_RX_MASK_REG;                  /*!< (@ 0x40090208) Receive event mask register                            */
  __IO uint32_t  FTDF_RX_STATUS_REG;                /*!< (@ 0x4009020C) Receive status register                                */
  __IO uint32_t  FTDF_SYMBOLTIMESNAPSHOTVAL_REG;    /*!< (@ 0x40090210) Value timestamp generator                              */
  __I  uint32_t  RESERVED38[3];
  __IO uint32_t  FTDF_RX_STATUS_DELTA_REG;          /*!< (@ 0x40090220) Receive status delta register                          */
  __IO uint32_t  FTDF_RX_STATUS_MASK_REG;           /*!< (@ 0x40090224) Receive status delta mask register                     */
  __I  uint32_t  RESERVED39[6];
  __IO uint32_t  FTDF_TX_CONTROL_0_REG;             /*!< (@ 0x40090240) Transmit control register                              */
  __I  uint32_t  RESERVED40[3];
  __IO uint32_t  FTDF_FTDF_CE_REG;                  /*!< (@ 0x40090250) Selection register events                              */
  __IO uint32_t  FTDF_FTDF_CM_REG;                  /*!< (@ 0x40090254) Mask selection register events                         */
  __I  uint32_t  RESERVED41[43];
  __IO uint32_t  FTDF_SYNCTIMESTAMPTHR_REG;         /*!< (@ 0x40090304) Threshold timestamp generator                          */
  __IO uint32_t  FTDF_SYNCTIMESTAMPVAL_REG;         /*!< (@ 0x40090308) Value timestamp generator                              */
  __IO uint32_t  FTDF_TIMER_CONTROL_1_REG;          /*!< (@ 0x4009030C) Timer control register                                 */
  __IO uint32_t  FTDF_MACTXSTDACKFRMCNT_REG;        /*!< (@ 0x40090310) Transmitted acknowledgment frames                      */
  __IO uint32_t  FTDF_MACRXSTDACKFRMOKCNT_REG;      /*!< (@ 0x40090314) Received acknowledgment frames                         */
  __IO uint32_t  FTDF_MACRXADDRFAILFRMCNT_REG;      /*!< (@ 0x40090318) Discarded frames register                              */
  __IO uint32_t  FTDF_MACRXUNSUPFRMCNT_REG;         /*!< (@ 0x4009031C) Unsupported frames register                            */
  __IO uint32_t  FTDF_SYNCTIMESTAMPPHASEVAL_REG;    /*!< (@ 0x40090320) Timestamp phase value regsiter                         */
  __I  uint32_t  RESERVED42[7];
  __IO uint32_t  FTDF_MACFCSERRORCOUNT_REG;         /*!< (@ 0x40090340) Lmac FCS error register                                */
  __I  uint32_t  RESERVED43[7];
  __IO uint32_t  FTDF_LMACRESET_REG;                /*!< (@ 0x40090360) Lmax reset register                                    */
  __I  uint32_t  RESERVED44[7];
  __IO uint32_t  FTDF_SYMBOLTIMETHR_REG;            /*!< (@ 0x40090380) Symboltime threshold register 1                        */
  __IO uint32_t  FTDF_SYMBOLTIME2THR_REG;           /*!< (@ 0x40090384) Symboltime threshold register 2                        */
  __I  uint32_t  RESERVED45[2];
  __IO uint32_t  FTDF_DEBUGCONTROL_REG;             /*!< (@ 0x40090390) Debug control register                                 */
  __IO uint32_t  FTDF_TXBYTE_E_REG;                 /*!< (@ 0x40090394) Transmit first byte register                           */
  __IO uint32_t  FTDF_TXBYTE_M_REG;                 /*!< (@ 0x40090398) Transmit first byte mask register                      */
  __I  uint32_t  RESERVED46[25];
  __IO uint32_t  FTDF_TX_FLAG_S_0_REG;              /*!< (@ 0x40090400) Transmit packet ready for transmission register
                                                         0                                                                     */
  __IO uint32_t  FTDF_TX_FLAG_CLEAR_E_0_REG;        /*!< (@ 0x40090404) Clear flag register 0                                  */
  __IO uint32_t  FTDF_TX_FLAG_CLEAR_M_0_REG;        /*!< (@ 0x40090408) Mask flag register 0                                   */
  __I  uint32_t  RESERVED47;
  __IO uint32_t  FTDF_TX_PRIORITY_0_REG;            /*!< (@ 0x40090410) Transmit priority register 0                           */
  __I  uint32_t  RESERVED48[3];
  __IO uint32_t  FTDF_TX_FLAG_S_1_REG;              /*!< (@ 0x40090420) Transmit packet ready for transmission register
                                                         1                                                                     */
  __IO uint32_t  FTDF_TX_FLAG_CLEAR_E_1_REG;        /*!< (@ 0x40090424) Clear flag register 1                                  */
  __IO uint32_t  FTDF_TX_FLAG_CLEAR_M_1_REG;        /*!< (@ 0x40090428) Mask flag register 1                                   */
  __I  uint32_t  RESERVED49;
  __IO uint32_t  FTDF_TX_PRIORITY_1_REG;            /*!< (@ 0x40090430) Transmit priority register 1                           */
  __I  uint32_t  RESERVED50[3];
  __IO uint32_t  FTDF_TX_FLAG_S_2_REG;              /*!< (@ 0x40090440) Transmit packet ready for transmission register
                                                         2                                                                     */
  __IO uint32_t  FTDF_TX_FLAG_CLEAR_E_2_REG;        /*!< (@ 0x40090444) Clear flag register 2                                  */
  __IO uint32_t  FTDF_TX_FLAG_CLEAR_M_2_REG;        /*!< (@ 0x40090448) Clear flag register 2                                  */
  __I  uint32_t  RESERVED51;
  __IO uint32_t  FTDF_TX_PRIORITY_2_REG;            /*!< (@ 0x40090450) Transmit priority register 2                           */
  __I  uint32_t  RESERVED52[3];
  __IO uint32_t  FTDF_TX_FLAG_S_3_REG;              /*!< (@ 0x40090460) Transmit packet ready for transmission register
                                                         3                                                                     */
  __IO uint32_t  FTDF_TX_FLAG_CLEAR_E_3_REG;        /*!< (@ 0x40090464) Clear flag register 3                                  */
  __IO uint32_t  FTDF_TX_FLAG_CLEAR_M_3_REG;        /*!< (@ 0x40090468) Clear flag register 3                                  */
  __I  uint32_t  RESERVED53;
  __IO uint32_t  FTDF_TX_PRIORITY_3_REG;            /*!< (@ 0x40090470) Transmit priority register 3                           */
  __I  uint32_t  RESERVED54[3];
  __IO uint32_t  FTDF_TX_SET_OS_REG;                /*!< (@ 0x40090480) One shot register to set flag                          */
  __IO uint32_t  FTDF_TX_CLEAR_OS_REG;              /*!< (@ 0x40090484) One shot register to clear flag                        */
  __I  uint32_t  RESERVED55[734];
  __IO uint32_t  FTDF_WAKEUPINTTHR_REG;             /*!< (@ 0x40091000) Treshold value Wakeup timer                            */
  __IO uint32_t  FTDF_WAKEUP_CONTROL_REG;           /*!< (@ 0x40091004) Wakeup timer vcontrol register                         */
} FTDF_Type;


/* ================================================================================ */
/* ================                    GP_TIMERS                   ================ */
/* ================================================================================ */


/**
  * @brief GP_TIMERS registers (GP_TIMERS)
  */

