wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AA.h
/* ----------------------------------  NVIC_ISPR  --------------------------------- */
#define NVIC_ISPR_BLE_WAKEUP_LP_IRQn_Pos      (0UL)                     /*!< NVIC ISPR: BLE_WAKEUP_LP_IRQn (Bit 0)                       */
#define NVIC_ISPR_BLE_WAKEUP_LP_IRQn_Msk      (0x1UL)                   /*!< NVIC ISPR: BLE_WAKEUP_LP_IRQn (Bitfield-Mask: 0x01)         */
#define NVIC_ISPR_BLE_GEN_IRQn_Pos            (1UL)                     /*!< NVIC ISPR: BLE_GEN_IRQn (Bit 1)                             */
#define NVIC_ISPR_BLE_GEN_IRQn_Msk            (0x2UL)                   /*!< NVIC ISPR: BLE_GEN_IRQn (Bitfield-Mask: 0x01)               */
#define NVIC_ISPR_FTDF_WAKEUP_IRQn_Pos        (2UL)                     /*!< NVIC ISPR: FTDF_WAKEUP_IRQn (Bit 2)                         */
#define NVIC_ISPR_FTDF_WAKEUP_IRQn_Msk        (0x4UL)                   /*!< NVIC ISPR: FTDF_WAKEUP_IRQn (Bitfield-Mask: 0x01)           */
#define NVIC_ISPR_FTDF_GEN_IRQn_Pos           (3UL)                     /*!< NVIC ISPR: FTDF_GEN_IRQn (Bit 3)                            */
#define NVIC_ISPR_FTDF_GEN_IRQn_Msk           (0x8UL)                   /*!< NVIC ISPR: FTDF_GEN_IRQn (Bitfield-Mask: 0x01)              */
#define NVIC_ISPR_RFCAL_IRQn_Pos              (4UL)                     /*!< NVIC ISPR: RFCAL_IRQn (Bit 4)                               */
#define NVIC_ISPR_RFCAL_IRQn_Msk              (0x10UL)                  /*!< NVIC ISPR: RFCAL_IRQn (Bitfield-Mask: 0x01)                 */
#define NVIC_ISPR_COEX_IRQn_Pos               (5UL)                     /*!< NVIC ISPR: COEX_IRQn (Bit 5)                                */
#define NVIC_ISPR_COEX_IRQn_Msk               (0x20UL)                  /*!< NVIC ISPR: COEX_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISPR_CRYPTO_IRQn_Pos             (6UL)                     /*!< NVIC ISPR: CRYPTO_IRQn (Bit 6)                              */
#define NVIC_ISPR_CRYPTO_IRQn_Msk             (0x40UL)                  /*!< NVIC ISPR: CRYPTO_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISPR_MRM_IRQn_Pos                (7UL)                     /*!< NVIC ISPR: MRM_IRQn (Bit 7)                                 */
#define NVIC_ISPR_MRM_IRQn_Msk                (0x80UL)                  /*!< NVIC ISPR: MRM_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISPR_UART_IRQn_Pos               (8UL)                     /*!< NVIC ISPR: UART_IRQn (Bit 8)                                */
#define NVIC_ISPR_UART_IRQn_Msk               (0x100UL)                 /*!< NVIC ISPR: UART_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISPR_UART2_IRQn_Pos              (9UL)                     /*!< NVIC ISPR: UART2_IRQn (Bit 9)                               */
#define NVIC_ISPR_UART2_IRQn_Msk              (0x200UL)                 /*!< NVIC ISPR: UART2_IRQn (Bitfield-Mask: 0x01)                 */
#define NVIC_ISPR_I2C_IRQn_Pos                (10UL)                    /*!< NVIC ISPR: I2C_IRQn (Bit 10)                                */
#define NVIC_ISPR_I2C_IRQn_Msk                (0x400UL)                 /*!< NVIC ISPR: I2C_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISPR_I2C2_IRQn_Pos               (11UL)                    /*!< NVIC ISPR: I2C2_IRQn (Bit 11)                               */
#define NVIC_ISPR_I2C2_IRQn_Msk               (0x800UL)                 /*!< NVIC ISPR: I2C2_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISPR_SPI_IRQn_Pos                (12UL)                    /*!< NVIC ISPR: SPI_IRQn (Bit 12)                                */
#define NVIC_ISPR_SPI_IRQn_Msk                (0x1000UL)                /*!< NVIC ISPR: SPI_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISPR_SPI2_IRQn_Pos               (13UL)                    /*!< NVIC ISPR: SPI2_IRQn (Bit 13)                               */
#define NVIC_ISPR_SPI2_IRQn_Msk               (0x2000UL)                /*!< NVIC ISPR: SPI2_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISPR_ADC_IRQn_Pos                (14UL)                    /*!< NVIC ISPR: ADC_IRQn (Bit 14)                                */
#define NVIC_ISPR_ADC_IRQn_Msk                (0x4000UL)                /*!< NVIC ISPR: ADC_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISPR_KEYBRD_IRQn_Pos             (15UL)                    /*!< NVIC ISPR: KEYBRD_IRQn (Bit 15)                             */
#define NVIC_ISPR_KEYBRD_IRQn_Msk             (0x8000UL)                /*!< NVIC ISPR: KEYBRD_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISPR_IRGEN_IRQn_Pos              (16UL)                    /*!< NVIC ISPR: IRGEN_IRQn (Bit 16)                              */
#define NVIC_ISPR_IRGEN_IRQn_Msk              (0x10000UL)               /*!< NVIC ISPR: IRGEN_IRQn (Bitfield-Mask: 0x01)                 */
#define NVIC_ISPR_WKUP_GPIO_IRQn_Pos          (17UL)                    /*!< NVIC ISPR: WKUP_GPIO_IRQn (Bit 17)                          */
#define NVIC_ISPR_WKUP_GPIO_IRQn_Msk          (0x20000UL)               /*!< NVIC ISPR: WKUP_GPIO_IRQn (Bitfield-Mask: 0x01)             */
#define NVIC_ISPR_SWTIM0_IRQn_Pos             (18UL)                    /*!< NVIC ISPR: SWTIM0_IRQn (Bit 18)                             */
#define NVIC_ISPR_SWTIM0_IRQn_Msk             (0x40000UL)               /*!< NVIC ISPR: SWTIM0_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISPR_SWTIM1_IRQn_Pos             (19UL)                    /*!< NVIC ISPR: SWTIM1_IRQn (Bit 19)                             */
#define NVIC_ISPR_SWTIM1_IRQn_Msk             (0x80000UL)               /*!< NVIC ISPR: SWTIM1_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISPR_QUADEC_IRQn_Pos             (20UL)                    /*!< NVIC ISPR: QUADEC_IRQn (Bit 20)                             */
#define NVIC_ISPR_QUADEC_IRQn_Msk             (0x100000UL)              /*!< NVIC ISPR: QUADEC_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISPR_USB_IRQn_Pos                (21UL)                    /*!< NVIC ISPR: USB_IRQn (Bit 21)                                */
#define NVIC_ISPR_USB_IRQn_Msk                (0x200000UL)              /*!< NVIC ISPR: USB_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISPR_PCM_IRQn_Pos                (22UL)                    /*!< NVIC ISPR: PCM_IRQn (Bit 22)                                */
#define NVIC_ISPR_PCM_IRQn_Msk                (0x400000UL)              /*!< NVIC ISPR: PCM_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISPR_SRC_IN_IRQn_Pos             (23UL)                    /*!< NVIC ISPR: SRC_IN_IRQn (Bit 23)                             */
#define NVIC_ISPR_SRC_IN_IRQn_Msk             (0x800000UL)              /*!< NVIC ISPR: SRC_IN_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISPR_SRC_OUT_IRQn_Pos            (24UL)                    /*!< NVIC ISPR: SRC_OUT_IRQn (Bit 24)                            */
#define NVIC_ISPR_SRC_OUT_IRQn_Msk            (0x1000000UL)             /*!< NVIC ISPR: SRC_OUT_IRQn (Bitfield-Mask: 0x01)               */
#define NVIC_ISPR_VBUS_IRQn_Pos               (25UL)                    /*!< NVIC ISPR: VBUS_IRQn (Bit 25)                               */
#define NVIC_ISPR_VBUS_IRQn_Msk               (0x2000000UL)             /*!< NVIC ISPR: VBUS_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISPR_DMA_IRQn_Pos                (26UL)                    /*!< NVIC ISPR: DMA_IRQn (Bit 26)                                */
#define NVIC_ISPR_DMA_IRQn_Msk                (0x4000000UL)             /*!< NVIC ISPR: DMA_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISPR_RF_DIAG_IRQn_Pos            (27UL)                    /*!< NVIC ISPR: RF_DIAG_IRQn (Bit 27)                            */
#define NVIC_ISPR_RF_DIAG_IRQn_Msk            (0x8000000UL)             /*!< NVIC ISPR: RF_DIAG_IRQn (Bitfield-Mask: 0x01)               */
#define NVIC_ISPR_TRNG_IRQn_Pos               (28UL)                    /*!< NVIC ISPR: TRNG_IRQn (Bit 28)                               */
#define NVIC_ISPR_TRNG_IRQn_Msk               (0x10000000UL)            /*!< NVIC ISPR: TRNG_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISPR_DCDC_IRQn_Pos               (29UL)                    /*!< NVIC ISPR: DCDC_IRQn (Bit 29)                               */
#define NVIC_ISPR_DCDC_IRQn_Msk               (0x20000000UL)            /*!< NVIC ISPR: DCDC_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISPR_XTAL16RDY_IRQn_Pos          (30UL)                    /*!< NVIC ISPR: XTAL16RDY_IRQn (Bit 30)                          */
#define NVIC_ISPR_XTAL16RDY_IRQn_Msk          (0x40000000UL)            /*!< NVIC ISPR: XTAL16RDY_IRQn (Bitfield-Mask: 0x01)             */
#define NVIC_ISPR_Rsvd__irq__n_Pos            (31UL)                    /*!< NVIC ISPR: Rsvd__irq__n (Bit 31)                            */
#define NVIC_ISPR_Rsvd__irq__n_Msk            (0x80000000UL)            /*!< NVIC ISPR: Rsvd__irq__n (Bitfield-Mask: 0x01)               */

/* ----------------------------------  NVIC_ICPR  --------------------------------- */
#define NVIC_ICPR_BLE_WAKEUP_LP_IRQn_Pos      (0UL)                     /*!< NVIC ICPR: BLE_WAKEUP_LP_IRQn (Bit 0)                       */
#define NVIC_ICPR_BLE_WAKEUP_LP_IRQn_Msk      (0x1UL)                   /*!< NVIC ICPR: BLE_WAKEUP_LP_IRQn (Bitfield-Mask: 0x01)         */
#define NVIC_ICPR_BLE_GEN_IRQn_Pos            (1UL)                     /*!< NVIC ICPR: BLE_GEN_IRQn (Bit 1)                             */
#define NVIC_ICPR_BLE_GEN_IRQn_Msk            (0x2UL)                   /*!< NVIC ICPR: BLE_GEN_IRQn (Bitfield-Mask: 0x01)               */
#define NVIC_ICPR_FTDF_WAKEUP_IRQn_Pos        (2UL)                     /*!< NVIC ICPR: FTDF_WAKEUP_IRQn (Bit 2)                         */
#define NVIC_ICPR_FTDF_WAKEUP_IRQn_Msk        (0x4UL)                   /*!< NVIC ICPR: FTDF_WAKEUP_IRQn (Bitfield-Mask: 0x01)           */
#define NVIC_ICPR_FTDF_GEN_IRQn_Pos           (3UL)                     /*!< NVIC ICPR: FTDF_GEN_IRQn (Bit 3)                            */
#define NVIC_ICPR_FTDF_GEN_IRQn_Msk           (0x8UL)                   /*!< NVIC ICPR: FTDF_GEN_IRQn (Bitfield-Mask: 0x01)              */
#define NVIC_ICPR_RFCAL_IRQn_Pos              (4UL)                     /*!< NVIC ICPR: RFCAL_IRQn (Bit 4)                               */
#define NVIC_ICPR_RFCAL_IRQn_Msk              (0x10UL)                  /*!< NVIC ICPR: RFCAL_IRQn (Bitfield-Mask: 0x01)                 */
#define NVIC_ICPR_COEX_IRQn_Pos               (5UL)                     /*!< NVIC ICPR: COEX_IRQn (Bit 5)                                */
#define NVIC_ICPR_COEX_IRQn_Msk               (0x20UL)                  /*!< NVIC ICPR: COEX_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ICPR_CRYPTO_IRQn_Pos             (6UL)                     /*!< NVIC ICPR: CRYPTO_IRQn (Bit 6)                              */
#define NVIC_ICPR_CRYPTO_IRQn_Msk             (0x40UL)                  /*!< NVIC ICPR: CRYPTO_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ICPR_MRM_IRQn_Pos                (7UL)                     /*!< NVIC ICPR: MRM_IRQn (Bit 7)                                 */
#define NVIC_ICPR_MRM_IRQn_Msk                (0x80UL)                  /*!< NVIC ICPR: MRM_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ICPR_UART_IRQn_Pos               (8UL)                     /*!< NVIC ICPR: UART_IRQn (Bit 8)                                */
#define NVIC_ICPR_UART_IRQn_Msk               (0x100UL)                 /*!< NVIC ICPR: UART_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ICPR_UART2_IRQn_Pos              (9UL)                     /*!< NVIC ICPR: UART2_IRQn (Bit 9)                               */
#define NVIC_ICPR_UART2_IRQn_Msk              (0x200UL)                 /*!< NVIC ICPR: UART2_IRQn (Bitfield-Mask: 0x01)                 */
#define NVIC_ICPR_I2C_IRQn_Pos                (10UL)                    /*!< NVIC ICPR: I2C_IRQn (Bit 10)                                */
#define NVIC_ICPR_I2C_IRQn_Msk                (0x400UL)                 /*!< NVIC ICPR: I2C_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ICPR_I2C2_IRQn_Pos               (11UL)                    /*!< NVIC ICPR: I2C2_IRQn (Bit 11)                               */
#define NVIC_ICPR_I2C2_IRQn_Msk               (0x800UL)                 /*!< NVIC ICPR: I2C2_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ICPR_SPI_IRQn_Pos                (12UL)                    /*!< NVIC ICPR: SPI_IRQn (Bit 12)                                */
#define NVIC_ICPR_SPI_IRQn_Msk                (0x1000UL)                /*!< NVIC ICPR: SPI_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ICPR_SPI2_IRQn_Pos               (13UL)                    /*!< NVIC ICPR: SPI2_IRQn (Bit 13)                               */
#define NVIC_ICPR_SPI2_IRQn_Msk               (0x2000UL)                /*!< NVIC ICPR: SPI2_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ICPR_ADC_IRQn_Pos                (14UL)                    /*!< NVIC ICPR: ADC_IRQn (Bit 14)                                */
#define NVIC_ICPR_ADC_IRQn_Msk                (0x4000UL)                /*!< NVIC ICPR: ADC_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ICPR_KEYBRD_IRQn_Pos             (15UL)                    /*!< NVIC ICPR: KEYBRD_IRQn (Bit 15)                             */
#define NVIC_ICPR_KEYBRD_IRQn_Msk             (0x8000UL)                /*!< NVIC ICPR: KEYBRD_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ICPR_IRGEN_IRQn_Pos              (16UL)                    /*!< NVIC ICPR: IRGEN_IRQn (Bit 16)                              */
#define NVIC_ICPR_IRGEN_IRQn_Msk              (0x10000UL)               /*!< NVIC ICPR: IRGEN_IRQn (Bitfield-Mask: 0x01)                 */
#define NVIC_ICPR_WKUP_GPIO_IRQn_Pos          (17UL)                    /*!< NVIC ICPR: WKUP_GPIO_IRQn (Bit 17)                          */
#define NVIC_ICPR_WKUP_GPIO_IRQn_Msk          (0x20000UL)               /*!< NVIC ICPR: WKUP_GPIO_IRQn (Bitfield-Mask: 0x01)             */
#define NVIC_ICPR_SWTIM0_IRQn_Pos             (18UL)                    /*!< NVIC ICPR: SWTIM0_IRQn (Bit 18)                             */
#define NVIC_ICPR_SWTIM0_IRQn_Msk             (0x40000UL)               /*!< NVIC ICPR: SWTIM0_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ICPR_SWTIM1_IRQn_Pos             (19UL)                    /*!< NVIC ICPR: SWTIM1_IRQn (Bit 19)                             */
#define NVIC_ICPR_SWTIM1_IRQn_Msk             (0x80000UL)               /*!< NVIC ICPR: SWTIM1_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ICPR_QUADEC_IRQn_Pos             (20UL)                    /*!< NVIC ICPR: QUADEC_IRQn (Bit 20)                             */
#define NVIC_ICPR_QUADEC_IRQn_Msk             (0x100000UL)              /*!< NVIC ICPR: QUADEC_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ICPR_USB_IRQn_Pos                (21UL)                    /*!< NVIC ICPR: USB_IRQn (Bit 21)                                */
#define NVIC_ICPR_USB_IRQn_Msk                (0x200000UL)              /*!< NVIC ICPR: USB_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ICPR_PCM_IRQn_Pos                (22UL)                    /*!< NVIC ICPR: PCM_IRQn (Bit 22)                                */
#define NVIC_ICPR_PCM_IRQn_Msk                (0x400000UL)              /*!< NVIC ICPR: PCM_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ICPR_SRC_IN_IRQn_Pos             (23UL)                    /*!< NVIC ICPR: SRC_IN_IRQn (Bit 23)                             */
#define NVIC_ICPR_SRC_IN_IRQn_Msk             (0x800000UL)              /*!< NVIC ICPR: SRC_IN_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ICPR_SRC_OUT_IRQn_Pos            (24UL)                    /*!< NVIC ICPR: SRC_OUT_IRQn (Bit 24)                            */
#define NVIC_ICPR_SRC_OUT_IRQn_Msk            (0x1000000UL)             /*!< NVIC ICPR: SRC_OUT_IRQn (Bitfield-Mask: 0x01)               */
#define NVIC_ICPR_VBUS_IRQn_Pos               (25UL)                    /*!< NVIC ICPR: VBUS_IRQn (Bit 25)                               */
#define NVIC_ICPR_VBUS_IRQn_Msk               (0x2000000UL)             /*!< NVIC ICPR: VBUS_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ICPR_DMA_IRQn_Pos                (26UL)                    /*!< NVIC ICPR: DMA_IRQn (Bit 26)                                */
#define NVIC_ICPR_DMA_IRQn_Msk                (0x4000000UL)             /*!< NVIC ICPR: DMA_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ICPR_RF_DIAG_IRQn_Pos            (27UL)                    /*!< NVIC ICPR: RF_DIAG_IRQn (Bit 27)                            */
#define NVIC_ICPR_RF_DIAG_IRQn_Msk            (0x8000000UL)             /*!< NVIC ICPR: RF_DIAG_IRQn (Bitfield-Mask: 0x01)               */
#define NVIC_ICPR_TRNG_IRQn_Pos               (28UL)                    /*!< NVIC ICPR: TRNG_IRQn (Bit 28)                               */
#define NVIC_ICPR_TRNG_IRQn_Msk               (0x10000000UL)            /*!< NVIC ICPR: TRNG_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ICPR_DCDC_IRQn_Pos               (29UL)                    /*!< NVIC ICPR: DCDC_IRQn (Bit 29)                               */
#define NVIC_ICPR_DCDC_IRQn_Msk               (0x20000000UL)            /*!< NVIC ICPR: DCDC_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ICPR_XTAL16RDY_IRQn_Pos          (30UL)                    /*!< NVIC ICPR: XTAL16RDY_IRQn (Bit 30)                          */
#define NVIC_ICPR_XTAL16RDY_IRQn_Msk          (0x40000000UL)            /*!< NVIC ICPR: XTAL16RDY_IRQn (Bitfield-Mask: 0x01)             */
#define NVIC_ICPR_Rsvd__irq__n_Pos            (31UL)                    /*!< NVIC ICPR: Rsvd__irq__n (Bit 31)                            */
#define NVIC_ICPR_Rsvd__irq__n_Msk            (0x80000000UL)            /*!< NVIC ICPR: Rsvd__irq__n (Bitfield-Mask: 0x01)               */

