wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AA.h
/* ----------------------------------  NVIC_IPR5  --------------------------------- */
#define NVIC_IPR5_QUADEC_IRQn_prio_Pos        (0UL)                     /*!< NVIC IPR5: QUADEC_IRQn_prio (Bit 0)                         */
#define NVIC_IPR5_QUADEC_IRQn_prio_Msk        (0xffUL)                  /*!< NVIC IPR5: QUADEC_IRQn_prio (Bitfield-Mask: 0xff)           */
#define NVIC_IPR5_USB_IRQn_prio_Pos           (8UL)                     /*!< NVIC IPR5: USB_IRQn_prio (Bit 8)                            */
#define NVIC_IPR5_USB_IRQn_prio_Msk           (0xff00UL)                /*!< NVIC IPR5: USB_IRQn_prio (Bitfield-Mask: 0xff)              */
#define NVIC_IPR5_PCM_IRQn_prio_Pos           (16UL)                    /*!< NVIC IPR5: PCM_IRQn_prio (Bit 16)                           */
#define NVIC_IPR5_PCM_IRQn_prio_Msk           (0xff0000UL)              /*!< NVIC IPR5: PCM_IRQn_prio (Bitfield-Mask: 0xff)              */
#define NVIC_IPR5_SRC_IN_IRQn_prio_Pos        (24UL)                    /*!< NVIC IPR5: SRC_IN_IRQn_prio (Bit 24)                        */
#define NVIC_IPR5_SRC_IN_IRQn_prio_Msk        (0xff000000UL)            /*!< NVIC IPR5: SRC_IN_IRQn_prio (Bitfield-Mask: 0xff)           */

/* ----------------------------------  NVIC_IPR6  --------------------------------- */
#define NVIC_IPR6_SRC_OUT_IRQn_prio_Pos       (0UL)                     /*!< NVIC IPR6: SRC_OUT_IRQn_prio (Bit 0)                        */
#define NVIC_IPR6_SRC_OUT_IRQn_prio_Msk       (0xffUL)                  /*!< NVIC IPR6: SRC_OUT_IRQn_prio (Bitfield-Mask: 0xff)          */
#define NVIC_IPR6_VBUS_IRQn_prio_Pos          (8UL)                     /*!< NVIC IPR6: VBUS_IRQn_prio (Bit 8)                           */
#define NVIC_IPR6_VBUS_IRQn_prio_Msk          (0xff00UL)                /*!< NVIC IPR6: VBUS_IRQn_prio (Bitfield-Mask: 0xff)             */
#define NVIC_IPR6_DMA_IRQn_prio_Pos           (16UL)                    /*!< NVIC IPR6: DMA_IRQn_prio (Bit 16)                           */
#define NVIC_IPR6_DMA_IRQn_prio_Msk           (0xff0000UL)              /*!< NVIC IPR6: DMA_IRQn_prio (Bitfield-Mask: 0xff)              */
#define NVIC_IPR6_RF_DIAG_IRQn_prio_Pos       (24UL)                    /*!< NVIC IPR6: RF_DIAG_IRQn_prio (Bit 24)                       */
#define NVIC_IPR6_RF_DIAG_IRQn_prio_Msk       (0xff000000UL)            /*!< NVIC IPR6: RF_DIAG_IRQn_prio (Bitfield-Mask: 0xff)          */

/* ----------------------------------  NVIC_IPR7  --------------------------------- */
#define NVIC_IPR7_TRNG_IRQn_prio_Pos          (0UL)                     /*!< NVIC IPR7: TRNG_IRQn_prio (Bit 0)                           */
#define NVIC_IPR7_TRNG_IRQn_prio_Msk          (0xffUL)                  /*!< NVIC IPR7: TRNG_IRQn_prio (Bitfield-Mask: 0xff)             */
#define NVIC_IPR7_DCDC_IRQn_prio_Pos          (8UL)                     /*!< NVIC IPR7: DCDC_IRQn_prio (Bit 8)                           */
#define NVIC_IPR7_DCDC_IRQn_prio_Msk          (0xff00UL)                /*!< NVIC IPR7: DCDC_IRQn_prio (Bitfield-Mask: 0xff)             */
#define NVIC_IPR7_XTAL16RDY_IRQn_prio_Pos     (16UL)                    /*!< NVIC IPR7: XTAL16RDY_IRQn_prio (Bit 16)                     */
#define NVIC_IPR7_XTAL16RDY_IRQn_prio_Msk     (0xff0000UL)              /*!< NVIC IPR7: XTAL16RDY_IRQn_prio (Bitfield-Mask: 0xff)        */
#define NVIC_IPR7_RESERVED31_IRQn_DONT_USE_Pos (24UL)                   /*!< NVIC IPR7: RESERVED31_IRQn_DONT_USE (Bit 24)                */
#define NVIC_IPR7_RESERVED31_IRQn_DONT_USE_Msk (0xff000000UL)           /*!< NVIC IPR7: RESERVED31_IRQn_DONT_USE (Bitfield-Mask: 0xff)   */






/* ================================================================================ */
/* ================        struct 'AES_HASH' Position & Mask       ================ */
/* ================================================================================ */


/* --------------------------  AES_HASH_CRYPTO_CTRL_REG  -------------------------- */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_ALG_Pos (0UL)                   /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_ALG (Bit 0)                */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_ALG_Msk (0x3UL)                 /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_ALG (Bitfield-Mask: 0x03)  */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_ALG_MD_Pos (2UL)                /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_ALG_MD (Bit 2)             */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_ALG_MD_Msk (0xcUL)              /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_ALG_MD (Bitfield-Mask: 0x03) */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_OUT_MD_Pos (4UL)                /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_OUT_MD (Bit 4)             */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_OUT_MD_Msk (0x10UL)             /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_OUT_MD (Bitfield-Mask: 0x01) */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_AES_KEY_SZ_Pos (5UL)            /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_AES_KEY_SZ (Bit 5)         */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_AES_KEY_SZ_Msk (0x60UL)         /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_AES_KEY_SZ (Bitfield-Mask: 0x03) */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_ENCDEC_Pos (7UL)                /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_ENCDEC (Bit 7)             */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_ENCDEC_Msk (0x80UL)             /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_ENCDEC (Bitfield-Mask: 0x01) */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_IRQ_EN_Pos (8UL)                /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_IRQ_EN (Bit 8)             */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_IRQ_EN_Msk (0x100UL)            /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_IRQ_EN (Bitfield-Mask: 0x01) */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_HASH_SEL_Pos (9UL)              /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_HASH_SEL (Bit 9)           */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_HASH_SEL_Msk (0x200UL)          /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_HASH_SEL (Bitfield-Mask: 0x01) */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_HASH_OUT_LEN_Pos (10UL)         /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_HASH_OUT_LEN (Bit 10)      */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_HASH_OUT_LEN_Msk (0xfc00UL)     /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_HASH_OUT_LEN (Bitfield-Mask: 0x3f) */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_MORE_IN_Pos (16UL)              /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_MORE_IN (Bit 16)           */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_MORE_IN_Msk (0x10000UL)         /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_MORE_IN (Bitfield-Mask: 0x01) */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_AES_KEXP_Pos (17UL)             /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_AES_KEXP (Bit 17)          */
#define AES_HASH_CRYPTO_CTRL_REG_CRYPTO_AES_KEXP_Msk (0x20000UL)        /*!< AES_HASH CRYPTO_CTRL_REG: CRYPTO_AES_KEXP (Bitfield-Mask: 0x01) */

/* --------------------------  AES_HASH_CRYPTO_START_REG  ------------------------- */
#define AES_HASH_CRYPTO_START_REG_CRYPTO_START_Pos (0UL)                /*!< AES_HASH CRYPTO_START_REG: CRYPTO_START (Bit 0)             */
#define AES_HASH_CRYPTO_START_REG_CRYPTO_START_Msk (0x1UL)              /*!< AES_HASH CRYPTO_START_REG: CRYPTO_START (Bitfield-Mask: 0x01) */

/* -----------------------  AES_HASH_CRYPTO_FETCH_ADDR_REG  ----------------------- */
#define AES_HASH_CRYPTO_FETCH_ADDR_REG_CRYPTO_FETCH_ADDR_Pos (0UL)      /*!< AES_HASH CRYPTO_FETCH_ADDR_REG: CRYPTO_FETCH_ADDR (Bit 0)   */
#define AES_HASH_CRYPTO_FETCH_ADDR_REG_CRYPTO_FETCH_ADDR_Msk (0xffffffffUL) /*!< AES_HASH CRYPTO_FETCH_ADDR_REG: CRYPTO_FETCH_ADDR (Bitfield-Mask: 0xffffffff) */

