wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AA.h
/* ----------------------------  ANAMISC_SOC_CTRL3_REG  --------------------------- */
#define ANAMISC_SOC_CTRL3_REG_SOC_VSAT_Pos    (0UL)                     /*!< ANAMISC SOC_CTRL3_REG: SOC_VSAT (Bit 0)                     */
#define ANAMISC_SOC_CTRL3_REG_SOC_VSAT_Msk    (0x3UL)                   /*!< ANAMISC SOC_CTRL3_REG: SOC_VSAT (Bitfield-Mask: 0x03)       */
#define ANAMISC_SOC_CTRL3_REG_SOC_DYNTARG_Pos (2UL)                     /*!< ANAMISC SOC_CTRL3_REG: SOC_DYNTARG (Bit 2)                  */
#define ANAMISC_SOC_CTRL3_REG_SOC_DYNTARG_Msk (0x4UL)                   /*!< ANAMISC SOC_CTRL3_REG: SOC_DYNTARG (Bitfield-Mask: 0x01)    */
#define ANAMISC_SOC_CTRL3_REG_SOC_DYNHYS_Pos  (3UL)                     /*!< ANAMISC SOC_CTRL3_REG: SOC_DYNHYS (Bit 3)                   */
#define ANAMISC_SOC_CTRL3_REG_SOC_DYNHYS_Msk  (0x8UL)                   /*!< ANAMISC SOC_CTRL3_REG: SOC_DYNHYS (Bitfield-Mask: 0x01)     */
#define ANAMISC_SOC_CTRL3_REG_SOC_VCMI_Pos    (4UL)                     /*!< ANAMISC SOC_CTRL3_REG: SOC_VCMI (Bit 4)                     */
#define ANAMISC_SOC_CTRL3_REG_SOC_VCMI_Msk    (0x30UL)                  /*!< ANAMISC SOC_CTRL3_REG: SOC_VCMI (Bitfield-Mask: 0x03)       */

/* ---------------------------  ANAMISC_SOC_ADD2CH_REG  --------------------------- */
#define ANAMISC_SOC_ADD2CH_REG_SOC_ADD2CH_Pos (0UL)                     /*!< ANAMISC SOC_ADD2CH_REG: SOC_ADD2CH (Bit 0)                  */
#define ANAMISC_SOC_ADD2CH_REG_SOC_ADD2CH_Msk (0xffffUL)                /*!< ANAMISC SOC_ADD2CH_REG: SOC_ADD2CH (Bitfield-Mask: 0xffff)  */

/* ------------------------  ANAMISC_SOC_CHARGE_CNTR1_REG  ------------------------ */
#define ANAMISC_SOC_CHARGE_CNTR1_REG_CHARGE_CNT1_Pos (0UL)              /*!< ANAMISC SOC_CHARGE_CNTR1_REG: CHARGE_CNT1 (Bit 0)           */
#define ANAMISC_SOC_CHARGE_CNTR1_REG_CHARGE_CNT1_Msk (0xffffUL)         /*!< ANAMISC SOC_CHARGE_CNTR1_REG: CHARGE_CNT1 (Bitfield-Mask: 0xffff) */

/* ------------------------  ANAMISC_SOC_CHARGE_CNTR2_REG  ------------------------ */
#define ANAMISC_SOC_CHARGE_CNTR2_REG_CHARGE_CNT2_Pos (0UL)              /*!< ANAMISC SOC_CHARGE_CNTR2_REG: CHARGE_CNT2 (Bit 0)           */
#define ANAMISC_SOC_CHARGE_CNTR2_REG_CHARGE_CNT2_Msk (0xffffUL)         /*!< ANAMISC SOC_CHARGE_CNTR2_REG: CHARGE_CNT2 (Bitfield-Mask: 0xffff) */

/* ------------------------  ANAMISC_SOC_CHARGE_CNTR3_REG  ------------------------ */
#define ANAMISC_SOC_CHARGE_CNTR3_REG_CHARGE_CNT3_Pos (0UL)              /*!< ANAMISC SOC_CHARGE_CNTR3_REG: CHARGE_CNT3 (Bit 0)           */
#define ANAMISC_SOC_CHARGE_CNTR3_REG_CHARGE_CNT3_Msk (0xffUL)           /*!< ANAMISC SOC_CHARGE_CNTR3_REG: CHARGE_CNT3 (Bitfield-Mask: 0xff) */

/* -------------------------  ANAMISC_SOC_CHARGE_AVG_REG  ------------------------- */
#define ANAMISC_SOC_CHARGE_AVG_REG_CHARGE_AVG_Pos (0UL)                 /*!< ANAMISC SOC_CHARGE_AVG_REG: CHARGE_AVG (Bit 0)              */
#define ANAMISC_SOC_CHARGE_AVG_REG_CHARGE_AVG_Msk (0xffffUL)            /*!< ANAMISC SOC_CHARGE_AVG_REG: CHARGE_AVG (Bitfield-Mask: 0xffff) */

/* ---------------------------  ANAMISC_SOC_STATUS_REG  --------------------------- */
#define ANAMISC_SOC_STATUS_REG_SOC_INT_OVERLOAD_Pos (0UL)               /*!< ANAMISC SOC_STATUS_REG: SOC_INT_OVERLOAD (Bit 0)            */
#define ANAMISC_SOC_STATUS_REG_SOC_INT_OVERLOAD_Msk (0x1UL)             /*!< ANAMISC SOC_STATUS_REG: SOC_INT_OVERLOAD (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_STATUS_REG_SOC_INT_LOCKED_Pos (1UL)                 /*!< ANAMISC SOC_STATUS_REG: SOC_INT_LOCKED (Bit 1)              */
#define ANAMISC_SOC_STATUS_REG_SOC_INT_LOCKED_Msk (0x2UL)               /*!< ANAMISC SOC_STATUS_REG: SOC_INT_LOCKED (Bitfield-Mask: 0x01) */

/* ---------------------------  ANAMISC_SOC_EXT_IN_REG  --------------------------- */
#define ANAMISC_SOC_EXT_IN_REG_SOC_IDAC_VAL_Pos (0UL)                   /*!< ANAMISC SOC_EXT_IN_REG: SOC_IDAC_VAL (Bit 0)                */
#define ANAMISC_SOC_EXT_IN_REG_SOC_IDAC_VAL_Msk (0x1ffUL)               /*!< ANAMISC SOC_EXT_IN_REG: SOC_IDAC_VAL (Bitfield-Mask: 0x1ff) */
#define ANAMISC_SOC_EXT_IN_REG_SOC_IDAC_SIGN_Pos (9UL)                  /*!< ANAMISC SOC_EXT_IN_REG: SOC_IDAC_SIGN (Bit 9)               */
#define ANAMISC_SOC_EXT_IN_REG_SOC_IDAC_SIGN_Msk (0x200UL)              /*!< ANAMISC SOC_EXT_IN_REG: SOC_IDAC_SIGN (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_EXT_IN_REG_SOC_RDAC_DIS_Pos (10UL)                  /*!< ANAMISC SOC_EXT_IN_REG: SOC_RDAC_DIS (Bit 10)               */
#define ANAMISC_SOC_EXT_IN_REG_SOC_RDAC_DIS_Msk (0x400UL)               /*!< ANAMISC SOC_EXT_IN_REG: SOC_RDAC_DIS (Bitfield-Mask: 0x01)  */
#define ANAMISC_SOC_EXT_IN_REG_SOC_NR_SCYCLE_Pos (11UL)                 /*!< ANAMISC SOC_EXT_IN_REG: SOC_NR_SCYCLE (Bit 11)              */
#define ANAMISC_SOC_EXT_IN_REG_SOC_NR_SCYCLE_Msk (0x3800UL)             /*!< ANAMISC SOC_EXT_IN_REG: SOC_NR_SCYCLE (Bitfield-Mask: 0x07) */
#define ANAMISC_SOC_EXT_IN_REG_SOC_EXT_SCYCLE_EN_Pos (14UL)             /*!< ANAMISC SOC_EXT_IN_REG: SOC_EXT_SCYCLE_EN (Bit 14)          */
#define ANAMISC_SOC_EXT_IN_REG_SOC_EXT_SCYCLE_EN_Msk (0x4000UL)         /*!< ANAMISC SOC_EXT_IN_REG: SOC_EXT_SCYCLE_EN (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_EXT_IN_REG_SOC_EXT_IDAC_EN_Pos (15UL)               /*!< ANAMISC SOC_EXT_IN_REG: SOC_EXT_IDAC_EN (Bit 15)            */
#define ANAMISC_SOC_EXT_IN_REG_SOC_EXT_IDAC_EN_Msk (0x8000UL)           /*!< ANAMISC SOC_EXT_IN_REG: SOC_EXT_IDAC_EN (Bitfield-Mask: 0x01) */

/* ---------------------------  ANAMISC_SOC_EXT_OUT_REG  -------------------------- */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_HIGH_LIM_Pos (0UL)                  /*!< ANAMISC SOC_EXT_OUT_REG: SOC_HIGH_LIM (Bit 0)               */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_HIGH_LIM_Msk (0x1UL)                /*!< ANAMISC SOC_EXT_OUT_REG: SOC_HIGH_LIM (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_LOWLIM_COMP_Pos (1UL)               /*!< ANAMISC SOC_EXT_OUT_REG: SOC_LOWLIM_COMP (Bit 1)            */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_LOWLIM_COMP_Msk (0x2UL)             /*!< ANAMISC SOC_EXT_OUT_REG: SOC_LOWLIM_COMP (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_POS_COMP_Pos (2UL)                  /*!< ANAMISC SOC_EXT_OUT_REG: SOC_POS_COMP (Bit 2)               */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_POS_COMP_Msk (0x4UL)                /*!< ANAMISC SOC_EXT_OUT_REG: SOC_POS_COMP (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_RISING_COMP_Pos (3UL)               /*!< ANAMISC SOC_EXT_OUT_REG: SOC_RISING_COMP (Bit 3)            */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_RISING_COMP_Msk (0x8UL)             /*!< ANAMISC SOC_EXT_OUT_REG: SOC_RISING_COMP (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_STATE_Pos (4UL)                     /*!< ANAMISC SOC_EXT_OUT_REG: SOC_STATE (Bit 4)                  */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_STATE_Msk (0xf0UL)                  /*!< ANAMISC SOC_EXT_OUT_REG: SOC_STATE (Bitfield-Mask: 0x0f)    */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_CTRL_EVENT_Pos (8UL)                /*!< ANAMISC SOC_EXT_OUT_REG: SOC_CTRL_EVENT (Bit 8)             */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_CTRL_EVENT_Msk (0x100UL)            /*!< ANAMISC SOC_EXT_OUT_REG: SOC_CTRL_EVENT (Bitfield-Mask: 0x01) */

/* ---------------------------  ANAMISC_CLK_REF_SEL_REG  -------------------------- */
#define ANAMISC_CLK_REF_SEL_REG_REF_CLK_SEL_Pos (0UL)                   /*!< ANAMISC CLK_REF_SEL_REG: REF_CLK_SEL (Bit 0)                */
#define ANAMISC_CLK_REF_SEL_REG_REF_CLK_SEL_Msk (0x3UL)                 /*!< ANAMISC CLK_REF_SEL_REG: REF_CLK_SEL (Bitfield-Mask: 0x03)  */
#define ANAMISC_CLK_REF_SEL_REG_REF_CAL_START_Pos (2UL)                 /*!< ANAMISC CLK_REF_SEL_REG: REF_CAL_START (Bit 2)              */
#define ANAMISC_CLK_REF_SEL_REG_REF_CAL_START_Msk (0x4UL)               /*!< ANAMISC CLK_REF_SEL_REG: REF_CAL_START (Bitfield-Mask: 0x01) */

