wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AA.h
/* --------------------------  BLE_BLE_RFTESTRXSTAT_REG  -------------------------- */
#define BLE_BLE_RFTESTRXSTAT_REG_RXPKTCNT_Pos (0UL)                     /*!< BLE BLE_RFTESTRXSTAT_REG: RXPKTCNT (Bit 0)                  */
#define BLE_BLE_RFTESTRXSTAT_REG_RXPKTCNT_Msk (0xffffffffUL)            /*!< BLE BLE_RFTESTRXSTAT_REG: RXPKTCNT (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  BLE_BLE_TIMGENCNTL_REG  --------------------------- */
#define BLE_BLE_TIMGENCNTL_REG_PREFETCH_TIME_Pos (0UL)                  /*!< BLE BLE_TIMGENCNTL_REG: PREFETCH_TIME (Bit 0)               */
#define BLE_BLE_TIMGENCNTL_REG_PREFETCH_TIME_Msk (0x1ffUL)              /*!< BLE BLE_TIMGENCNTL_REG: PREFETCH_TIME (Bitfield-Mask: 0x1ff) */
#define BLE_BLE_TIMGENCNTL_REG_PREFETCHABORT_TIME_Pos (16UL)            /*!< BLE BLE_TIMGENCNTL_REG: PREFETCHABORT_TIME (Bit 16)         */
#define BLE_BLE_TIMGENCNTL_REG_PREFETCHABORT_TIME_Msk (0x3ff0000UL)     /*!< BLE BLE_TIMGENCNTL_REG: PREFETCHABORT_TIME (Bitfield-Mask: 0x3ff) */
#define BLE_BLE_TIMGENCNTL_REG_APFM_EN_Pos    (31UL)                    /*!< BLE BLE_TIMGENCNTL_REG: APFM_EN (Bit 31)                    */
#define BLE_BLE_TIMGENCNTL_REG_APFM_EN_Msk    (0x80000000UL)            /*!< BLE BLE_TIMGENCNTL_REG: APFM_EN (Bitfield-Mask: 0x01)       */

/* ---------------------------  BLE_BLE_GROSSTIMTGT_REG  -------------------------- */
#define BLE_BLE_GROSSTIMTGT_REG_GROSSTARGET_Pos (0UL)                   /*!< BLE BLE_GROSSTIMTGT_REG: GROSSTARGET (Bit 0)                */
#define BLE_BLE_GROSSTIMTGT_REG_GROSSTARGET_Msk (0x7fffffUL)            /*!< BLE BLE_GROSSTIMTGT_REG: GROSSTARGET (Bitfield-Mask: 0x7fffff) */

/* ---------------------------  BLE_BLE_FINETIMTGT_REG  --------------------------- */
#define BLE_BLE_FINETIMTGT_REG_FINETARGET_Pos (0UL)                     /*!< BLE BLE_FINETIMTGT_REG: FINETARGET (Bit 0)                  */
#define BLE_BLE_FINETIMTGT_REG_FINETARGET_Msk (0x7ffffffUL)             /*!< BLE BLE_FINETIMTGT_REG: FINETARGET (Bitfield-Mask: 0x7ffffff) */

/* ----------------------------  BLE_BLE_SAMPLECLK_REG  --------------------------- */
#define BLE_BLE_SAMPLECLK_REG_SAMP_Pos        (0UL)                     /*!< BLE BLE_SAMPLECLK_REG: SAMP (Bit 0)                         */
#define BLE_BLE_SAMPLECLK_REG_SAMP_Msk        (0x1UL)                   /*!< BLE BLE_SAMPLECLK_REG: SAMP (Bitfield-Mask: 0x01)           */

/* ---------------------------  BLE_BLE_COEXIFCNTL0_REG  -------------------------- */
#define BLE_BLE_COEXIFCNTL0_REG_COEX_EN_Pos   (0UL)                     /*!< BLE BLE_COEXIFCNTL0_REG: COEX_EN (Bit 0)                    */
#define BLE_BLE_COEXIFCNTL0_REG_COEX_EN_Msk   (0x1UL)                   /*!< BLE BLE_COEXIFCNTL0_REG: COEX_EN (Bitfield-Mask: 0x01)      */
#define BLE_BLE_COEXIFCNTL0_REG_SYNCGEN_EN_Pos (1UL)                    /*!< BLE BLE_COEXIFCNTL0_REG: SYNCGEN_EN (Bit 1)                 */
#define BLE_BLE_COEXIFCNTL0_REG_SYNCGEN_EN_Msk (0x2UL)                  /*!< BLE BLE_COEXIFCNTL0_REG: SYNCGEN_EN (Bitfield-Mask: 0x01)   */
#define BLE_BLE_COEXIFCNTL0_REG_WLANRXMSK_Pos (4UL)                     /*!< BLE BLE_COEXIFCNTL0_REG: WLANRXMSK (Bit 4)                  */
#define BLE_BLE_COEXIFCNTL0_REG_WLANRXMSK_Msk (0x30UL)                  /*!< BLE BLE_COEXIFCNTL0_REG: WLANRXMSK (Bitfield-Mask: 0x03)    */
#define BLE_BLE_COEXIFCNTL0_REG_WLANTXMSK_Pos (6UL)                     /*!< BLE BLE_COEXIFCNTL0_REG: WLANTXMSK (Bit 6)                  */
#define BLE_BLE_COEXIFCNTL0_REG_WLANTXMSK_Msk (0xc0UL)                  /*!< BLE BLE_COEXIFCNTL0_REG: WLANTXMSK (Bitfield-Mask: 0x03)    */
#define BLE_BLE_COEXIFCNTL0_REG_WLCTXPRIOMODE_Pos (16UL)                /*!< BLE BLE_COEXIFCNTL0_REG: WLCTXPRIOMODE (Bit 16)             */
#define BLE_BLE_COEXIFCNTL0_REG_WLCTXPRIOMODE_Msk (0x30000UL)           /*!< BLE BLE_COEXIFCNTL0_REG: WLCTXPRIOMODE (Bitfield-Mask: 0x03) */
#define BLE_BLE_COEXIFCNTL0_REG_WLCRXPRIOMODE_Pos (20UL)                /*!< BLE BLE_COEXIFCNTL0_REG: WLCRXPRIOMODE (Bit 20)             */
#define BLE_BLE_COEXIFCNTL0_REG_WLCRXPRIOMODE_Msk (0x300000UL)          /*!< BLE BLE_COEXIFCNTL0_REG: WLCRXPRIOMODE (Bitfield-Mask: 0x03) */

/* ---------------------------  BLE_BLE_COEXIFCNTL1_REG  -------------------------- */
#define BLE_BLE_COEXIFCNTL1_REG_WLCPDELAY_Pos (0UL)                     /*!< BLE BLE_COEXIFCNTL1_REG: WLCPDELAY (Bit 0)                  */
#define BLE_BLE_COEXIFCNTL1_REG_WLCPDELAY_Msk (0x7fUL)                  /*!< BLE BLE_COEXIFCNTL1_REG: WLCPDELAY (Bitfield-Mask: 0x7f)    */
#define BLE_BLE_COEXIFCNTL1_REG_WLCPDURATION_Pos (8UL)                  /*!< BLE BLE_COEXIFCNTL1_REG: WLCPDURATION (Bit 8)               */
#define BLE_BLE_COEXIFCNTL1_REG_WLCPDURATION_Msk (0x7f00UL)             /*!< BLE BLE_COEXIFCNTL1_REG: WLCPDURATION (Bitfield-Mask: 0x7f) */
#define BLE_BLE_COEXIFCNTL1_REG_WLCPTXTHR_Pos (16UL)                    /*!< BLE BLE_COEXIFCNTL1_REG: WLCPTXTHR (Bit 16)                 */
#define BLE_BLE_COEXIFCNTL1_REG_WLCPTXTHR_Msk (0x1f0000UL)              /*!< BLE BLE_COEXIFCNTL1_REG: WLCPTXTHR (Bitfield-Mask: 0x1f)    */
#define BLE_BLE_COEXIFCNTL1_REG_WLCPRXTHR_Pos (24UL)                    /*!< BLE BLE_COEXIFCNTL1_REG: WLCPRXTHR (Bit 24)                 */
#define BLE_BLE_COEXIFCNTL1_REG_WLCPRXTHR_Msk (0x1f000000UL)            /*!< BLE BLE_COEXIFCNTL1_REG: WLCPRXTHR (Bitfield-Mask: 0x1f)    */

/* ----------------------------  BLE_BLE_BLEMPRIO0_REG  --------------------------- */
#define BLE_BLE_BLEMPRIO0_REG_BLEM0_Pos       (0UL)                     /*!< BLE BLE_BLEMPRIO0_REG: BLEM0 (Bit 0)                        */
#define BLE_BLE_BLEMPRIO0_REG_BLEM0_Msk       (0xfUL)                   /*!< BLE BLE_BLEMPRIO0_REG: BLEM0 (Bitfield-Mask: 0x0f)          */
#define BLE_BLE_BLEMPRIO0_REG_BLEM1_Pos       (4UL)                     /*!< BLE BLE_BLEMPRIO0_REG: BLEM1 (Bit 4)                        */
#define BLE_BLE_BLEMPRIO0_REG_BLEM1_Msk       (0xf0UL)                  /*!< BLE BLE_BLEMPRIO0_REG: BLEM1 (Bitfield-Mask: 0x0f)          */
#define BLE_BLE_BLEMPRIO0_REG_BLEM2_Pos       (8UL)                     /*!< BLE BLE_BLEMPRIO0_REG: BLEM2 (Bit 8)                        */
#define BLE_BLE_BLEMPRIO0_REG_BLEM2_Msk       (0xf00UL)                 /*!< BLE BLE_BLEMPRIO0_REG: BLEM2 (Bitfield-Mask: 0x0f)          */
#define BLE_BLE_BLEMPRIO0_REG_BLEM3_Pos       (12UL)                    /*!< BLE BLE_BLEMPRIO0_REG: BLEM3 (Bit 12)                       */
#define BLE_BLE_BLEMPRIO0_REG_BLEM3_Msk       (0xf000UL)                /*!< BLE BLE_BLEMPRIO0_REG: BLEM3 (Bitfield-Mask: 0x0f)          */
#define BLE_BLE_BLEMPRIO0_REG_BLEM4_Pos       (16UL)                    /*!< BLE BLE_BLEMPRIO0_REG: BLEM4 (Bit 16)                       */
#define BLE_BLE_BLEMPRIO0_REG_BLEM4_Msk       (0xf0000UL)               /*!< BLE BLE_BLEMPRIO0_REG: BLEM4 (Bitfield-Mask: 0x0f)          */
#define BLE_BLE_BLEMPRIO0_REG_BLEM5_Pos       (20UL)                    /*!< BLE BLE_BLEMPRIO0_REG: BLEM5 (Bit 20)                       */
#define BLE_BLE_BLEMPRIO0_REG_BLEM5_Msk       (0xf00000UL)              /*!< BLE BLE_BLEMPRIO0_REG: BLEM5 (Bitfield-Mask: 0x0f)          */
#define BLE_BLE_BLEMPRIO0_REG_BLEM6_Pos       (24UL)                    /*!< BLE BLE_BLEMPRIO0_REG: BLEM6 (Bit 24)                       */
#define BLE_BLE_BLEMPRIO0_REG_BLEM6_Msk       (0xf000000UL)             /*!< BLE BLE_BLEMPRIO0_REG: BLEM6 (Bitfield-Mask: 0x0f)          */
#define BLE_BLE_BLEMPRIO0_REG_BLEM7_Pos       (28UL)                    /*!< BLE BLE_BLEMPRIO0_REG: BLEM7 (Bit 28)                       */
#define BLE_BLE_BLEMPRIO0_REG_BLEM7_Msk       (0xf0000000UL)            /*!< BLE BLE_BLEMPRIO0_REG: BLEM7 (Bitfield-Mask: 0x0f)          */

/* ----------------------------  BLE_BLE_BLEMPRIO1_REG  --------------------------- */
#define BLE_BLE_BLEMPRIO1_REG_BLEMDEFAULT_Pos (28UL)                    /*!< BLE BLE_BLEMPRIO1_REG: BLEMDEFAULT (Bit 28)                 */
#define BLE_BLE_BLEMPRIO1_REG_BLEMDEFAULT_Msk (0xf0000000UL)            /*!< BLE BLE_BLEMPRIO1_REG: BLEMDEFAULT (Bitfield-Mask: 0x0f)    */

/* --------------------------  BLE_BLE_BLEPRIOSCHARB_REG  ------------------------- */
#define BLE_BLE_BLEPRIOSCHARB_REG_BLEMARGIN_Pos (0UL)                   /*!< BLE BLE_BLEPRIOSCHARB_REG: BLEMARGIN (Bit 0)                */
#define BLE_BLE_BLEPRIOSCHARB_REG_BLEMARGIN_Msk (0xffUL)                /*!< BLE BLE_BLEPRIOSCHARB_REG: BLEMARGIN (Bitfield-Mask: 0xff)  */
#define BLE_BLE_BLEPRIOSCHARB_REG_BLEPRIOMODE_Pos (15UL)                /*!< BLE BLE_BLEPRIOSCHARB_REG: BLEPRIOMODE (Bit 15)             */
#define BLE_BLE_BLEPRIOSCHARB_REG_BLEPRIOMODE_Msk (0x8000UL)            /*!< BLE BLE_BLEPRIOSCHARB_REG: BLEPRIOMODE (Bitfield-Mask: 0x01) */

/* ------------------------------  BLE_BLE_CNTL2_REG  ----------------------------- */
#define BLE_BLE_CNTL2_REG_EMACCERRSTAT_Pos    (0UL)                     /*!< BLE BLE_CNTL2_REG: EMACCERRSTAT (Bit 0)                     */
#define BLE_BLE_CNTL2_REG_EMACCERRSTAT_Msk    (0x1UL)                   /*!< BLE BLE_CNTL2_REG: EMACCERRSTAT (Bitfield-Mask: 0x01)       */
#define BLE_BLE_CNTL2_REG_EMACCERRACK_Pos     (1UL)                     /*!< BLE BLE_CNTL2_REG: EMACCERRACK (Bit 1)                      */
#define BLE_BLE_CNTL2_REG_EMACCERRACK_Msk     (0x2UL)                   /*!< BLE BLE_CNTL2_REG: EMACCERRACK (Bitfield-Mask: 0x01)        */
#define BLE_BLE_CNTL2_REG_EMACCERRMSK_Pos     (2UL)                     /*!< BLE BLE_CNTL2_REG: EMACCERRMSK (Bit 2)                      */
#define BLE_BLE_CNTL2_REG_EMACCERRMSK_Msk     (0x4UL)                   /*!< BLE BLE_CNTL2_REG: EMACCERRMSK (Bitfield-Mask: 0x01)        */
#define BLE_BLE_CNTL2_REG_BLE_CLK_STAT_Pos    (6UL)                     /*!< BLE BLE_CNTL2_REG: BLE_CLK_STAT (Bit 6)                     */
#define BLE_BLE_CNTL2_REG_BLE_CLK_STAT_Msk    (0x40UL)                  /*!< BLE BLE_CNTL2_REG: BLE_CLK_STAT (Bitfield-Mask: 0x01)       */
#define BLE_BLE_CNTL2_REG_MON_LP_CLK_Pos      (7UL)                     /*!< BLE BLE_CNTL2_REG: MON_LP_CLK (Bit 7)                       */
#define BLE_BLE_CNTL2_REG_MON_LP_CLK_Msk      (0x80UL)                  /*!< BLE BLE_CNTL2_REG: MON_LP_CLK (Bitfield-Mask: 0x01)         */
#define BLE_BLE_CNTL2_REG_RADIO_PWRDN_ALLOW_Pos (8UL)                   /*!< BLE BLE_CNTL2_REG: RADIO_PWRDN_ALLOW (Bit 8)                */
#define BLE_BLE_CNTL2_REG_RADIO_PWRDN_ALLOW_Msk (0x100UL)               /*!< BLE BLE_CNTL2_REG: RADIO_PWRDN_ALLOW (Bitfield-Mask: 0x01)  */
#define BLE_BLE_CNTL2_REG_BLE_CLK_SEL_Pos     (9UL)                     /*!< BLE BLE_CNTL2_REG: BLE_CLK_SEL (Bit 9)                      */
#define BLE_BLE_CNTL2_REG_BLE_CLK_SEL_Msk     (0x7e00UL)                /*!< BLE BLE_CNTL2_REG: BLE_CLK_SEL (Bitfield-Mask: 0x3f)        */
#define BLE_BLE_CNTL2_REG_SW_RPL_SPI_Pos      (19UL)                    /*!< BLE BLE_CNTL2_REG: SW_RPL_SPI (Bit 19)                      */
#define BLE_BLE_CNTL2_REG_SW_RPL_SPI_Msk      (0x80000UL)               /*!< BLE BLE_CNTL2_REG: SW_RPL_SPI (Bitfield-Mask: 0x01)         */
#define BLE_BLE_CNTL2_REG_WAKEUPLPSTAT_Pos    (20UL)                    /*!< BLE BLE_CNTL2_REG: WAKEUPLPSTAT (Bit 20)                    */
#define BLE_BLE_CNTL2_REG_WAKEUPLPSTAT_Msk    (0x100000UL)              /*!< BLE BLE_CNTL2_REG: WAKEUPLPSTAT (Bitfield-Mask: 0x01)       */
#define BLE_BLE_CNTL2_REG_BLE_RSSI_SEL_Pos    (21UL)                    /*!< BLE BLE_CNTL2_REG: BLE_RSSI_SEL (Bit 21)                    */
#define BLE_BLE_CNTL2_REG_BLE_RSSI_SEL_Msk    (0x200000UL)              /*!< BLE BLE_CNTL2_REG: BLE_RSSI_SEL (Bitfield-Mask: 0x01)       */

/* -----------------------------  BLE_BLE_EM_BASE_REG  ---------------------------- */
#define BLE_BLE_EM_BASE_REG_BLE_EM_BASE_16_10_Pos (10UL)                /*!< BLE BLE_EM_BASE_REG: BLE_EM_BASE_16_10 (Bit 10)             */
#define BLE_BLE_EM_BASE_REG_BLE_EM_BASE_16_10_Msk (0x1fc00UL)           /*!< BLE BLE_EM_BASE_REG: BLE_EM_BASE_16_10 (Bitfield-Mask: 0x7f) */

/* ----------------------------  BLE_BLE_DIAGCNTL2_REG  --------------------------- */
#define BLE_BLE_DIAGCNTL2_REG_DIAG4_Pos       (0UL)                     /*!< BLE BLE_DIAGCNTL2_REG: DIAG4 (Bit 0)                        */
#define BLE_BLE_DIAGCNTL2_REG_DIAG4_Msk       (0x3fUL)                  /*!< BLE BLE_DIAGCNTL2_REG: DIAG4 (Bitfield-Mask: 0x3f)          */
#define BLE_BLE_DIAGCNTL2_REG_DIAG4_EN_Pos    (7UL)                     /*!< BLE BLE_DIAGCNTL2_REG: DIAG4_EN (Bit 7)                     */
#define BLE_BLE_DIAGCNTL2_REG_DIAG4_EN_Msk    (0x80UL)                  /*!< BLE BLE_DIAGCNTL2_REG: DIAG4_EN (Bitfield-Mask: 0x01)       */
#define BLE_BLE_DIAGCNTL2_REG_DIAG5_Pos       (8UL)                     /*!< BLE BLE_DIAGCNTL2_REG: DIAG5 (Bit 8)                        */
#define BLE_BLE_DIAGCNTL2_REG_DIAG5_Msk       (0x3f00UL)                /*!< BLE BLE_DIAGCNTL2_REG: DIAG5 (Bitfield-Mask: 0x3f)          */
#define BLE_BLE_DIAGCNTL2_REG_DIAG5_EN_Pos    (15UL)                    /*!< BLE BLE_DIAGCNTL2_REG: DIAG5_EN (Bit 15)                    */
#define BLE_BLE_DIAGCNTL2_REG_DIAG5_EN_Msk    (0x8000UL)                /*!< BLE BLE_DIAGCNTL2_REG: DIAG5_EN (Bitfield-Mask: 0x01)       */
#define BLE_BLE_DIAGCNTL2_REG_DIAG6_Pos       (16UL)                    /*!< BLE BLE_DIAGCNTL2_REG: DIAG6 (Bit 16)                       */
#define BLE_BLE_DIAGCNTL2_REG_DIAG6_Msk       (0x3f0000UL)              /*!< BLE BLE_DIAGCNTL2_REG: DIAG6 (Bitfield-Mask: 0x3f)          */
#define BLE_BLE_DIAGCNTL2_REG_DIAG6_EN_Pos    (23UL)                    /*!< BLE BLE_DIAGCNTL2_REG: DIAG6_EN (Bit 23)                    */
#define BLE_BLE_DIAGCNTL2_REG_DIAG6_EN_Msk    (0x800000UL)              /*!< BLE BLE_DIAGCNTL2_REG: DIAG6_EN (Bitfield-Mask: 0x01)       */
#define BLE_BLE_DIAGCNTL2_REG_DIAG7_Pos       (24UL)                    /*!< BLE BLE_DIAGCNTL2_REG: DIAG7 (Bit 24)                       */
#define BLE_BLE_DIAGCNTL2_REG_DIAG7_Msk       (0x3f000000UL)            /*!< BLE BLE_DIAGCNTL2_REG: DIAG7 (Bitfield-Mask: 0x3f)          */
#define BLE_BLE_DIAGCNTL2_REG_DIAG7_EN_Pos    (31UL)                    /*!< BLE BLE_DIAGCNTL2_REG: DIAG7_EN (Bit 31)                    */
#define BLE_BLE_DIAGCNTL2_REG_DIAG7_EN_Msk    (0x80000000UL)            /*!< BLE BLE_DIAGCNTL2_REG: DIAG7_EN (Bitfield-Mask: 0x01)       */

/* ----------------------------  BLE_BLE_DIAGCNTL3_REG  --------------------------- */
#define BLE_BLE_DIAGCNTL3_REG_DIAG0_BIT_Pos   (0UL)                     /*!< BLE BLE_DIAGCNTL3_REG: DIAG0_BIT (Bit 0)                    */
#define BLE_BLE_DIAGCNTL3_REG_DIAG0_BIT_Msk   (0x7UL)                   /*!< BLE BLE_DIAGCNTL3_REG: DIAG0_BIT (Bitfield-Mask: 0x07)      */
#define BLE_BLE_DIAGCNTL3_REG_DIAG0_INV_Pos   (3UL)                     /*!< BLE BLE_DIAGCNTL3_REG: DIAG0_INV (Bit 3)                    */
#define BLE_BLE_DIAGCNTL3_REG_DIAG0_INV_Msk   (0x8UL)                   /*!< BLE BLE_DIAGCNTL3_REG: DIAG0_INV (Bitfield-Mask: 0x01)      */
#define BLE_BLE_DIAGCNTL3_REG_DIAG1_BIT_Pos   (4UL)                     /*!< BLE BLE_DIAGCNTL3_REG: DIAG1_BIT (Bit 4)                    */
#define BLE_BLE_DIAGCNTL3_REG_DIAG1_BIT_Msk   (0x70UL)                  /*!< BLE BLE_DIAGCNTL3_REG: DIAG1_BIT (Bitfield-Mask: 0x07)      */
#define BLE_BLE_DIAGCNTL3_REG_DIAG1_INV_Pos   (7UL)                     /*!< BLE BLE_DIAGCNTL3_REG: DIAG1_INV (Bit 7)                    */
#define BLE_BLE_DIAGCNTL3_REG_DIAG1_INV_Msk   (0x80UL)                  /*!< BLE BLE_DIAGCNTL3_REG: DIAG1_INV (Bitfield-Mask: 0x01)      */
#define BLE_BLE_DIAGCNTL3_REG_DIAG2_BIT_Pos   (8UL)                     /*!< BLE BLE_DIAGCNTL3_REG: DIAG2_BIT (Bit 8)                    */
#define BLE_BLE_DIAGCNTL3_REG_DIAG2_BIT_Msk   (0x700UL)                 /*!< BLE BLE_DIAGCNTL3_REG: DIAG2_BIT (Bitfield-Mask: 0x07)      */
#define BLE_BLE_DIAGCNTL3_REG_DIAG2_INV_Pos   (11UL)                    /*!< BLE BLE_DIAGCNTL3_REG: DIAG2_INV (Bit 11)                   */
#define BLE_BLE_DIAGCNTL3_REG_DIAG2_INV_Msk   (0x800UL)                 /*!< BLE BLE_DIAGCNTL3_REG: DIAG2_INV (Bitfield-Mask: 0x01)      */
#define BLE_BLE_DIAGCNTL3_REG_DIAG3_BIT_Pos   (12UL)                    /*!< BLE BLE_DIAGCNTL3_REG: DIAG3_BIT (Bit 12)                   */
#define BLE_BLE_DIAGCNTL3_REG_DIAG3_BIT_Msk   (0x7000UL)                /*!< BLE BLE_DIAGCNTL3_REG: DIAG3_BIT (Bitfield-Mask: 0x07)      */
#define BLE_BLE_DIAGCNTL3_REG_DIAG3_INV_Pos   (15UL)                    /*!< BLE BLE_DIAGCNTL3_REG: DIAG3_INV (Bit 15)                   */
#define BLE_BLE_DIAGCNTL3_REG_DIAG3_INV_Msk   (0x8000UL)                /*!< BLE BLE_DIAGCNTL3_REG: DIAG3_INV (Bitfield-Mask: 0x01)      */
#define BLE_BLE_DIAGCNTL3_REG_DIAG4_BIT_Pos   (16UL)                    /*!< BLE BLE_DIAGCNTL3_REG: DIAG4_BIT (Bit 16)                   */
#define BLE_BLE_DIAGCNTL3_REG_DIAG4_BIT_Msk   (0x70000UL)               /*!< BLE BLE_DIAGCNTL3_REG: DIAG4_BIT (Bitfield-Mask: 0x07)      */
#define BLE_BLE_DIAGCNTL3_REG_DIAG4_INV_Pos   (19UL)                    /*!< BLE BLE_DIAGCNTL3_REG: DIAG4_INV (Bit 19)                   */
#define BLE_BLE_DIAGCNTL3_REG_DIAG4_INV_Msk   (0x80000UL)               /*!< BLE BLE_DIAGCNTL3_REG: DIAG4_INV (Bitfield-Mask: 0x01)      */
#define BLE_BLE_DIAGCNTL3_REG_DIAG5_BIT_Pos   (20UL)                    /*!< BLE BLE_DIAGCNTL3_REG: DIAG5_BIT (Bit 20)                   */
#define BLE_BLE_DIAGCNTL3_REG_DIAG5_BIT_Msk   (0x700000UL)              /*!< BLE BLE_DIAGCNTL3_REG: DIAG5_BIT (Bitfield-Mask: 0x07)      */
#define BLE_BLE_DIAGCNTL3_REG_DIAG5_INV_Pos   (23UL)                    /*!< BLE BLE_DIAGCNTL3_REG: DIAG5_INV (Bit 23)                   */
#define BLE_BLE_DIAGCNTL3_REG_DIAG5_INV_Msk   (0x800000UL)              /*!< BLE BLE_DIAGCNTL3_REG: DIAG5_INV (Bitfield-Mask: 0x01)      */
#define BLE_BLE_DIAGCNTL3_REG_DIAG6_BIT_Pos   (24UL)                    /*!< BLE BLE_DIAGCNTL3_REG: DIAG6_BIT (Bit 24)                   */
#define BLE_BLE_DIAGCNTL3_REG_DIAG6_BIT_Msk   (0x7000000UL)             /*!< BLE BLE_DIAGCNTL3_REG: DIAG6_BIT (Bitfield-Mask: 0x07)      */
#define BLE_BLE_DIAGCNTL3_REG_DIAG6_INV_Pos   (27UL)                    /*!< BLE BLE_DIAGCNTL3_REG: DIAG6_INV (Bit 27)                   */
#define BLE_BLE_DIAGCNTL3_REG_DIAG6_INV_Msk   (0x8000000UL)             /*!< BLE BLE_DIAGCNTL3_REG: DIAG6_INV (Bitfield-Mask: 0x01)      */
#define BLE_BLE_DIAGCNTL3_REG_DIAG7_BIT_Pos   (28UL)                    /*!< BLE BLE_DIAGCNTL3_REG: DIAG7_BIT (Bit 28)                   */
#define BLE_BLE_DIAGCNTL3_REG_DIAG7_BIT_Msk   (0x70000000UL)            /*!< BLE BLE_DIAGCNTL3_REG: DIAG7_BIT (Bitfield-Mask: 0x07)      */
#define BLE_BLE_DIAGCNTL3_REG_DIAG7_INV_Pos   (31UL)                    /*!< BLE BLE_DIAGCNTL3_REG: DIAG7_INV (Bit 31)                   */
#define BLE_BLE_DIAGCNTL3_REG_DIAG7_INV_Msk   (0x80000000UL)            /*!< BLE BLE_DIAGCNTL3_REG: DIAG7_INV (Bitfield-Mask: 0x01)      */


/* ================================================================================ */
/* ================         struct 'CACHE' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------  CACHE_CACHE_CTRL1_REG  --------------------------- */
#define CACHE_CACHE_CTRL1_REG_CACHE_FLUSH_Pos (0UL)                     /*!< CACHE CACHE_CTRL1_REG: CACHE_FLUSH (Bit 0)                  */
#define CACHE_CACHE_CTRL1_REG_CACHE_FLUSH_Msk (0x1UL)                   /*!< CACHE CACHE_CTRL1_REG: CACHE_FLUSH (Bitfield-Mask: 0x01)    */
#define CACHE_CACHE_CTRL1_REG_CACHE_RES1_Pos  (1UL)                     /*!< CACHE CACHE_CTRL1_REG: CACHE_RES1 (Bit 1)                   */
#define CACHE_CACHE_CTRL1_REG_CACHE_RES1_Msk  (0x2UL)                   /*!< CACHE CACHE_CTRL1_REG: CACHE_RES1 (Bitfield-Mask: 0x01)     */

/* --------------------------  CACHE_CACHE_LNSIZECFG_REG  ------------------------- */
#define CACHE_CACHE_LNSIZECFG_REG_CACHE_LINE_Pos (0UL)                  /*!< CACHE CACHE_LNSIZECFG_REG: CACHE_LINE (Bit 0)               */
#define CACHE_CACHE_LNSIZECFG_REG_CACHE_LINE_Msk (0x3UL)                /*!< CACHE CACHE_LNSIZECFG_REG: CACHE_LINE (Bitfield-Mask: 0x03) */

/* --------------------------  CACHE_CACHE_ASSOCCFG_REG  -------------------------- */
#define CACHE_CACHE_ASSOCCFG_REG_CACHE_ASSOC_Pos (0UL)                  /*!< CACHE CACHE_ASSOCCFG_REG: CACHE_ASSOC (Bit 0)               */
#define CACHE_CACHE_ASSOCCFG_REG_CACHE_ASSOC_Msk (0x3UL)                /*!< CACHE CACHE_ASSOCCFG_REG: CACHE_ASSOC (Bitfield-Mask: 0x03) */

/* ----------------------------  CACHE_CACHE_CTRL2_REG  --------------------------- */
#define CACHE_CACHE_CTRL2_REG_CACHE_LEN_Pos   (0UL)                     /*!< CACHE CACHE_CTRL2_REG: CACHE_LEN (Bit 0)                    */
#define CACHE_CACHE_CTRL2_REG_CACHE_LEN_Msk   (0x1ffUL)                 /*!< CACHE CACHE_CTRL2_REG: CACHE_LEN (Bitfield-Mask: 0x1ff)     */
#define CACHE_CACHE_CTRL2_REG_CACHE_WEN_Pos   (9UL)                     /*!< CACHE CACHE_CTRL2_REG: CACHE_WEN (Bit 9)                    */
#define CACHE_CACHE_CTRL2_REG_CACHE_WEN_Msk   (0x200UL)                 /*!< CACHE CACHE_CTRL2_REG: CACHE_WEN (Bitfield-Mask: 0x01)      */
#define CACHE_CACHE_CTRL2_REG_CACHE_CGEN_Pos  (10UL)                    /*!< CACHE CACHE_CTRL2_REG: CACHE_CGEN (Bit 10)                  */
#define CACHE_CACHE_CTRL2_REG_CACHE_CGEN_Msk  (0x400UL)                 /*!< CACHE CACHE_CTRL2_REG: CACHE_CGEN (Bitfield-Mask: 0x01)     */
#define CACHE_CACHE_CTRL2_REG_ENABLE_ALSO_OTP_CACHED_Pos (11UL)         /*!< CACHE CACHE_CTRL2_REG: ENABLE_ALSO_OTP_CACHED (Bit 11)      */
#define CACHE_CACHE_CTRL2_REG_ENABLE_ALSO_OTP_CACHED_Msk (0x800UL)      /*!< CACHE CACHE_CTRL2_REG: ENABLE_ALSO_OTP_CACHED (Bitfield-Mask: 0x01) */
#define CACHE_CACHE_CTRL2_REG_ENABLE_ALSO_QSPIFLASH_CACHED_Pos (12UL)   /*!< CACHE CACHE_CTRL2_REG: ENABLE_ALSO_QSPIFLASH_CACHED (Bit 12) */
#define CACHE_CACHE_CTRL2_REG_ENABLE_ALSO_QSPIFLASH_CACHED_Msk (0x1000UL) /*!< CACHE CACHE_CTRL2_REG: ENABLE_ALSO_QSPIFLASH_CACHED (Bitfield-Mask: 0x01) */

/* ----------------------------  CACHE_CACHE_CTRL3_REG  --------------------------- */
#define CACHE_CACHE_CTRL3_REG_CACHE_ASSOCIATIVITY_RESET_VALUE_Pos (0UL) /*!< CACHE CACHE_CTRL3_REG: CACHE_ASSOCIATIVITY_RESET_VALUE (Bit 0) */
#define CACHE_CACHE_CTRL3_REG_CACHE_ASSOCIATIVITY_RESET_VALUE_Msk (0x3UL) /*!< CACHE CACHE_CTRL3_REG: CACHE_ASSOCIATIVITY_RESET_VALUE (Bitfield-Mask: 0x03) */
#define CACHE_CACHE_CTRL3_REG_CACHE_LINE_SIZE_RESET_VALUE_Pos (2UL)     /*!< CACHE CACHE_CTRL3_REG: CACHE_LINE_SIZE_RESET_VALUE (Bit 2)  */
#define CACHE_CACHE_CTRL3_REG_CACHE_LINE_SIZE_RESET_VALUE_Msk (0xcUL)   /*!< CACHE CACHE_CTRL3_REG: CACHE_LINE_SIZE_RESET_VALUE (Bitfield-Mask: 0x03) */
#define CACHE_CACHE_CTRL3_REG_CACHE_RAM_SIZE_RESET_VALUE_Pos (4UL)      /*!< CACHE CACHE_CTRL3_REG: CACHE_RAM_SIZE_RESET_VALUE (Bit 4)   */
#define CACHE_CACHE_CTRL3_REG_CACHE_RAM_SIZE_RESET_VALUE_Msk (0x70UL)   /*!< CACHE CACHE_CTRL3_REG: CACHE_RAM_SIZE_RESET_VALUE (Bitfield-Mask: 0x07) */
#define CACHE_CACHE_CTRL3_REG_CACHE_CONTROLLER_RESET_Pos (7UL)          /*!< CACHE CACHE_CTRL3_REG: CACHE_CONTROLLER_RESET (Bit 7)       */
#define CACHE_CACHE_CTRL3_REG_CACHE_CONTROLLER_RESET_Msk (0x80UL)       /*!< CACHE CACHE_CTRL3_REG: CACHE_CONTROLLER_RESET (Bitfield-Mask: 0x01) */

/* --------------------------  CACHE_CACHE_MRM_HITS_REG  -------------------------- */
#define CACHE_CACHE_MRM_HITS_REG_MRM_HITS_Pos (0UL)                     /*!< CACHE CACHE_MRM_HITS_REG: MRM_HITS (Bit 0)                  */
#define CACHE_CACHE_MRM_HITS_REG_MRM_HITS_Msk (0x7ffffUL)               /*!< CACHE CACHE_MRM_HITS_REG: MRM_HITS (Bitfield-Mask: 0x7ffff) */

