wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AA.h
/* -----------------------------  COEX_COEX_DIAG_REG  ----------------------------- */
#define COEX_COEX_DIAG_REG_COEX_DIAG_MON_Pos  (0UL)                     /*!< COEX COEX_DIAG_REG: COEX_DIAG_MON (Bit 0)                   */
#define COEX_COEX_DIAG_REG_COEX_DIAG_MON_Msk  (0xffffUL)                /*!< COEX COEX_DIAG_REG: COEX_DIAG_MON (Bitfield-Mask: 0xffff)   */

/* -----------------------------  COEX_COEX_PRI1_REG  ----------------------------- */
#define COEX_COEX_PRI1_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI1_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI1_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI1_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI1_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI1_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI1_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI1_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI2_REG  ----------------------------- */
#define COEX_COEX_PRI2_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI2_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI2_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI2_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI2_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI2_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI2_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI2_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI3_REG  ----------------------------- */
#define COEX_COEX_PRI3_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI3_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI3_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI3_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI3_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI3_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI3_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI3_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI4_REG  ----------------------------- */
#define COEX_COEX_PRI4_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI4_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI4_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI4_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI4_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI4_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI4_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI4_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI5_REG  ----------------------------- */
#define COEX_COEX_PRI5_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI5_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI5_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI5_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI5_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI5_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI5_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI5_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI6_REG  ----------------------------- */
#define COEX_COEX_PRI6_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI6_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI6_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI6_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI6_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI6_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI6_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI6_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI7_REG  ----------------------------- */
#define COEX_COEX_PRI7_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI7_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI7_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI7_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI7_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI7_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI7_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI7_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI8_REG  ----------------------------- */
#define COEX_COEX_PRI8_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI8_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI8_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI8_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI8_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI8_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI8_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI8_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI9_REG  ----------------------------- */
#define COEX_COEX_PRI9_REG_COEX_PRI_PTI_Pos   (0UL)                     /*!< COEX COEX_PRI9_REG: COEX_PRI_PTI (Bit 0)                    */
#define COEX_COEX_PRI9_REG_COEX_PRI_PTI_Msk   (0x7UL)                   /*!< COEX COEX_PRI9_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)      */
#define COEX_COEX_PRI9_REG_COEX_PRI_MAC_Pos   (3UL)                     /*!< COEX COEX_PRI9_REG: COEX_PRI_MAC (Bit 3)                    */
#define COEX_COEX_PRI9_REG_COEX_PRI_MAC_Msk   (0x18UL)                  /*!< COEX COEX_PRI9_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)      */

/* -----------------------------  COEX_COEX_PRI10_REG  ---------------------------- */
#define COEX_COEX_PRI10_REG_COEX_PRI_PTI_Pos  (0UL)                     /*!< COEX COEX_PRI10_REG: COEX_PRI_PTI (Bit 0)                   */
#define COEX_COEX_PRI10_REG_COEX_PRI_PTI_Msk  (0x7UL)                   /*!< COEX COEX_PRI10_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)     */
#define COEX_COEX_PRI10_REG_COEX_PRI_MAC_Pos  (3UL)                     /*!< COEX COEX_PRI10_REG: COEX_PRI_MAC (Bit 3)                   */
#define COEX_COEX_PRI10_REG_COEX_PRI_MAC_Msk  (0x18UL)                  /*!< COEX COEX_PRI10_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)     */

/* -----------------------------  COEX_COEX_PRI11_REG  ---------------------------- */
#define COEX_COEX_PRI11_REG_COEX_PRI_PTI_Pos  (0UL)                     /*!< COEX COEX_PRI11_REG: COEX_PRI_PTI (Bit 0)                   */
#define COEX_COEX_PRI11_REG_COEX_PRI_PTI_Msk  (0x7UL)                   /*!< COEX COEX_PRI11_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)     */
#define COEX_COEX_PRI11_REG_COEX_PRI_MAC_Pos  (3UL)                     /*!< COEX COEX_PRI11_REG: COEX_PRI_MAC (Bit 3)                   */
#define COEX_COEX_PRI11_REG_COEX_PRI_MAC_Msk  (0x18UL)                  /*!< COEX COEX_PRI11_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)     */

