wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AA.h
/* -----------------------------  COEX_COEX_PRI12_REG  ---------------------------- */
#define COEX_COEX_PRI12_REG_COEX_PRI_PTI_Pos  (0UL)                     /*!< COEX COEX_PRI12_REG: COEX_PRI_PTI (Bit 0)                   */
#define COEX_COEX_PRI12_REG_COEX_PRI_PTI_Msk  (0x7UL)                   /*!< COEX COEX_PRI12_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)     */
#define COEX_COEX_PRI12_REG_COEX_PRI_MAC_Pos  (3UL)                     /*!< COEX COEX_PRI12_REG: COEX_PRI_MAC (Bit 3)                   */
#define COEX_COEX_PRI12_REG_COEX_PRI_MAC_Msk  (0x18UL)                  /*!< COEX COEX_PRI12_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)     */

/* -----------------------------  COEX_COEX_PRI13_REG  ---------------------------- */
#define COEX_COEX_PRI13_REG_COEX_PRI_PTI_Pos  (0UL)                     /*!< COEX COEX_PRI13_REG: COEX_PRI_PTI (Bit 0)                   */
#define COEX_COEX_PRI13_REG_COEX_PRI_PTI_Msk  (0x7UL)                   /*!< COEX COEX_PRI13_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)     */
#define COEX_COEX_PRI13_REG_COEX_PRI_MAC_Pos  (3UL)                     /*!< COEX COEX_PRI13_REG: COEX_PRI_MAC (Bit 3)                   */
#define COEX_COEX_PRI13_REG_COEX_PRI_MAC_Msk  (0x18UL)                  /*!< COEX COEX_PRI13_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)     */

/* -----------------------------  COEX_COEX_PRI14_REG  ---------------------------- */
#define COEX_COEX_PRI14_REG_COEX_PRI_PTI_Pos  (0UL)                     /*!< COEX COEX_PRI14_REG: COEX_PRI_PTI (Bit 0)                   */
#define COEX_COEX_PRI14_REG_COEX_PRI_PTI_Msk  (0x7UL)                   /*!< COEX COEX_PRI14_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)     */
#define COEX_COEX_PRI14_REG_COEX_PRI_MAC_Pos  (3UL)                     /*!< COEX COEX_PRI14_REG: COEX_PRI_MAC (Bit 3)                   */
#define COEX_COEX_PRI14_REG_COEX_PRI_MAC_Msk  (0x18UL)                  /*!< COEX COEX_PRI14_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)     */

/* -----------------------------  COEX_COEX_PRI15_REG  ---------------------------- */
#define COEX_COEX_PRI15_REG_COEX_PRI_PTI_Pos  (0UL)                     /*!< COEX COEX_PRI15_REG: COEX_PRI_PTI (Bit 0)                   */
#define COEX_COEX_PRI15_REG_COEX_PRI_PTI_Msk  (0x7UL)                   /*!< COEX COEX_PRI15_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)     */
#define COEX_COEX_PRI15_REG_COEX_PRI_MAC_Pos  (3UL)                     /*!< COEX COEX_PRI15_REG: COEX_PRI_MAC (Bit 3)                   */
#define COEX_COEX_PRI15_REG_COEX_PRI_MAC_Msk  (0x18UL)                  /*!< COEX COEX_PRI15_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)     */

/* -----------------------------  COEX_COEX_PRI16_REG  ---------------------------- */
#define COEX_COEX_PRI16_REG_COEX_PRI_PTI_Pos  (0UL)                     /*!< COEX COEX_PRI16_REG: COEX_PRI_PTI (Bit 0)                   */
#define COEX_COEX_PRI16_REG_COEX_PRI_PTI_Msk  (0x7UL)                   /*!< COEX COEX_PRI16_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)     */
#define COEX_COEX_PRI16_REG_COEX_PRI_MAC_Pos  (3UL)                     /*!< COEX COEX_PRI16_REG: COEX_PRI_MAC (Bit 3)                   */
#define COEX_COEX_PRI16_REG_COEX_PRI_MAC_Msk  (0x18UL)                  /*!< COEX COEX_PRI16_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)     */

/* -----------------------------  COEX_COEX_PRI17_REG  ---------------------------- */
#define COEX_COEX_PRI17_REG_COEX_PRI_PTI_Pos  (0UL)                     /*!< COEX COEX_PRI17_REG: COEX_PRI_PTI (Bit 0)                   */
#define COEX_COEX_PRI17_REG_COEX_PRI_PTI_Msk  (0x7UL)                   /*!< COEX COEX_PRI17_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07)     */
#define COEX_COEX_PRI17_REG_COEX_PRI_MAC_Pos  (3UL)                     /*!< COEX COEX_PRI17_REG: COEX_PRI_MAC (Bit 3)                   */
#define COEX_COEX_PRI17_REG_COEX_PRI_MAC_Msk  (0x18UL)                  /*!< COEX COEX_PRI17_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03)     */


/* ================================================================================ */
/* ================        struct 'CRG_PER' Position & Mask        ================ */
/* ================================================================================ */


/* -----------------------------  CRG_PER_CLK_PER_REG  ---------------------------- */
#define CRG_PER_CLK_PER_REG_UART_ENABLE_Pos   (0UL)                     /*!< CRG_PER CLK_PER_REG: UART_ENABLE (Bit 0)                    */
#define CRG_PER_CLK_PER_REG_UART_ENABLE_Msk   (0x1UL)                   /*!< CRG_PER CLK_PER_REG: UART_ENABLE (Bitfield-Mask: 0x01)      */
#define CRG_PER_CLK_PER_REG_SPI_ENABLE_Pos    (1UL)                     /*!< CRG_PER CLK_PER_REG: SPI_ENABLE (Bit 1)                     */
#define CRG_PER_CLK_PER_REG_SPI_ENABLE_Msk    (0x2UL)                   /*!< CRG_PER CLK_PER_REG: SPI_ENABLE (Bitfield-Mask: 0x01)       */
#define CRG_PER_CLK_PER_REG_I2C_ENABLE_Pos    (2UL)                     /*!< CRG_PER CLK_PER_REG: I2C_ENABLE (Bit 2)                     */
#define CRG_PER_CLK_PER_REG_I2C_ENABLE_Msk    (0x4UL)                   /*!< CRG_PER CLK_PER_REG: I2C_ENABLE (Bitfield-Mask: 0x01)       */
#define CRG_PER_CLK_PER_REG_QUAD_ENABLE_Pos   (3UL)                     /*!< CRG_PER CLK_PER_REG: QUAD_ENABLE (Bit 3)                    */
#define CRG_PER_CLK_PER_REG_QUAD_ENABLE_Msk   (0x8UL)                   /*!< CRG_PER CLK_PER_REG: QUAD_ENABLE (Bitfield-Mask: 0x01)      */
#define CRG_PER_CLK_PER_REG_IR_CLK_ENABLE_Pos (4UL)                     /*!< CRG_PER CLK_PER_REG: IR_CLK_ENABLE (Bit 4)                  */
#define CRG_PER_CLK_PER_REG_IR_CLK_ENABLE_Msk (0x10UL)                  /*!< CRG_PER CLK_PER_REG: IR_CLK_ENABLE (Bitfield-Mask: 0x01)    */
#define CRG_PER_CLK_PER_REG_KBSCAN_ENABLE_Pos (5UL)                     /*!< CRG_PER CLK_PER_REG: KBSCAN_ENABLE (Bit 5)                  */
#define CRG_PER_CLK_PER_REG_KBSCAN_ENABLE_Msk (0x20UL)                  /*!< CRG_PER CLK_PER_REG: KBSCAN_ENABLE (Bitfield-Mask: 0x01)    */
#define CRG_PER_CLK_PER_REG_SPI_CLK_SEL_Pos   (8UL)                     /*!< CRG_PER CLK_PER_REG: SPI_CLK_SEL (Bit 8)                    */
#define CRG_PER_CLK_PER_REG_SPI_CLK_SEL_Msk   (0x100UL)                 /*!< CRG_PER CLK_PER_REG: SPI_CLK_SEL (Bitfield-Mask: 0x01)      */
#define CRG_PER_CLK_PER_REG_I2C_CLK_SEL_Pos   (9UL)                     /*!< CRG_PER CLK_PER_REG: I2C_CLK_SEL (Bit 9)                    */
#define CRG_PER_CLK_PER_REG_I2C_CLK_SEL_Msk   (0x200UL)                 /*!< CRG_PER CLK_PER_REG: I2C_CLK_SEL (Bitfield-Mask: 0x01)      */
#define CRG_PER_CLK_PER_REG_KBSCAN_CLK_SEL_Pos (10UL)                   /*!< CRG_PER CLK_PER_REG: KBSCAN_CLK_SEL (Bit 10)                */
#define CRG_PER_CLK_PER_REG_KBSCAN_CLK_SEL_Msk (0x400UL)                /*!< CRG_PER CLK_PER_REG: KBSCAN_CLK_SEL (Bitfield-Mask: 0x01)   */
#define CRG_PER_CLK_PER_REG_ADC_CLK_SEL_Pos   (11UL)                    /*!< CRG_PER CLK_PER_REG: ADC_CLK_SEL (Bit 11)                   */
#define CRG_PER_CLK_PER_REG_ADC_CLK_SEL_Msk   (0x800UL)                 /*!< CRG_PER CLK_PER_REG: ADC_CLK_SEL (Bitfield-Mask: 0x01)      */

/* -----------------------------  CRG_PER_PCM_DIV_REG  ---------------------------- */
#define CRG_PER_PCM_DIV_REG_PCM_DIV_Pos       (0UL)                     /*!< CRG_PER PCM_DIV_REG: PCM_DIV (Bit 0)                        */
#define CRG_PER_PCM_DIV_REG_PCM_DIV_Msk       (0xfffUL)                 /*!< CRG_PER PCM_DIV_REG: PCM_DIV (Bitfield-Mask: 0xfff)         */
#define CRG_PER_PCM_DIV_REG_CLK_PCM_EN_Pos    (12UL)                    /*!< CRG_PER PCM_DIV_REG: CLK_PCM_EN (Bit 12)                    */
#define CRG_PER_PCM_DIV_REG_CLK_PCM_EN_Msk    (0x1000UL)                /*!< CRG_PER PCM_DIV_REG: CLK_PCM_EN (Bitfield-Mask: 0x01)       */
#define CRG_PER_PCM_DIV_REG_PCM_SRC_SEL_Pos   (13UL)                    /*!< CRG_PER PCM_DIV_REG: PCM_SRC_SEL (Bit 13)                   */
#define CRG_PER_PCM_DIV_REG_PCM_SRC_SEL_Msk   (0x2000UL)                /*!< CRG_PER PCM_DIV_REG: PCM_SRC_SEL (Bitfield-Mask: 0x01)      */

/* ----------------------------  CRG_PER_PCM_FDIV_REG  ---------------------------- */
#define CRG_PER_PCM_FDIV_REG_PCM_FDIV_Pos     (0UL)                     /*!< CRG_PER PCM_FDIV_REG: PCM_FDIV (Bit 0)                      */
#define CRG_PER_PCM_FDIV_REG_PCM_FDIV_Msk     (0xffffUL)                /*!< CRG_PER PCM_FDIV_REG: PCM_FDIV (Bitfield-Mask: 0xffff)      */

/* -----------------------------  CRG_PER_PDM_DIV_REG  ---------------------------- */
#define CRG_PER_PDM_DIV_REG_PDM_DIV_Pos       (0UL)                     /*!< CRG_PER PDM_DIV_REG: PDM_DIV (Bit 0)                        */
#define CRG_PER_PDM_DIV_REG_PDM_DIV_Msk       (0xffUL)                  /*!< CRG_PER PDM_DIV_REG: PDM_DIV (Bitfield-Mask: 0xff)          */
#define CRG_PER_PDM_DIV_REG_CLK_PDM_EN_Pos    (8UL)                     /*!< CRG_PER PDM_DIV_REG: CLK_PDM_EN (Bit 8)                     */
#define CRG_PER_PDM_DIV_REG_CLK_PDM_EN_Msk    (0x100UL)                 /*!< CRG_PER PDM_DIV_REG: CLK_PDM_EN (Bitfield-Mask: 0x01)       */
#define CRG_PER_PDM_DIV_REG_PDM_MASTER_MODE_Pos (9UL)                   /*!< CRG_PER PDM_DIV_REG: PDM_MASTER_MODE (Bit 9)                */
#define CRG_PER_PDM_DIV_REG_PDM_MASTER_MODE_Msk (0x200UL)               /*!< CRG_PER PDM_DIV_REG: PDM_MASTER_MODE (Bitfield-Mask: 0x01)  */

