wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AA.h
/* -----------------------------  ECC_ECC_CONFIG_REG  ----------------------------- */
#define ECC_ECC_CONFIG_REG_ECC_OpPtrA_Pos     (0UL)                     /*!< ECC ECC_CONFIG_REG: ECC_OpPtrA (Bit 0)                      */
#define ECC_ECC_CONFIG_REG_ECC_OpPtrA_Msk     (0x1fUL)                  /*!< ECC ECC_CONFIG_REG: ECC_OpPtrA (Bitfield-Mask: 0x1f)        */
#define ECC_ECC_CONFIG_REG_ECC_OpPtrB_Pos     (8UL)                     /*!< ECC ECC_CONFIG_REG: ECC_OpPtrB (Bit 8)                      */
#define ECC_ECC_CONFIG_REG_ECC_OpPtrB_Msk     (0x1f00UL)                /*!< ECC ECC_CONFIG_REG: ECC_OpPtrB (Bitfield-Mask: 0x1f)        */
#define ECC_ECC_CONFIG_REG_ECC_OpPtrC_Pos     (16UL)                    /*!< ECC ECC_CONFIG_REG: ECC_OpPtrC (Bit 16)                     */
#define ECC_ECC_CONFIG_REG_ECC_OpPtrC_Msk     (0x1f0000UL)              /*!< ECC ECC_CONFIG_REG: ECC_OpPtrC (Bitfield-Mask: 0x1f)        */

/* -----------------------------  ECC_ECC_COMMAND_REG  ---------------------------- */
#define ECC_ECC_COMMAND_REG_ECC_TypeOperation_Pos (0UL)                 /*!< ECC ECC_COMMAND_REG: ECC_TypeOperation (Bit 0)              */
#define ECC_ECC_COMMAND_REG_ECC_TypeOperation_Msk (0x7fUL)              /*!< ECC ECC_COMMAND_REG: ECC_TypeOperation (Bitfield-Mask: 0x7f) */
#define ECC_ECC_COMMAND_REG_ECC_Field_Pos     (7UL)                     /*!< ECC ECC_COMMAND_REG: ECC_Field (Bit 7)                      */
#define ECC_ECC_COMMAND_REG_ECC_Field_Msk     (0x80UL)                  /*!< ECC ECC_COMMAND_REG: ECC_Field (Bitfield-Mask: 0x01)        */
#define ECC_ECC_COMMAND_REG_ECC_SizeOfOperands_Pos (8UL)                /*!< ECC ECC_COMMAND_REG: ECC_SizeOfOperands (Bit 8)             */
#define ECC_ECC_COMMAND_REG_ECC_SizeOfOperands_Msk (0xff00UL)           /*!< ECC ECC_COMMAND_REG: ECC_SizeOfOperands (Bitfield-Mask: 0xff) */
#define ECC_ECC_COMMAND_REG_ECC_SignA_Pos     (29UL)                    /*!< ECC ECC_COMMAND_REG: ECC_SignA (Bit 29)                     */
#define ECC_ECC_COMMAND_REG_ECC_SignA_Msk     (0x20000000UL)            /*!< ECC ECC_COMMAND_REG: ECC_SignA (Bitfield-Mask: 0x01)        */
#define ECC_ECC_COMMAND_REG_ECC_SignB_Pos     (30UL)                    /*!< ECC ECC_COMMAND_REG: ECC_SignB (Bit 30)                     */
#define ECC_ECC_COMMAND_REG_ECC_SignB_Msk     (0x40000000UL)            /*!< ECC ECC_COMMAND_REG: ECC_SignB (Bitfield-Mask: 0x01)        */
#define ECC_ECC_COMMAND_REG_ECC_CalcR2_Pos    (31UL)                    /*!< ECC ECC_COMMAND_REG: ECC_CalcR2 (Bit 31)                    */
#define ECC_ECC_COMMAND_REG_ECC_CalcR2_Msk    (0x80000000UL)            /*!< ECC ECC_COMMAND_REG: ECC_CalcR2 (Bitfield-Mask: 0x01)       */

/* -----------------------------  ECC_ECC_CONTROL_REG  ---------------------------- */
#define ECC_ECC_CONTROL_REG_ECC_Start_Pos     (0UL)                     /*!< ECC ECC_CONTROL_REG: ECC_Start (Bit 0)                      */
#define ECC_ECC_CONTROL_REG_ECC_Start_Msk     (0x1UL)                   /*!< ECC ECC_CONTROL_REG: ECC_Start (Bitfield-Mask: 0x01)        */

/* -----------------------------  ECC_ECC_STATUS_REG  ----------------------------- */
#define ECC_ECC_STATUS_REG_ECC_Fail_Address_Pos (0UL)                   /*!< ECC ECC_STATUS_REG: ECC_Fail_Address (Bit 0)                */
#define ECC_ECC_STATUS_REG_ECC_Fail_Address_Msk (0xfUL)                 /*!< ECC ECC_STATUS_REG: ECC_Fail_Address (Bitfield-Mask: 0x0f)  */
#define ECC_ECC_STATUS_REG_ECC_Point_Px_NotOnCurve_Pos (4UL)            /*!< ECC ECC_STATUS_REG: ECC_Point_Px_NotOnCurve (Bit 4)         */
#define ECC_ECC_STATUS_REG_ECC_Point_Px_NotOnCurve_Msk (0x10UL)         /*!< ECC ECC_STATUS_REG: ECC_Point_Px_NotOnCurve (Bitfield-Mask: 0x01) */
#define ECC_ECC_STATUS_REG_ECC_Point_Px_AtInfinity_Pos (5UL)            /*!< ECC ECC_STATUS_REG: ECC_Point_Px_AtInfinity (Bit 5)         */
#define ECC_ECC_STATUS_REG_ECC_Point_Px_AtInfinity_Msk (0x20UL)         /*!< ECC ECC_STATUS_REG: ECC_Point_Px_AtInfinity (Bitfield-Mask: 0x01) */
#define ECC_ECC_STATUS_REG_ECC_Couple_NotValid_Pos (6UL)                /*!< ECC ECC_STATUS_REG: ECC_Couple_NotValid (Bit 6)             */
#define ECC_ECC_STATUS_REG_ECC_Couple_NotValid_Msk (0x40UL)             /*!< ECC ECC_STATUS_REG: ECC_Couple_NotValid (Bitfield-Mask: 0x01) */
#define ECC_ECC_STATUS_REG_ECC_Param_n_NotValid_Pos (7UL)               /*!< ECC ECC_STATUS_REG: ECC_Param_n_NotValid (Bit 7)            */
#define ECC_ECC_STATUS_REG_ECC_Param_n_NotValid_Msk (0x80UL)            /*!< ECC ECC_STATUS_REG: ECC_Param_n_NotValid (Bitfield-Mask: 0x01) */
#define ECC_ECC_STATUS_REG_ECC_Signature_NotValid_Pos (9UL)             /*!< ECC ECC_STATUS_REG: ECC_Signature_NotValid (Bit 9)          */
#define ECC_ECC_STATUS_REG_ECC_Signature_NotValid_Msk (0x200UL)         /*!< ECC ECC_STATUS_REG: ECC_Signature_NotValid (Bitfield-Mask: 0x01) */
#define ECC_ECC_STATUS_REG_ECC_Param_AB_NotValid_Pos (10UL)             /*!< ECC ECC_STATUS_REG: ECC_Param_AB_NotValid (Bit 10)          */
#define ECC_ECC_STATUS_REG_ECC_Param_AB_NotValid_Msk (0x400UL)          /*!< ECC ECC_STATUS_REG: ECC_Param_AB_NotValid (Bitfield-Mask: 0x01) */
#define ECC_ECC_STATUS_REG_ECC_NotInvertible_Pos (11UL)                 /*!< ECC ECC_STATUS_REG: ECC_NotInvertible (Bit 11)              */
#define ECC_ECC_STATUS_REG_ECC_NotInvertible_Msk (0x800UL)              /*!< ECC ECC_STATUS_REG: ECC_NotInvertible (Bitfield-Mask: 0x01) */
#define ECC_ECC_STATUS_REG_ECC_PrimalityTestResult_Pos (12UL)           /*!< ECC ECC_STATUS_REG: ECC_PrimalityTestResult (Bit 12)        */
#define ECC_ECC_STATUS_REG_ECC_PrimalityTestResult_Msk (0x1000UL)       /*!< ECC ECC_STATUS_REG: ECC_PrimalityTestResult (Bitfield-Mask: 0x01) */
#define ECC_ECC_STATUS_REG_ECC_Busy_Pos       (16UL)                    /*!< ECC ECC_STATUS_REG: ECC_Busy (Bit 16)                       */
#define ECC_ECC_STATUS_REG_ECC_Busy_Msk       (0x10000UL)               /*!< ECC ECC_STATUS_REG: ECC_Busy (Bitfield-Mask: 0x01)          */

/* -----------------------------  ECC_ECC_VERSION_REG  ---------------------------- */
#define ECC_ECC_VERSION_REG_ECC_SVN_Pos       (0UL)                     /*!< ECC ECC_VERSION_REG: ECC_SVN (Bit 0)                        */
#define ECC_ECC_VERSION_REG_ECC_SVN_Msk       (0xffUL)                  /*!< ECC ECC_VERSION_REG: ECC_SVN (Bitfield-Mask: 0xff)          */
#define ECC_ECC_VERSION_REG_ECC_HVN_Pos       (8UL)                     /*!< ECC ECC_VERSION_REG: ECC_HVN (Bit 8)                        */
#define ECC_ECC_VERSION_REG_ECC_HVN_Msk       (0xff00UL)                /*!< ECC ECC_VERSION_REG: ECC_HVN (Bitfield-Mask: 0xff)          */

/* --------------------------  ECC_ECC_LOADMICROCODE_REG  ------------------------- */
#define ECC_ECC_LOADMICROCODE_REG_ECC_uCode_Pos (0UL)                   /*!< ECC ECC_LOADMICROCODE_REG: ECC_uCode (Bit 0)                */
#define ECC_ECC_LOADMICROCODE_REG_ECC_uCode_Msk (0x3ffffUL)             /*!< ECC ECC_LOADMICROCODE_REG: ECC_uCode (Bitfield-Mask: 0x3ffff) */
#define ECC_ECC_LOADMICROCODE_REG_ECC_FirstWord_Pos (18UL)              /*!< ECC ECC_LOADMICROCODE_REG: ECC_FirstWord (Bit 18)           */
#define ECC_ECC_LOADMICROCODE_REG_ECC_FirstWord_Msk (0x40000UL)         /*!< ECC ECC_LOADMICROCODE_REG: ECC_FirstWord (Bitfield-Mask: 0x01) */


/* ================================================================================ */
/* ================          struct 'FTDF' Position & Mask         ================ */
/* ================================================================================ */


