wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AA.h
/* --------------------------  FTDF_FTDF_RX_META_1_5_REG  ------------------------- */
#define FTDF_FTDF_RX_META_1_5_REG_CRC16_ERROR_Pos (0UL)                 /*!< FTDF FTDF_RX_META_1_5_REG: CRC16_ERROR (Bit 0)              */
#define FTDF_FTDF_RX_META_1_5_REG_CRC16_ERROR_Msk (0x1UL)               /*!< FTDF FTDF_RX_META_1_5_REG: CRC16_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_5_REG_RES_FRM_TYPE_ERROR_Pos (2UL)          /*!< FTDF FTDF_RX_META_1_5_REG: RES_FRM_TYPE_ERROR (Bit 2)       */
#define FTDF_FTDF_RX_META_1_5_REG_RES_FRM_TYPE_ERROR_Msk (0x4UL)        /*!< FTDF FTDF_RX_META_1_5_REG: RES_FRM_TYPE_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_5_REG_RES_FRM_VERSION_ERROR_Pos (3UL)       /*!< FTDF FTDF_RX_META_1_5_REG: RES_FRM_VERSION_ERROR (Bit 3)    */
#define FTDF_FTDF_RX_META_1_5_REG_RES_FRM_VERSION_ERROR_Msk (0x8UL)     /*!< FTDF FTDF_RX_META_1_5_REG: RES_FRM_VERSION_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_5_REG_DPANID_ERROR_Pos (4UL)                /*!< FTDF FTDF_RX_META_1_5_REG: DPANID_ERROR (Bit 4)             */
#define FTDF_FTDF_RX_META_1_5_REG_DPANID_ERROR_Msk (0x10UL)             /*!< FTDF FTDF_RX_META_1_5_REG: DPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_5_REG_DADDR_ERROR_Pos (5UL)                 /*!< FTDF FTDF_RX_META_1_5_REG: DADDR_ERROR (Bit 5)              */
#define FTDF_FTDF_RX_META_1_5_REG_DADDR_ERROR_Msk (0x20UL)              /*!< FTDF FTDF_RX_META_1_5_REG: DADDR_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_5_REG_SPANID_ERROR_Pos (6UL)                /*!< FTDF FTDF_RX_META_1_5_REG: SPANID_ERROR (Bit 6)             */
#define FTDF_FTDF_RX_META_1_5_REG_SPANID_ERROR_Msk (0x40UL)             /*!< FTDF FTDF_RX_META_1_5_REG: SPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_5_REG_ISPANID_COORD_ERROR_Pos (7UL)         /*!< FTDF FTDF_RX_META_1_5_REG: ISPANID_COORD_ERROR (Bit 7)      */
#define FTDF_FTDF_RX_META_1_5_REG_ISPANID_COORD_ERROR_Msk (0x80UL)      /*!< FTDF FTDF_RX_META_1_5_REG: ISPANID_COORD_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_5_REG_QUALITY_INDICATOR_Pos (8UL)           /*!< FTDF FTDF_RX_META_1_5_REG: QUALITY_INDICATOR (Bit 8)        */
#define FTDF_FTDF_RX_META_1_5_REG_QUALITY_INDICATOR_Msk (0xff00UL)      /*!< FTDF FTDF_RX_META_1_5_REG: QUALITY_INDICATOR (Bitfield-Mask: 0xff) */

/* --------------------------  FTDF_FTDF_RX_META_0_6_REG  ------------------------- */
#define FTDF_FTDF_RX_META_0_6_REG_RX_TIMESTAMP_Pos (0UL)                /*!< FTDF FTDF_RX_META_0_6_REG: RX_TIMESTAMP (Bit 0)             */
#define FTDF_FTDF_RX_META_0_6_REG_RX_TIMESTAMP_Msk (0xffffffffUL)       /*!< FTDF FTDF_RX_META_0_6_REG: RX_TIMESTAMP (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_RX_META_1_6_REG  ------------------------- */
#define FTDF_FTDF_RX_META_1_6_REG_CRC16_ERROR_Pos (0UL)                 /*!< FTDF FTDF_RX_META_1_6_REG: CRC16_ERROR (Bit 0)              */
#define FTDF_FTDF_RX_META_1_6_REG_CRC16_ERROR_Msk (0x1UL)               /*!< FTDF FTDF_RX_META_1_6_REG: CRC16_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_6_REG_RES_FRM_TYPE_ERROR_Pos (2UL)          /*!< FTDF FTDF_RX_META_1_6_REG: RES_FRM_TYPE_ERROR (Bit 2)       */
#define FTDF_FTDF_RX_META_1_6_REG_RES_FRM_TYPE_ERROR_Msk (0x4UL)        /*!< FTDF FTDF_RX_META_1_6_REG: RES_FRM_TYPE_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_6_REG_RES_FRM_VERSION_ERROR_Pos (3UL)       /*!< FTDF FTDF_RX_META_1_6_REG: RES_FRM_VERSION_ERROR (Bit 3)    */
#define FTDF_FTDF_RX_META_1_6_REG_RES_FRM_VERSION_ERROR_Msk (0x8UL)     /*!< FTDF FTDF_RX_META_1_6_REG: RES_FRM_VERSION_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_6_REG_DPANID_ERROR_Pos (4UL)                /*!< FTDF FTDF_RX_META_1_6_REG: DPANID_ERROR (Bit 4)             */
#define FTDF_FTDF_RX_META_1_6_REG_DPANID_ERROR_Msk (0x10UL)             /*!< FTDF FTDF_RX_META_1_6_REG: DPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_6_REG_DADDR_ERROR_Pos (5UL)                 /*!< FTDF FTDF_RX_META_1_6_REG: DADDR_ERROR (Bit 5)              */
#define FTDF_FTDF_RX_META_1_6_REG_DADDR_ERROR_Msk (0x20UL)              /*!< FTDF FTDF_RX_META_1_6_REG: DADDR_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_6_REG_SPANID_ERROR_Pos (6UL)                /*!< FTDF FTDF_RX_META_1_6_REG: SPANID_ERROR (Bit 6)             */
#define FTDF_FTDF_RX_META_1_6_REG_SPANID_ERROR_Msk (0x40UL)             /*!< FTDF FTDF_RX_META_1_6_REG: SPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_6_REG_ISPANID_COORD_ERROR_Pos (7UL)         /*!< FTDF FTDF_RX_META_1_6_REG: ISPANID_COORD_ERROR (Bit 7)      */
#define FTDF_FTDF_RX_META_1_6_REG_ISPANID_COORD_ERROR_Msk (0x80UL)      /*!< FTDF FTDF_RX_META_1_6_REG: ISPANID_COORD_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_6_REG_QUALITY_INDICATOR_Pos (8UL)           /*!< FTDF FTDF_RX_META_1_6_REG: QUALITY_INDICATOR (Bit 8)        */
#define FTDF_FTDF_RX_META_1_6_REG_QUALITY_INDICATOR_Msk (0xff00UL)      /*!< FTDF FTDF_RX_META_1_6_REG: QUALITY_INDICATOR (Bitfield-Mask: 0xff) */

/* --------------------------  FTDF_FTDF_RX_META_0_7_REG  ------------------------- */
#define FTDF_FTDF_RX_META_0_7_REG_RX_TIMESTAMP_Pos (0UL)                /*!< FTDF FTDF_RX_META_0_7_REG: RX_TIMESTAMP (Bit 0)             */
#define FTDF_FTDF_RX_META_0_7_REG_RX_TIMESTAMP_Msk (0xffffffffUL)       /*!< FTDF FTDF_RX_META_0_7_REG: RX_TIMESTAMP (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_RX_META_1_7_REG  ------------------------- */
#define FTDF_FTDF_RX_META_1_7_REG_CRC16_ERROR_Pos (0UL)                 /*!< FTDF FTDF_RX_META_1_7_REG: CRC16_ERROR (Bit 0)              */
#define FTDF_FTDF_RX_META_1_7_REG_CRC16_ERROR_Msk (0x1UL)               /*!< FTDF FTDF_RX_META_1_7_REG: CRC16_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_7_REG_RES_FRM_TYPE_ERROR_Pos (2UL)          /*!< FTDF FTDF_RX_META_1_7_REG: RES_FRM_TYPE_ERROR (Bit 2)       */
#define FTDF_FTDF_RX_META_1_7_REG_RES_FRM_TYPE_ERROR_Msk (0x4UL)        /*!< FTDF FTDF_RX_META_1_7_REG: RES_FRM_TYPE_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_7_REG_RES_FRM_VERSION_ERROR_Pos (3UL)       /*!< FTDF FTDF_RX_META_1_7_REG: RES_FRM_VERSION_ERROR (Bit 3)    */
#define FTDF_FTDF_RX_META_1_7_REG_RES_FRM_VERSION_ERROR_Msk (0x8UL)     /*!< FTDF FTDF_RX_META_1_7_REG: RES_FRM_VERSION_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_7_REG_DPANID_ERROR_Pos (4UL)                /*!< FTDF FTDF_RX_META_1_7_REG: DPANID_ERROR (Bit 4)             */
#define FTDF_FTDF_RX_META_1_7_REG_DPANID_ERROR_Msk (0x10UL)             /*!< FTDF FTDF_RX_META_1_7_REG: DPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_7_REG_DADDR_ERROR_Pos (5UL)                 /*!< FTDF FTDF_RX_META_1_7_REG: DADDR_ERROR (Bit 5)              */
#define FTDF_FTDF_RX_META_1_7_REG_DADDR_ERROR_Msk (0x20UL)              /*!< FTDF FTDF_RX_META_1_7_REG: DADDR_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_7_REG_SPANID_ERROR_Pos (6UL)                /*!< FTDF FTDF_RX_META_1_7_REG: SPANID_ERROR (Bit 6)             */
#define FTDF_FTDF_RX_META_1_7_REG_SPANID_ERROR_Msk (0x40UL)             /*!< FTDF FTDF_RX_META_1_7_REG: SPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_7_REG_ISPANID_COORD_ERROR_Pos (7UL)         /*!< FTDF FTDF_RX_META_1_7_REG: ISPANID_COORD_ERROR (Bit 7)      */
#define FTDF_FTDF_RX_META_1_7_REG_ISPANID_COORD_ERROR_Msk (0x80UL)      /*!< FTDF FTDF_RX_META_1_7_REG: ISPANID_COORD_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_7_REG_QUALITY_INDICATOR_Pos (8UL)           /*!< FTDF FTDF_RX_META_1_7_REG: QUALITY_INDICATOR (Bit 8)        */
#define FTDF_FTDF_RX_META_1_7_REG_QUALITY_INDICATOR_Msk (0xff00UL)      /*!< FTDF FTDF_RX_META_1_7_REG: QUALITY_INDICATOR (Bitfield-Mask: 0xff) */

/* --------------------------  FTDF_FTDF_RX_FIFO_0_0_REG  ------------------------- */
#define FTDF_FTDF_RX_FIFO_0_0_REG_RX_FIFO_Pos (0UL)                     /*!< FTDF FTDF_RX_FIFO_0_0_REG: RX_FIFO (Bit 0)                  */
#define FTDF_FTDF_RX_FIFO_0_0_REG_RX_FIFO_Msk (0xffffffffUL)            /*!< FTDF FTDF_RX_FIFO_0_0_REG: RX_FIFO (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_RX_FIFO_1_0_REG  ------------------------- */
#define FTDF_FTDF_RX_FIFO_1_0_REG_RX_FIFO_Pos (0UL)                     /*!< FTDF FTDF_RX_FIFO_1_0_REG: RX_FIFO (Bit 0)                  */
#define FTDF_FTDF_RX_FIFO_1_0_REG_RX_FIFO_Msk (0xffffffffUL)            /*!< FTDF FTDF_RX_FIFO_1_0_REG: RX_FIFO (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_RX_FIFO_2_0_REG  ------------------------- */
#define FTDF_FTDF_RX_FIFO_2_0_REG_RX_FIFO_Pos (0UL)                     /*!< FTDF FTDF_RX_FIFO_2_0_REG: RX_FIFO (Bit 0)                  */
#define FTDF_FTDF_RX_FIFO_2_0_REG_RX_FIFO_Msk (0xffffffffUL)            /*!< FTDF FTDF_RX_FIFO_2_0_REG: RX_FIFO (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_RX_FIFO_3_0_REG  ------------------------- */
#define FTDF_FTDF_RX_FIFO_3_0_REG_RX_FIFO_Pos (0UL)                     /*!< FTDF FTDF_RX_FIFO_3_0_REG: RX_FIFO (Bit 0)                  */
#define FTDF_FTDF_RX_FIFO_3_0_REG_RX_FIFO_Msk (0xffffffffUL)            /*!< FTDF FTDF_RX_FIFO_3_0_REG: RX_FIFO (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_RX_FIFO_4_0_REG  ------------------------- */
#define FTDF_FTDF_RX_FIFO_4_0_REG_RX_FIFO_Pos (0UL)                     /*!< FTDF FTDF_RX_FIFO_4_0_REG: RX_FIFO (Bit 0)                  */
#define FTDF_FTDF_RX_FIFO_4_0_REG_RX_FIFO_Msk (0xffffffffUL)            /*!< FTDF FTDF_RX_FIFO_4_0_REG: RX_FIFO (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_RX_FIFO_5_0_REG  ------------------------- */
#define FTDF_FTDF_RX_FIFO_5_0_REG_RX_FIFO_Pos (0UL)                     /*!< FTDF FTDF_RX_FIFO_5_0_REG: RX_FIFO (Bit 0)                  */
#define FTDF_FTDF_RX_FIFO_5_0_REG_RX_FIFO_Msk (0xffffffffUL)            /*!< FTDF FTDF_RX_FIFO_5_0_REG: RX_FIFO (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_RX_FIFO_6_0_REG  ------------------------- */
#define FTDF_FTDF_RX_FIFO_6_0_REG_RX_FIFO_Pos (0UL)                     /*!< FTDF FTDF_RX_FIFO_6_0_REG: RX_FIFO (Bit 0)                  */
#define FTDF_FTDF_RX_FIFO_6_0_REG_RX_FIFO_Msk (0xffffffffUL)            /*!< FTDF FTDF_RX_FIFO_6_0_REG: RX_FIFO (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_RX_FIFO_7_0_REG  ------------------------- */
#define FTDF_FTDF_RX_FIFO_7_0_REG_RX_FIFO_Pos (0UL)                     /*!< FTDF FTDF_RX_FIFO_7_0_REG: RX_FIFO (Bit 0)                  */
#define FTDF_FTDF_RX_FIFO_7_0_REG_RX_FIFO_Msk (0xffffffffUL)            /*!< FTDF FTDF_RX_FIFO_7_0_REG: RX_FIFO (Bitfield-Mask: 0xffffffff) */

