wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AA.h
/* ------------------------  FTDF_FTDF_LMAC_CONTROL_8_REG  ------------------------ */
#define FTDF_FTDF_LMAC_CONTROL_8_REG_MACCSLSTARTSAMPLETIME_Pos (0UL)    /*!< FTDF FTDF_LMAC_CONTROL_8_REG: MACCSLSTARTSAMPLETIME (Bit 0) */
#define FTDF_FTDF_LMAC_CONTROL_8_REG_MACCSLSTARTSAMPLETIME_Msk (0xffffffffUL) /*!< FTDF FTDF_LMAC_CONTROL_8_REG: MACCSLSTARTSAMPLETIME (Bitfield-Mask: 0xffffffff) */

/* ------------------------  FTDF_FTDF_LMAC_CONTROL_9_REG  ------------------------ */
#define FTDF_FTDF_LMAC_CONTROL_9_REG_MACCSLDATAPERIOD_Pos (0UL)         /*!< FTDF FTDF_LMAC_CONTROL_9_REG: MACCSLDATAPERIOD (Bit 0)      */
#define FTDF_FTDF_LMAC_CONTROL_9_REG_MACCSLDATAPERIOD_Msk (0xffffUL)    /*!< FTDF FTDF_LMAC_CONTROL_9_REG: MACCSLDATAPERIOD (Bitfield-Mask: 0xffff) */
#define FTDF_FTDF_LMAC_CONTROL_9_REG_MACCSLFRAMEPENDINGWAITT_Pos (16UL) /*!< FTDF FTDF_LMAC_CONTROL_9_REG: MACCSLFRAMEPENDINGWAITT (Bit 16) */
#define FTDF_FTDF_LMAC_CONTROL_9_REG_MACCSLFRAMEPENDINGWAITT_Msk (0xffff0000UL) /*!< FTDF FTDF_LMAC_CONTROL_9_REG: MACCSLFRAMEPENDINGWAITT (Bitfield-Mask: 0xffff) */

/* ------------------------  FTDF_FTDF_LMAC_CONTROL_10_REG  ----------------------- */
#define FTDF_FTDF_LMAC_CONTROL_10_REG_MACWURZCORRECTION_Pos (0UL)       /*!< FTDF FTDF_LMAC_CONTROL_10_REG: MACWURZCORRECTION (Bit 0)    */
#define FTDF_FTDF_LMAC_CONTROL_10_REG_MACWURZCORRECTION_Msk (0xffUL)    /*!< FTDF FTDF_LMAC_CONTROL_10_REG: MACWURZCORRECTION (Bitfield-Mask: 0xff) */
#define FTDF_FTDF_LMAC_CONTROL_10_REG_MACCSLMARGINRZ_Pos (16UL)         /*!< FTDF FTDF_LMAC_CONTROL_10_REG: MACCSLMARGINRZ (Bit 16)      */
#define FTDF_FTDF_LMAC_CONTROL_10_REG_MACCSLMARGINRZ_Msk (0xf0000UL)    /*!< FTDF FTDF_LMAC_CONTROL_10_REG: MACCSLMARGINRZ (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_LMAC_CONTROL_10_REG_MACRZZEROVAL_Pos (28UL)           /*!< FTDF FTDF_LMAC_CONTROL_10_REG: MACRZZEROVAL (Bit 28)        */
#define FTDF_FTDF_LMAC_CONTROL_10_REG_MACRZZEROVAL_Msk (0xf0000000UL)   /*!< FTDF FTDF_LMAC_CONTROL_10_REG: MACRZZEROVAL (Bitfield-Mask: 0x0f) */

/* --------------------------  FTDF_FTDF_SECURITY_0_REG  -------------------------- */
#define FTDF_FTDF_SECURITY_0_REG_SECTXRXN_Pos (1UL)                     /*!< FTDF FTDF_SECURITY_0_REG: SECTXRXN (Bit 1)                  */
#define FTDF_FTDF_SECURITY_0_REG_SECTXRXN_Msk (0x2UL)                   /*!< FTDF FTDF_SECURITY_0_REG: SECTXRXN (Bitfield-Mask: 0x01)    */
#define FTDF_FTDF_SECURITY_0_REG_SECENTRY_Pos (8UL)                     /*!< FTDF FTDF_SECURITY_0_REG: SECENTRY (Bit 8)                  */
#define FTDF_FTDF_SECURITY_0_REG_SECENTRY_Msk (0xf00UL)                 /*!< FTDF FTDF_SECURITY_0_REG: SECENTRY (Bitfield-Mask: 0x0f)    */
#define FTDF_FTDF_SECURITY_0_REG_SECALENGTH_Pos (16UL)                  /*!< FTDF FTDF_SECURITY_0_REG: SECALENGTH (Bit 16)               */
#define FTDF_FTDF_SECURITY_0_REG_SECALENGTH_Msk (0x7f0000UL)            /*!< FTDF FTDF_SECURITY_0_REG: SECALENGTH (Bitfield-Mask: 0x7f)  */
#define FTDF_FTDF_SECURITY_0_REG_SECMLENGTH_Pos (24UL)                  /*!< FTDF FTDF_SECURITY_0_REG: SECMLENGTH (Bit 24)               */
#define FTDF_FTDF_SECURITY_0_REG_SECMLENGTH_Msk (0x7f000000UL)          /*!< FTDF FTDF_SECURITY_0_REG: SECMLENGTH (Bitfield-Mask: 0x7f)  */
#define FTDF_FTDF_SECURITY_0_REG_SECENCDECN_Pos (31UL)                  /*!< FTDF FTDF_SECURITY_0_REG: SECENCDECN (Bit 31)               */
#define FTDF_FTDF_SECURITY_0_REG_SECENCDECN_Msk (0x80000000UL)          /*!< FTDF FTDF_SECURITY_0_REG: SECENCDECN (Bitfield-Mask: 0x01)  */

/* --------------------------  FTDF_FTDF_SECURITY_1_REG  -------------------------- */
#define FTDF_FTDF_SECURITY_1_REG_SECAUTHFLAGS_Pos (0UL)                 /*!< FTDF FTDF_SECURITY_1_REG: SECAUTHFLAGS (Bit 0)              */
#define FTDF_FTDF_SECURITY_1_REG_SECAUTHFLAGS_Msk (0xffUL)              /*!< FTDF FTDF_SECURITY_1_REG: SECAUTHFLAGS (Bitfield-Mask: 0xff) */
#define FTDF_FTDF_SECURITY_1_REG_SECENCRFLAGS_Pos (8UL)                 /*!< FTDF FTDF_SECURITY_1_REG: SECENCRFLAGS (Bit 8)              */
#define FTDF_FTDF_SECURITY_1_REG_SECENCRFLAGS_Msk (0xff00UL)            /*!< FTDF FTDF_SECURITY_1_REG: SECENCRFLAGS (Bitfield-Mask: 0xff) */

/* ---------------------------  FTDF_FTDF_SECKEY_0_REG  --------------------------- */
#define FTDF_FTDF_SECKEY_0_REG_SECKEY_0_Pos   (0UL)                     /*!< FTDF FTDF_SECKEY_0_REG: SECKEY_0 (Bit 0)                    */
#define FTDF_FTDF_SECKEY_0_REG_SECKEY_0_Msk   (0xffffffffUL)            /*!< FTDF FTDF_SECKEY_0_REG: SECKEY_0 (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  FTDF_FTDF_SECKEY_1_REG  --------------------------- */
#define FTDF_FTDF_SECKEY_1_REG_SECKEY_1_Pos   (0UL)                     /*!< FTDF FTDF_SECKEY_1_REG: SECKEY_1 (Bit 0)                    */
#define FTDF_FTDF_SECKEY_1_REG_SECKEY_1_Msk   (0xffffffffUL)            /*!< FTDF FTDF_SECKEY_1_REG: SECKEY_1 (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  FTDF_FTDF_SECKEY_2_REG  --------------------------- */
#define FTDF_FTDF_SECKEY_2_REG_SECKEY_2_Pos   (0UL)                     /*!< FTDF FTDF_SECKEY_2_REG: SECKEY_2 (Bit 0)                    */
#define FTDF_FTDF_SECKEY_2_REG_SECKEY_2_Msk   (0xffffffffUL)            /*!< FTDF FTDF_SECKEY_2_REG: SECKEY_2 (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  FTDF_FTDF_SECKEY_3_REG  --------------------------- */
#define FTDF_FTDF_SECKEY_3_REG_SECKEY_3_Pos   (0UL)                     /*!< FTDF FTDF_SECKEY_3_REG: SECKEY_3 (Bit 0)                    */
#define FTDF_FTDF_SECKEY_3_REG_SECKEY_3_Msk   (0xffffffffUL)            /*!< FTDF FTDF_SECKEY_3_REG: SECKEY_3 (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_SECNONCE_0_REG  -------------------------- */
#define FTDF_FTDF_SECNONCE_0_REG_SECNONCE_0_Pos (0UL)                   /*!< FTDF FTDF_SECNONCE_0_REG: SECNONCE_0 (Bit 0)                */
#define FTDF_FTDF_SECNONCE_0_REG_SECNONCE_0_Msk (0xffffffffUL)          /*!< FTDF FTDF_SECNONCE_0_REG: SECNONCE_0 (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_SECNONCE_1_REG  -------------------------- */
#define FTDF_FTDF_SECNONCE_1_REG_SECNONCE_1_Pos (0UL)                   /*!< FTDF FTDF_SECNONCE_1_REG: SECNONCE_1 (Bit 0)                */
#define FTDF_FTDF_SECNONCE_1_REG_SECNONCE_1_Msk (0xffffffffUL)          /*!< FTDF FTDF_SECNONCE_1_REG: SECNONCE_1 (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_SECNONCE_2_REG  -------------------------- */
#define FTDF_FTDF_SECNONCE_2_REG_SECNONCE_2_Pos (0UL)                   /*!< FTDF FTDF_SECNONCE_2_REG: SECNONCE_2 (Bit 0)                */
#define FTDF_FTDF_SECNONCE_2_REG_SECNONCE_2_Msk (0xffffffffUL)          /*!< FTDF FTDF_SECNONCE_2_REG: SECNONCE_2 (Bitfield-Mask: 0xffffffff) */

