wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AA.h
/* -------------------------------  I2C_I2C_TAR_REG  ------------------------------ */
#define I2C_I2C_TAR_REG_IC_TAR_Pos            (0UL)                     /*!< I2C I2C_TAR_REG: IC_TAR (Bit 0)                             */
#define I2C_I2C_TAR_REG_IC_TAR_Msk            (0x3ffUL)                 /*!< I2C I2C_TAR_REG: IC_TAR (Bitfield-Mask: 0x3ff)              */
#define I2C_I2C_TAR_REG_GC_OR_START_Pos       (10UL)                    /*!< I2C I2C_TAR_REG: GC_OR_START (Bit 10)                       */
#define I2C_I2C_TAR_REG_GC_OR_START_Msk       (0x400UL)                 /*!< I2C I2C_TAR_REG: GC_OR_START (Bitfield-Mask: 0x01)          */
#define I2C_I2C_TAR_REG_SPECIAL_Pos           (11UL)                    /*!< I2C I2C_TAR_REG: SPECIAL (Bit 11)                           */
#define I2C_I2C_TAR_REG_SPECIAL_Msk           (0x800UL)                 /*!< I2C I2C_TAR_REG: SPECIAL (Bitfield-Mask: 0x01)              */

/* -------------------------------  I2C_I2C_SAR_REG  ------------------------------ */
#define I2C_I2C_SAR_REG_IC_SAR_Pos            (0UL)                     /*!< I2C I2C_SAR_REG: IC_SAR (Bit 0)                             */
#define I2C_I2C_SAR_REG_IC_SAR_Msk            (0x3ffUL)                 /*!< I2C I2C_SAR_REG: IC_SAR (Bitfield-Mask: 0x3ff)              */

/* ----------------------------  I2C_I2C_HS_MADDR_REG  ---------------------------- */
#define I2C_I2C_HS_MADDR_REG_IIC_HS_MAR_Pos   (0UL)                     /*!< I2C I2C_HS_MADDR_REG: IIC_HS_MAR (Bit 0)                    */
#define I2C_I2C_HS_MADDR_REG_IIC_HS_MAR_Msk   (0x7UL)                   /*!< I2C I2C_HS_MADDR_REG: IIC_HS_MAR (Bitfield-Mask: 0x07)      */

/* ----------------------------  I2C_I2C_DATA_CMD_REG  ---------------------------- */
#define I2C_I2C_DATA_CMD_REG_DAT_Pos          (0UL)                     /*!< I2C I2C_DATA_CMD_REG: DAT (Bit 0)                           */
#define I2C_I2C_DATA_CMD_REG_DAT_Msk          (0xffUL)                  /*!< I2C I2C_DATA_CMD_REG: DAT (Bitfield-Mask: 0xff)             */
#define I2C_I2C_DATA_CMD_REG_CMD_Pos          (8UL)                     /*!< I2C I2C_DATA_CMD_REG: CMD (Bit 8)                           */
#define I2C_I2C_DATA_CMD_REG_CMD_Msk          (0x100UL)                 /*!< I2C I2C_DATA_CMD_REG: CMD (Bitfield-Mask: 0x01)             */

/* ---------------------------  I2C_I2C_SS_SCL_HCNT_REG  -------------------------- */
#define I2C_I2C_SS_SCL_HCNT_REG_IC_SS_SCL_HCNT_Pos (0UL)                /*!< I2C I2C_SS_SCL_HCNT_REG: IC_SS_SCL_HCNT (Bit 0)             */
#define I2C_I2C_SS_SCL_HCNT_REG_IC_SS_SCL_HCNT_Msk (0xffffUL)           /*!< I2C I2C_SS_SCL_HCNT_REG: IC_SS_SCL_HCNT (Bitfield-Mask: 0xffff) */

/* ---------------------------  I2C_I2C_SS_SCL_LCNT_REG  -------------------------- */
#define I2C_I2C_SS_SCL_LCNT_REG_IC_SS_SCL_LCNT_Pos (0UL)                /*!< I2C I2C_SS_SCL_LCNT_REG: IC_SS_SCL_LCNT (Bit 0)             */
#define I2C_I2C_SS_SCL_LCNT_REG_IC_SS_SCL_LCNT_Msk (0xffffUL)           /*!< I2C I2C_SS_SCL_LCNT_REG: IC_SS_SCL_LCNT (Bitfield-Mask: 0xffff) */

/* ---------------------------  I2C_I2C_FS_SCL_HCNT_REG  -------------------------- */
#define I2C_I2C_FS_SCL_HCNT_REG_IC_FS_SCL_HCNT_Pos (0UL)                /*!< I2C I2C_FS_SCL_HCNT_REG: IC_FS_SCL_HCNT (Bit 0)             */
#define I2C_I2C_FS_SCL_HCNT_REG_IC_FS_SCL_HCNT_Msk (0xffffUL)           /*!< I2C I2C_FS_SCL_HCNT_REG: IC_FS_SCL_HCNT (Bitfield-Mask: 0xffff) */

/* ---------------------------  I2C_I2C_FS_SCL_LCNT_REG  -------------------------- */
#define I2C_I2C_FS_SCL_LCNT_REG_IC_FS_SCL_LCNT_Pos (0UL)                /*!< I2C I2C_FS_SCL_LCNT_REG: IC_FS_SCL_LCNT (Bit 0)             */
#define I2C_I2C_FS_SCL_LCNT_REG_IC_FS_SCL_LCNT_Msk (0xffffUL)           /*!< I2C I2C_FS_SCL_LCNT_REG: IC_FS_SCL_LCNT (Bitfield-Mask: 0xffff) */

/* ----------------------------  I2C_I2C_INTR_STAT_REG  --------------------------- */
#define I2C_I2C_INTR_STAT_REG_R_RX_UNDER_Pos  (0UL)                     /*!< I2C I2C_INTR_STAT_REG: R_RX_UNDER (Bit 0)                   */
#define I2C_I2C_INTR_STAT_REG_R_RX_UNDER_Msk  (0x1UL)                   /*!< I2C I2C_INTR_STAT_REG: R_RX_UNDER (Bitfield-Mask: 0x01)     */
#define I2C_I2C_INTR_STAT_REG_R_RX_OVER_Pos   (1UL)                     /*!< I2C I2C_INTR_STAT_REG: R_RX_OVER (Bit 1)                    */
#define I2C_I2C_INTR_STAT_REG_R_RX_OVER_Msk   (0x2UL)                   /*!< I2C I2C_INTR_STAT_REG: R_RX_OVER (Bitfield-Mask: 0x01)      */
#define I2C_I2C_INTR_STAT_REG_R_RX_FULL_Pos   (2UL)                     /*!< I2C I2C_INTR_STAT_REG: R_RX_FULL (Bit 2)                    */
#define I2C_I2C_INTR_STAT_REG_R_RX_FULL_Msk   (0x4UL)                   /*!< I2C I2C_INTR_STAT_REG: R_RX_FULL (Bitfield-Mask: 0x01)      */
#define I2C_I2C_INTR_STAT_REG_R_TX_OVER_Pos   (3UL)                     /*!< I2C I2C_INTR_STAT_REG: R_TX_OVER (Bit 3)                    */
#define I2C_I2C_INTR_STAT_REG_R_TX_OVER_Msk   (0x8UL)                   /*!< I2C I2C_INTR_STAT_REG: R_TX_OVER (Bitfield-Mask: 0x01)      */
#define I2C_I2C_INTR_STAT_REG_R_TX_EMPTY_Pos  (4UL)                     /*!< I2C I2C_INTR_STAT_REG: R_TX_EMPTY (Bit 4)                   */
#define I2C_I2C_INTR_STAT_REG_R_TX_EMPTY_Msk  (0x10UL)                  /*!< I2C I2C_INTR_STAT_REG: R_TX_EMPTY (Bitfield-Mask: 0x01)     */
#define I2C_I2C_INTR_STAT_REG_R_RD_REQ_Pos    (5UL)                     /*!< I2C I2C_INTR_STAT_REG: R_RD_REQ (Bit 5)                     */
#define I2C_I2C_INTR_STAT_REG_R_RD_REQ_Msk    (0x20UL)                  /*!< I2C I2C_INTR_STAT_REG: R_RD_REQ (Bitfield-Mask: 0x01)       */
#define I2C_I2C_INTR_STAT_REG_R_TX_ABRT_Pos   (6UL)                     /*!< I2C I2C_INTR_STAT_REG: R_TX_ABRT (Bit 6)                    */
#define I2C_I2C_INTR_STAT_REG_R_TX_ABRT_Msk   (0x40UL)                  /*!< I2C I2C_INTR_STAT_REG: R_TX_ABRT (Bitfield-Mask: 0x01)      */
#define I2C_I2C_INTR_STAT_REG_R_RX_DONE_Pos   (7UL)                     /*!< I2C I2C_INTR_STAT_REG: R_RX_DONE (Bit 7)                    */
#define I2C_I2C_INTR_STAT_REG_R_RX_DONE_Msk   (0x80UL)                  /*!< I2C I2C_INTR_STAT_REG: R_RX_DONE (Bitfield-Mask: 0x01)      */
#define I2C_I2C_INTR_STAT_REG_R_ACTIVITY_Pos  (8UL)                     /*!< I2C I2C_INTR_STAT_REG: R_ACTIVITY (Bit 8)                   */
#define I2C_I2C_INTR_STAT_REG_R_ACTIVITY_Msk  (0x100UL)                 /*!< I2C I2C_INTR_STAT_REG: R_ACTIVITY (Bitfield-Mask: 0x01)     */
#define I2C_I2C_INTR_STAT_REG_R_STOP_DET_Pos  (9UL)                     /*!< I2C I2C_INTR_STAT_REG: R_STOP_DET (Bit 9)                   */
#define I2C_I2C_INTR_STAT_REG_R_STOP_DET_Msk  (0x200UL)                 /*!< I2C I2C_INTR_STAT_REG: R_STOP_DET (Bitfield-Mask: 0x01)     */
#define I2C_I2C_INTR_STAT_REG_R_START_DET_Pos (10UL)                    /*!< I2C I2C_INTR_STAT_REG: R_START_DET (Bit 10)                 */
#define I2C_I2C_INTR_STAT_REG_R_START_DET_Msk (0x400UL)                 /*!< I2C I2C_INTR_STAT_REG: R_START_DET (Bitfield-Mask: 0x01)    */
#define I2C_I2C_INTR_STAT_REG_R_GEN_CALL_Pos  (11UL)                    /*!< I2C I2C_INTR_STAT_REG: R_GEN_CALL (Bit 11)                  */
#define I2C_I2C_INTR_STAT_REG_R_GEN_CALL_Msk  (0x800UL)                 /*!< I2C I2C_INTR_STAT_REG: R_GEN_CALL (Bitfield-Mask: 0x01)     */

/* ----------------------------  I2C_I2C_INTR_MASK_REG  --------------------------- */
#define I2C_I2C_INTR_MASK_REG_M_RX_UNDER_Pos  (0UL)                     /*!< I2C I2C_INTR_MASK_REG: M_RX_UNDER (Bit 0)                   */
#define I2C_I2C_INTR_MASK_REG_M_RX_UNDER_Msk  (0x1UL)                   /*!< I2C I2C_INTR_MASK_REG: M_RX_UNDER (Bitfield-Mask: 0x01)     */
#define I2C_I2C_INTR_MASK_REG_M_RX_OVER_Pos   (1UL)                     /*!< I2C I2C_INTR_MASK_REG: M_RX_OVER (Bit 1)                    */
#define I2C_I2C_INTR_MASK_REG_M_RX_OVER_Msk   (0x2UL)                   /*!< I2C I2C_INTR_MASK_REG: M_RX_OVER (Bitfield-Mask: 0x01)      */
#define I2C_I2C_INTR_MASK_REG_M_RX_FULL_Pos   (2UL)                     /*!< I2C I2C_INTR_MASK_REG: M_RX_FULL (Bit 2)                    */
#define I2C_I2C_INTR_MASK_REG_M_RX_FULL_Msk   (0x4UL)                   /*!< I2C I2C_INTR_MASK_REG: M_RX_FULL (Bitfield-Mask: 0x01)      */
#define I2C_I2C_INTR_MASK_REG_M_TX_OVER_Pos   (3UL)                     /*!< I2C I2C_INTR_MASK_REG: M_TX_OVER (Bit 3)                    */
#define I2C_I2C_INTR_MASK_REG_M_TX_OVER_Msk   (0x8UL)                   /*!< I2C I2C_INTR_MASK_REG: M_TX_OVER (Bitfield-Mask: 0x01)      */
#define I2C_I2C_INTR_MASK_REG_M_TX_EMPTY_Pos  (4UL)                     /*!< I2C I2C_INTR_MASK_REG: M_TX_EMPTY (Bit 4)                   */
#define I2C_I2C_INTR_MASK_REG_M_TX_EMPTY_Msk  (0x10UL)                  /*!< I2C I2C_INTR_MASK_REG: M_TX_EMPTY (Bitfield-Mask: 0x01)     */
#define I2C_I2C_INTR_MASK_REG_M_RD_REQ_Pos    (5UL)                     /*!< I2C I2C_INTR_MASK_REG: M_RD_REQ (Bit 5)                     */
#define I2C_I2C_INTR_MASK_REG_M_RD_REQ_Msk    (0x20UL)                  /*!< I2C I2C_INTR_MASK_REG: M_RD_REQ (Bitfield-Mask: 0x01)       */
#define I2C_I2C_INTR_MASK_REG_M_TX_ABRT_Pos   (6UL)                     /*!< I2C I2C_INTR_MASK_REG: M_TX_ABRT (Bit 6)                    */
#define I2C_I2C_INTR_MASK_REG_M_TX_ABRT_Msk   (0x40UL)                  /*!< I2C I2C_INTR_MASK_REG: M_TX_ABRT (Bitfield-Mask: 0x01)      */
#define I2C_I2C_INTR_MASK_REG_M_RX_DONE_Pos   (7UL)                     /*!< I2C I2C_INTR_MASK_REG: M_RX_DONE (Bit 7)                    */
#define I2C_I2C_INTR_MASK_REG_M_RX_DONE_Msk   (0x80UL)                  /*!< I2C I2C_INTR_MASK_REG: M_RX_DONE (Bitfield-Mask: 0x01)      */
#define I2C_I2C_INTR_MASK_REG_M_ACTIVITY_Pos  (8UL)                     /*!< I2C I2C_INTR_MASK_REG: M_ACTIVITY (Bit 8)                   */
#define I2C_I2C_INTR_MASK_REG_M_ACTIVITY_Msk  (0x100UL)                 /*!< I2C I2C_INTR_MASK_REG: M_ACTIVITY (Bitfield-Mask: 0x01)     */
#define I2C_I2C_INTR_MASK_REG_M_STOP_DET_Pos  (9UL)                     /*!< I2C I2C_INTR_MASK_REG: M_STOP_DET (Bit 9)                   */
#define I2C_I2C_INTR_MASK_REG_M_STOP_DET_Msk  (0x200UL)                 /*!< I2C I2C_INTR_MASK_REG: M_STOP_DET (Bitfield-Mask: 0x01)     */
#define I2C_I2C_INTR_MASK_REG_M_START_DET_Pos (10UL)                    /*!< I2C I2C_INTR_MASK_REG: M_START_DET (Bit 10)                 */
#define I2C_I2C_INTR_MASK_REG_M_START_DET_Msk (0x400UL)                 /*!< I2C I2C_INTR_MASK_REG: M_START_DET (Bitfield-Mask: 0x01)    */
#define I2C_I2C_INTR_MASK_REG_M_GEN_CALL_Pos  (11UL)                    /*!< I2C I2C_INTR_MASK_REG: M_GEN_CALL (Bit 11)                  */
#define I2C_I2C_INTR_MASK_REG_M_GEN_CALL_Msk  (0x800UL)                 /*!< I2C I2C_INTR_MASK_REG: M_GEN_CALL (Bitfield-Mask: 0x01)     */

