wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AA.h
/* ---------------------------  QSPIC_QSPIC_UCODE_START  -------------------------- */
#define QSPIC_QSPIC_UCODE_START_QSPIC_UCODE_X_Pos (0UL)                 /*!< QSPIC QSPIC_UCODE_START: QSPIC_UCODE_X (Bit 0)              */
#define QSPIC_QSPIC_UCODE_START_QSPIC_UCODE_X_Msk (0xffffffffUL)        /*!< QSPIC QSPIC_UCODE_START: QSPIC_UCODE_X (Bitfield-Mask: 0xffffffff) */


/* ================================================================================ */
/* ================          struct 'QUAD' Position & Mask         ================ */
/* ================================================================================ */


/* -----------------------------  QUAD_QDEC_CTRL_REG  ----------------------------- */
#define QUAD_QDEC_CTRL_REG_QD_IRQ_MASK_Pos    (0UL)                     /*!< QUAD QDEC_CTRL_REG: QD_IRQ_MASK (Bit 0)                     */
#define QUAD_QDEC_CTRL_REG_QD_IRQ_MASK_Msk    (0x1UL)                   /*!< QUAD QDEC_CTRL_REG: QD_IRQ_MASK (Bitfield-Mask: 0x01)       */
#define QUAD_QDEC_CTRL_REG_QD_IRQ_CLR_Pos     (1UL)                     /*!< QUAD QDEC_CTRL_REG: QD_IRQ_CLR (Bit 1)                      */
#define QUAD_QDEC_CTRL_REG_QD_IRQ_CLR_Msk     (0x2UL)                   /*!< QUAD QDEC_CTRL_REG: QD_IRQ_CLR (Bitfield-Mask: 0x01)        */
#define QUAD_QDEC_CTRL_REG_QD_IRQ_STATUS_Pos  (2UL)                     /*!< QUAD QDEC_CTRL_REG: QD_IRQ_STATUS (Bit 2)                   */
#define QUAD_QDEC_CTRL_REG_QD_IRQ_STATUS_Msk  (0x4UL)                   /*!< QUAD QDEC_CTRL_REG: QD_IRQ_STATUS (Bitfield-Mask: 0x01)     */
#define QUAD_QDEC_CTRL_REG_QD_IRQ_THRES_Pos   (3UL)                     /*!< QUAD QDEC_CTRL_REG: QD_IRQ_THRES (Bit 3)                    */
#define QUAD_QDEC_CTRL_REG_QD_IRQ_THRES_Msk   (0x3f8UL)                 /*!< QUAD QDEC_CTRL_REG: QD_IRQ_THRES (Bitfield-Mask: 0x7f)      */
#define QUAD_QDEC_CTRL_REG_CHX_PORT_EN_Pos    (10UL)                    /*!< QUAD QDEC_CTRL_REG: CHX_PORT_EN (Bit 10)                    */
#define QUAD_QDEC_CTRL_REG_CHX_PORT_EN_Msk    (0x400UL)                 /*!< QUAD QDEC_CTRL_REG: CHX_PORT_EN (Bitfield-Mask: 0x01)       */
#define QUAD_QDEC_CTRL_REG_CHY_PORT_EN_Pos    (11UL)                    /*!< QUAD QDEC_CTRL_REG: CHY_PORT_EN (Bit 11)                    */
#define QUAD_QDEC_CTRL_REG_CHY_PORT_EN_Msk    (0x800UL)                 /*!< QUAD QDEC_CTRL_REG: CHY_PORT_EN (Bitfield-Mask: 0x01)       */
#define QUAD_QDEC_CTRL_REG_CHZ_PORT_EN_Pos    (12UL)                    /*!< QUAD QDEC_CTRL_REG: CHZ_PORT_EN (Bit 12)                    */
#define QUAD_QDEC_CTRL_REG_CHZ_PORT_EN_Msk    (0x1000UL)                /*!< QUAD QDEC_CTRL_REG: CHZ_PORT_EN (Bitfield-Mask: 0x01)       */

/* -----------------------------  QUAD_QDEC_XCNT_REG  ----------------------------- */
#define QUAD_QDEC_XCNT_REG_X_counter_Pos      (0UL)                     /*!< QUAD QDEC_XCNT_REG: X_counter (Bit 0)                       */
#define QUAD_QDEC_XCNT_REG_X_counter_Msk      (0xffffUL)                /*!< QUAD QDEC_XCNT_REG: X_counter (Bitfield-Mask: 0xffff)       */

/* -----------------------------  QUAD_QDEC_YCNT_REG  ----------------------------- */
#define QUAD_QDEC_YCNT_REG_Y_counter_Pos      (0UL)                     /*!< QUAD QDEC_YCNT_REG: Y_counter (Bit 0)                       */
#define QUAD_QDEC_YCNT_REG_Y_counter_Msk      (0xffffUL)                /*!< QUAD QDEC_YCNT_REG: Y_counter (Bitfield-Mask: 0xffff)       */

/* -----------------------------  QUAD_QDEC_ZCNT_REG  ----------------------------- */
#define QUAD_QDEC_ZCNT_REG_Z_counter_Pos      (0UL)                     /*!< QUAD QDEC_ZCNT_REG: Z_counter (Bit 0)                       */
#define QUAD_QDEC_ZCNT_REG_Z_counter_Msk      (0xffffUL)                /*!< QUAD QDEC_ZCNT_REG: Z_counter (Bitfield-Mask: 0xffff)       */

/* ---------------------------  QUAD_QDEC_CLOCKDIV_REG  --------------------------- */
#define QUAD_QDEC_CLOCKDIV_REG_clock_divider_Pos (0UL)                  /*!< QUAD QDEC_CLOCKDIV_REG: clock_divider (Bit 0)               */
#define QUAD_QDEC_CLOCKDIV_REG_clock_divider_Msk (0x3ffUL)              /*!< QUAD QDEC_CLOCKDIV_REG: clock_divider (Bitfield-Mask: 0x3ff) */


/* ================================================================================ */
/* ================          struct 'RFCU' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------  RFCU_RF_OVERRULE_REG  ---------------------------- */
#define RFCU_RF_OVERRULE_REG_TX_EN_OVR_Pos    (0UL)                     /*!< RFCU RF_OVERRULE_REG: TX_EN_OVR (Bit 0)                     */
#define RFCU_RF_OVERRULE_REG_TX_EN_OVR_Msk    (0x3UL)                   /*!< RFCU RF_OVERRULE_REG: TX_EN_OVR (Bitfield-Mask: 0x03)       */
#define RFCU_RF_OVERRULE_REG_RX_EN_OVR_Pos    (2UL)                     /*!< RFCU RF_OVERRULE_REG: RX_EN_OVR (Bit 2)                     */
#define RFCU_RF_OVERRULE_REG_RX_EN_OVR_Msk    (0xcUL)                   /*!< RFCU RF_OVERRULE_REG: RX_EN_OVR (Bitfield-Mask: 0x03)       */
#define RFCU_RF_OVERRULE_REG_RF_MODE_OVR_Pos  (4UL)                     /*!< RFCU RF_OVERRULE_REG: RF_MODE_OVR (Bit 4)                   */
#define RFCU_RF_OVERRULE_REG_RF_MODE_OVR_Msk  (0x30UL)                  /*!< RFCU RF_OVERRULE_REG: RF_MODE_OVR (Bitfield-Mask: 0x03)     */
#define RFCU_RF_OVERRULE_REG_IFF_FTDF_OVR_Pos (6UL)                     /*!< RFCU RF_OVERRULE_REG: IFF_FTDF_OVR (Bit 6)                  */
#define RFCU_RF_OVERRULE_REG_IFF_FTDF_OVR_Msk (0xc0UL)                  /*!< RFCU RF_OVERRULE_REG: IFF_FTDF_OVR (Bitfield-Mask: 0x03)    */
#define RFCU_RF_OVERRULE_REG_MIX_FTDF_OVR_Pos (8UL)                     /*!< RFCU RF_OVERRULE_REG: MIX_FTDF_OVR (Bit 8)                  */
#define RFCU_RF_OVERRULE_REG_MIX_FTDF_OVR_Msk (0x300UL)                 /*!< RFCU RF_OVERRULE_REG: MIX_FTDF_OVR (Bitfield-Mask: 0x03)    */
#define RFCU_RF_OVERRULE_REG_TXDAC_SEL_Pos    (10UL)                    /*!< RFCU RF_OVERRULE_REG: TXDAC_SEL (Bit 10)                    */
#define RFCU_RF_OVERRULE_REG_TXDAC_SEL_Msk    (0xc00UL)                 /*!< RFCU RF_OVERRULE_REG: TXDAC_SEL (Bitfield-Mask: 0x03)       */
#define RFCU_RF_OVERRULE_REG_GAUSS_DAC_SEL_Pos (12UL)                   /*!< RFCU RF_OVERRULE_REG: GAUSS_DAC_SEL (Bit 12)                */
#define RFCU_RF_OVERRULE_REG_GAUSS_DAC_SEL_Msk (0x3000UL)               /*!< RFCU RF_OVERRULE_REG: GAUSS_DAC_SEL (Bitfield-Mask: 0x03)   */
#define RFCU_RF_OVERRULE_REG_CN_FTDF_TIMES2_Pos (14UL)                  /*!< RFCU RF_OVERRULE_REG: CN_FTDF_TIMES2 (Bit 14)               */
#define RFCU_RF_OVERRULE_REG_CN_FTDF_TIMES2_Msk (0x4000UL)              /*!< RFCU RF_OVERRULE_REG: CN_FTDF_TIMES2 (Bitfield-Mask: 0x01)  */

