wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AA.h
/* -----------------------------  TRNG_TRNG_CTRL_REG  ----------------------------- */
#define TRNG_TRNG_CTRL_REG_TRNG_ENABLE_Pos    (0UL)                     /*!< TRNG TRNG_CTRL_REG: TRNG_ENABLE (Bit 0)                     */
#define TRNG_TRNG_CTRL_REG_TRNG_ENABLE_Msk    (0x1UL)                   /*!< TRNG TRNG_CTRL_REG: TRNG_ENABLE (Bitfield-Mask: 0x01)       */
#define TRNG_TRNG_CTRL_REG_TRNG_MODE_Pos      (1UL)                     /*!< TRNG TRNG_CTRL_REG: TRNG_MODE (Bit 1)                       */
#define TRNG_TRNG_CTRL_REG_TRNG_MODE_Msk      (0x2UL)                   /*!< TRNG TRNG_CTRL_REG: TRNG_MODE (Bitfield-Mask: 0x01)         */

/* ----------------------------  TRNG_TRNG_FIFOLVL_REG  --------------------------- */
#define TRNG_TRNG_FIFOLVL_REG_TRNG_FIFOLVL_Pos (0UL)                    /*!< TRNG TRNG_FIFOLVL_REG: TRNG_FIFOLVL (Bit 0)                 */
#define TRNG_TRNG_FIFOLVL_REG_TRNG_FIFOLVL_Msk (0x1fUL)                 /*!< TRNG TRNG_FIFOLVL_REG: TRNG_FIFOLVL (Bitfield-Mask: 0x1f)   */
#define TRNG_TRNG_FIFOLVL_REG_TRNG_FIFOFULL_Pos (5UL)                   /*!< TRNG TRNG_FIFOLVL_REG: TRNG_FIFOFULL (Bit 5)                */
#define TRNG_TRNG_FIFOLVL_REG_TRNG_FIFOFULL_Msk (0x20UL)                /*!< TRNG TRNG_FIFOLVL_REG: TRNG_FIFOFULL (Bitfield-Mask: 0x01)  */

/* ------------------------------  TRNG_TRNG_VER_REG  ----------------------------- */
#define TRNG_TRNG_VER_REG_TRNG_SVN_Pos        (0UL)                     /*!< TRNG TRNG_VER_REG: TRNG_SVN (Bit 0)                         */
#define TRNG_TRNG_VER_REG_TRNG_SVN_Msk        (0xffffUL)                /*!< TRNG TRNG_VER_REG: TRNG_SVN (Bitfield-Mask: 0xffff)         */
#define TRNG_TRNG_VER_REG_TRNG_MIN_Pos        (16UL)                    /*!< TRNG TRNG_VER_REG: TRNG_MIN (Bit 16)                        */
#define TRNG_TRNG_VER_REG_TRNG_MIN_Msk        (0xff0000UL)              /*!< TRNG TRNG_VER_REG: TRNG_MIN (Bitfield-Mask: 0xff)           */
#define TRNG_TRNG_VER_REG_TRNG_MAJ_Pos        (24UL)                    /*!< TRNG TRNG_VER_REG: TRNG_MAJ (Bit 24)                        */
#define TRNG_TRNG_VER_REG_TRNG_MAJ_Msk        (0xff000000UL)            /*!< TRNG TRNG_VER_REG: TRNG_MAJ (Bitfield-Mask: 0xff)           */


/* ================================================================================ */
/* ================          struct 'UART' Position & Mask         ================ */
/* ================================================================================ */


/* --------------------------  UART_UART_RBR_THR_DLL_REG  ------------------------- */
#define UART_UART_RBR_THR_DLL_REG_RBR_THR_DLL_Pos (0UL)                 /*!< UART UART_RBR_THR_DLL_REG: RBR_THR_DLL (Bit 0)              */
#define UART_UART_RBR_THR_DLL_REG_RBR_THR_DLL_Msk (0xffUL)              /*!< UART UART_RBR_THR_DLL_REG: RBR_THR_DLL (Bitfield-Mask: 0xff) */

/* ----------------------------  UART_UART_IER_DLH_REG  --------------------------- */
#define UART_UART_IER_DLH_REG_ERBFI_dlh0_Pos  (0UL)                     /*!< UART UART_IER_DLH_REG: ERBFI_dlh0 (Bit 0)                   */
#define UART_UART_IER_DLH_REG_ERBFI_dlh0_Msk  (0x1UL)                   /*!< UART UART_IER_DLH_REG: ERBFI_dlh0 (Bitfield-Mask: 0x01)     */
#define UART_UART_IER_DLH_REG_ETBEI_dlh1_Pos  (1UL)                     /*!< UART UART_IER_DLH_REG: ETBEI_dlh1 (Bit 1)                   */
#define UART_UART_IER_DLH_REG_ETBEI_dlh1_Msk  (0x2UL)                   /*!< UART UART_IER_DLH_REG: ETBEI_dlh1 (Bitfield-Mask: 0x01)     */
#define UART_UART_IER_DLH_REG_ELSI_dhl2_Pos   (2UL)                     /*!< UART UART_IER_DLH_REG: ELSI_dhl2 (Bit 2)                    */
#define UART_UART_IER_DLH_REG_ELSI_dhl2_Msk   (0x4UL)                   /*!< UART UART_IER_DLH_REG: ELSI_dhl2 (Bitfield-Mask: 0x01)      */
#define UART_UART_IER_DLH_REG_PTIME_dlh7_Pos  (7UL)                     /*!< UART UART_IER_DLH_REG: PTIME_dlh7 (Bit 7)                   */
#define UART_UART_IER_DLH_REG_PTIME_dlh7_Msk  (0x80UL)                  /*!< UART UART_IER_DLH_REG: PTIME_dlh7 (Bitfield-Mask: 0x01)     */

/* ----------------------------  UART_UART_IIR_FCR_REG  --------------------------- */
#define UART_UART_IIR_FCR_REG_IIR_FCR_Pos     (0UL)                     /*!< UART UART_IIR_FCR_REG: IIR_FCR (Bit 0)                      */
#define UART_UART_IIR_FCR_REG_IIR_FCR_Msk     (0xffffUL)                /*!< UART UART_IIR_FCR_REG: IIR_FCR (Bitfield-Mask: 0xffff)      */

/* ------------------------------  UART_UART_LCR_REG  ----------------------------- */
#define UART_UART_LCR_REG_UART_DLS_Pos        (0UL)                     /*!< UART UART_LCR_REG: UART_DLS (Bit 0)                         */
#define UART_UART_LCR_REG_UART_DLS_Msk        (0x3UL)                   /*!< UART UART_LCR_REG: UART_DLS (Bitfield-Mask: 0x03)           */
#define UART_UART_LCR_REG_UART_STOP_Pos       (2UL)                     /*!< UART UART_LCR_REG: UART_STOP (Bit 2)                        */
#define UART_UART_LCR_REG_UART_STOP_Msk       (0x4UL)                   /*!< UART UART_LCR_REG: UART_STOP (Bitfield-Mask: 0x01)          */
#define UART_UART_LCR_REG_UART_PEN_Pos        (3UL)                     /*!< UART UART_LCR_REG: UART_PEN (Bit 3)                         */
#define UART_UART_LCR_REG_UART_PEN_Msk        (0x8UL)                   /*!< UART UART_LCR_REG: UART_PEN (Bitfield-Mask: 0x01)           */
#define UART_UART_LCR_REG_UART_EPS_Pos        (4UL)                     /*!< UART UART_LCR_REG: UART_EPS (Bit 4)                         */
#define UART_UART_LCR_REG_UART_EPS_Msk        (0x10UL)                  /*!< UART UART_LCR_REG: UART_EPS (Bitfield-Mask: 0x01)           */
#define UART_UART_LCR_REG_UART_BC_Pos         (6UL)                     /*!< UART UART_LCR_REG: UART_BC (Bit 6)                          */
#define UART_UART_LCR_REG_UART_BC_Msk         (0x40UL)                  /*!< UART UART_LCR_REG: UART_BC (Bitfield-Mask: 0x01)            */
#define UART_UART_LCR_REG_UART_DLAB_Pos       (7UL)                     /*!< UART UART_LCR_REG: UART_DLAB (Bit 7)                        */
#define UART_UART_LCR_REG_UART_DLAB_Msk       (0x80UL)                  /*!< UART UART_LCR_REG: UART_DLAB (Bitfield-Mask: 0x01)          */

/* ------------------------------  UART_UART_MCR_REG  ----------------------------- */
#define UART_UART_MCR_REG_UART_OUT1_Pos       (2UL)                     /*!< UART UART_MCR_REG: UART_OUT1 (Bit 2)                        */
#define UART_UART_MCR_REG_UART_OUT1_Msk       (0x4UL)                   /*!< UART UART_MCR_REG: UART_OUT1 (Bitfield-Mask: 0x01)          */
#define UART_UART_MCR_REG_UART_OUT2_Pos       (3UL)                     /*!< UART UART_MCR_REG: UART_OUT2 (Bit 3)                        */
#define UART_UART_MCR_REG_UART_OUT2_Msk       (0x8UL)                   /*!< UART UART_MCR_REG: UART_OUT2 (Bitfield-Mask: 0x01)          */
#define UART_UART_MCR_REG_UART_LB_Pos         (4UL)                     /*!< UART UART_MCR_REG: UART_LB (Bit 4)                          */
#define UART_UART_MCR_REG_UART_LB_Msk         (0x10UL)                  /*!< UART UART_MCR_REG: UART_LB (Bitfield-Mask: 0x01)            */
#define UART_UART_MCR_REG_UART_SIRE_Pos       (6UL)                     /*!< UART UART_MCR_REG: UART_SIRE (Bit 6)                        */
#define UART_UART_MCR_REG_UART_SIRE_Msk       (0x40UL)                  /*!< UART UART_MCR_REG: UART_SIRE (Bitfield-Mask: 0x01)          */

/* ------------------------------  UART_UART_LSR_REG  ----------------------------- */
#define UART_UART_LSR_REG_UART_DR_Pos         (0UL)                     /*!< UART UART_LSR_REG: UART_DR (Bit 0)                          */
#define UART_UART_LSR_REG_UART_DR_Msk         (0x1UL)                   /*!< UART UART_LSR_REG: UART_DR (Bitfield-Mask: 0x01)            */
#define UART_UART_LSR_REG_UART_OE_Pos         (1UL)                     /*!< UART UART_LSR_REG: UART_OE (Bit 1)                          */
#define UART_UART_LSR_REG_UART_OE_Msk         (0x2UL)                   /*!< UART UART_LSR_REG: UART_OE (Bitfield-Mask: 0x01)            */
#define UART_UART_LSR_REG_UART_PE_Pos         (2UL)                     /*!< UART UART_LSR_REG: UART_PE (Bit 2)                          */
#define UART_UART_LSR_REG_UART_PE_Msk         (0x4UL)                   /*!< UART UART_LSR_REG: UART_PE (Bitfield-Mask: 0x01)            */
#define UART_UART_LSR_REG_UART_FE_Pos         (3UL)                     /*!< UART UART_LSR_REG: UART_FE (Bit 3)                          */
#define UART_UART_LSR_REG_UART_FE_Msk         (0x8UL)                   /*!< UART UART_LSR_REG: UART_FE (Bitfield-Mask: 0x01)            */
#define UART_UART_LSR_REG_UART_BI_Pos         (4UL)                     /*!< UART UART_LSR_REG: UART_BI (Bit 4)                          */
#define UART_UART_LSR_REG_UART_BI_Msk         (0x10UL)                  /*!< UART UART_LSR_REG: UART_BI (Bitfield-Mask: 0x01)            */
#define UART_UART_LSR_REG_UART_THRE_Pos       (5UL)                     /*!< UART UART_LSR_REG: UART_THRE (Bit 5)                        */
#define UART_UART_LSR_REG_UART_THRE_Msk       (0x20UL)                  /*!< UART UART_LSR_REG: UART_THRE (Bitfield-Mask: 0x01)          */
#define UART_UART_LSR_REG_UART_TEMT_Pos       (6UL)                     /*!< UART UART_LSR_REG: UART_TEMT (Bit 6)                        */
#define UART_UART_LSR_REG_UART_TEMT_Msk       (0x40UL)                  /*!< UART UART_LSR_REG: UART_TEMT (Bitfield-Mask: 0x01)          */

/* ------------------------------  UART_UART_SCR_REG  ----------------------------- */
#define UART_UART_SCR_REG_UART_SCRATCH_PAD_Pos (0UL)                    /*!< UART UART_SCR_REG: UART_SCRATCH_PAD (Bit 0)                 */
#define UART_UART_SCR_REG_UART_SCRATCH_PAD_Msk (0xffUL)                 /*!< UART UART_SCR_REG: UART_SCRATCH_PAD (Bitfield-Mask: 0xff)   */

