wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AA.h
/* ----------------------------  UART2_UART2_SDMAM_REG  --------------------------- */
#define UART2_UART2_SDMAM_REG_UART_SHADOW_DMA_MODE_Pos (0UL)            /*!< UART2 UART2_SDMAM_REG: UART_SHADOW_DMA_MODE (Bit 0)         */
#define UART2_UART2_SDMAM_REG_UART_SHADOW_DMA_MODE_Msk (0x1UL)          /*!< UART2 UART2_SDMAM_REG: UART_SHADOW_DMA_MODE (Bitfield-Mask: 0x01) */

/* -----------------------------  UART2_UART2_SFE_REG  ---------------------------- */
#define UART2_UART2_SFE_REG_UART_SHADOW_FIFO_ENABLE_Pos (0UL)           /*!< UART2 UART2_SFE_REG: UART_SHADOW_FIFO_ENABLE (Bit 0)        */
#define UART2_UART2_SFE_REG_UART_SHADOW_FIFO_ENABLE_Msk (0x1UL)         /*!< UART2 UART2_SFE_REG: UART_SHADOW_FIFO_ENABLE (Bitfield-Mask: 0x01) */

/* -----------------------------  UART2_UART2_SRT_REG  ---------------------------- */
#define UART2_UART2_SRT_REG_UART_SHADOW_RCVR_TRIGGER_Pos (0UL)          /*!< UART2 UART2_SRT_REG: UART_SHADOW_RCVR_TRIGGER (Bit 0)       */
#define UART2_UART2_SRT_REG_UART_SHADOW_RCVR_TRIGGER_Msk (0x3UL)        /*!< UART2 UART2_SRT_REG: UART_SHADOW_RCVR_TRIGGER (Bitfield-Mask: 0x03) */

/* ----------------------------  UART2_UART2_STET_REG  ---------------------------- */
#define UART2_UART2_STET_REG_UART_SHADOW_TX_EMPTY_TRIGGER_Pos (0UL)     /*!< UART2 UART2_STET_REG: UART_SHADOW_TX_EMPTY_TRIGGER (Bit 0)  */
#define UART2_UART2_STET_REG_UART_SHADOW_TX_EMPTY_TRIGGER_Msk (0x3UL)   /*!< UART2 UART2_STET_REG: UART_SHADOW_TX_EMPTY_TRIGGER (Bitfield-Mask: 0x03) */

/* -----------------------------  UART2_UART2_HTX_REG  ---------------------------- */
#define UART2_UART2_HTX_REG_UART_HALT_TX_Pos  (0UL)                     /*!< UART2 UART2_HTX_REG: UART_HALT_TX (Bit 0)                   */
#define UART2_UART2_HTX_REG_UART_HALT_TX_Msk  (0x1UL)                   /*!< UART2 UART2_HTX_REG: UART_HALT_TX (Bitfield-Mask: 0x01)     */

/* ----------------------------  UART2_UART2_DMASA_REG  --------------------------- */
#define UART2_UART2_DMASA_REG_DMASA_Pos       (0UL)                     /*!< UART2 UART2_DMASA_REG: DMASA (Bit 0)                        */
#define UART2_UART2_DMASA_REG_DMASA_Msk       (0x1UL)                   /*!< UART2 UART2_DMASA_REG: DMASA (Bitfield-Mask: 0x01)          */

/* -----------------------------  UART2_UART2_DLF_REG  ---------------------------- */
#define UART2_UART2_DLF_REG_UART_DLF_Pos      (0UL)                     /*!< UART2 UART2_DLF_REG: UART_DLF (Bit 0)                       */
#define UART2_UART2_DLF_REG_UART_DLF_Msk      (0xfUL)                   /*!< UART2 UART2_DLF_REG: UART_DLF (Bitfield-Mask: 0x0f)         */

/* -----------------------------  UART2_UART2_CPR_REG  ---------------------------- */
#define UART2_UART2_CPR_REG_CPR_Pos           (0UL)                     /*!< UART2 UART2_CPR_REG: CPR (Bit 0)                            */
#define UART2_UART2_CPR_REG_CPR_Msk           (0xffffUL)                /*!< UART2 UART2_CPR_REG: CPR (Bitfield-Mask: 0xffff)            */

/* -----------------------------  UART2_UART2_UCV_REG  ---------------------------- */
#define UART2_UART2_UCV_REG_UCV_Pos           (0UL)                     /*!< UART2 UART2_UCV_REG: UCV (Bit 0)                            */
#define UART2_UART2_UCV_REG_UCV_Msk           (0xffffUL)                /*!< UART2 UART2_UCV_REG: UCV (Bitfield-Mask: 0xffff)            */

/* -----------------------------  UART2_UART2_CTR_REG  ---------------------------- */
#define UART2_UART2_CTR_REG_CTR_Pos           (0UL)                     /*!< UART2 UART2_CTR_REG: CTR (Bit 0)                            */
#define UART2_UART2_CTR_REG_CTR_Msk           (0xffffUL)                /*!< UART2 UART2_CTR_REG: CTR (Bitfield-Mask: 0xffff)            */


/* ================================================================================ */
/* ================          struct 'USB' Position & Mask          ================ */
/* ================================================================================ */


/* ------------------------------  USB_USB_MCTRL_REG  ----------------------------- */
#define USB_USB_MCTRL_REG_USBEN_Pos           (0UL)                     /*!< USB USB_MCTRL_REG: USBEN (Bit 0)                            */
#define USB_USB_MCTRL_REG_USBEN_Msk           (0x1UL)                   /*!< USB USB_MCTRL_REG: USBEN (Bitfield-Mask: 0x01)              */
#define USB_USB_MCTRL_REG_USB_DBG_Pos         (1UL)                     /*!< USB USB_MCTRL_REG: USB_DBG (Bit 1)                          */
#define USB_USB_MCTRL_REG_USB_DBG_Msk         (0x2UL)                   /*!< USB USB_MCTRL_REG: USB_DBG (Bitfield-Mask: 0x01)            */
#define USB_USB_MCTRL_REG_USB_NAT_Pos         (3UL)                     /*!< USB USB_MCTRL_REG: USB_NAT (Bit 3)                          */
#define USB_USB_MCTRL_REG_USB_NAT_Msk         (0x8UL)                   /*!< USB USB_MCTRL_REG: USB_NAT (Bitfield-Mask: 0x01)            */
#define USB_USB_MCTRL_REG_LSMODE_Pos          (4UL)                     /*!< USB USB_MCTRL_REG: LSMODE (Bit 4)                           */
#define USB_USB_MCTRL_REG_LSMODE_Msk          (0x10UL)                  /*!< USB USB_MCTRL_REG: LSMODE (Bitfield-Mask: 0x01)             */

/* -----------------------------  USB_USB_XCVDIAG_REG  ---------------------------- */
#define USB_USB_XCVDIAG_REG_USB_XCV_TEST_Pos  (0UL)                     /*!< USB USB_XCVDIAG_REG: USB_XCV_TEST (Bit 0)                   */
#define USB_USB_XCVDIAG_REG_USB_XCV_TEST_Msk  (0x1UL)                   /*!< USB USB_XCVDIAG_REG: USB_XCV_TEST (Bitfield-Mask: 0x01)     */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXp_Pos   (1UL)                     /*!< USB USB_XCVDIAG_REG: USB_XCV_TXp (Bit 1)                    */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXp_Msk   (0x2UL)                   /*!< USB USB_XCVDIAG_REG: USB_XCV_TXp (Bitfield-Mask: 0x01)      */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXn_Pos   (2UL)                     /*!< USB USB_XCVDIAG_REG: USB_XCV_TXn (Bit 2)                    */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXn_Msk   (0x4UL)                   /*!< USB USB_XCVDIAG_REG: USB_XCV_TXn (Bitfield-Mask: 0x01)      */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXEN_Pos  (3UL)                     /*!< USB USB_XCVDIAG_REG: USB_XCV_TXEN (Bit 3)                   */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXEN_Msk  (0x8UL)                   /*!< USB USB_XCVDIAG_REG: USB_XCV_TXEN (Bitfield-Mask: 0x01)     */
#define USB_USB_XCVDIAG_REG_USB_RCV_Pos       (5UL)                     /*!< USB USB_XCVDIAG_REG: USB_RCV (Bit 5)                        */
#define USB_USB_XCVDIAG_REG_USB_RCV_Msk       (0x20UL)                  /*!< USB USB_XCVDIAG_REG: USB_RCV (Bitfield-Mask: 0x01)          */
#define USB_USB_XCVDIAG_REG_USB_VMIN_Pos      (6UL)                     /*!< USB USB_XCVDIAG_REG: USB_VMIN (Bit 6)                       */
#define USB_USB_XCVDIAG_REG_USB_VMIN_Msk      (0x40UL)                  /*!< USB USB_XCVDIAG_REG: USB_VMIN (Bitfield-Mask: 0x01)         */
#define USB_USB_XCVDIAG_REG_USB_VPIN_Pos      (7UL)                     /*!< USB USB_XCVDIAG_REG: USB_VPIN (Bit 7)                       */
#define USB_USB_XCVDIAG_REG_USB_VPIN_Msk      (0x80UL)                  /*!< USB USB_XCVDIAG_REG: USB_VPIN (Bitfield-Mask: 0x01)         */

/* -------------------------------  USB_USB_TCR_REG  ------------------------------ */
#define USB_USB_TCR_REG_USB_CADJ_Pos          (0UL)                     /*!< USB USB_TCR_REG: USB_CADJ (Bit 0)                           */
#define USB_USB_TCR_REG_USB_CADJ_Msk          (0x1fUL)                  /*!< USB USB_TCR_REG: USB_CADJ (Bitfield-Mask: 0x1f)             */
#define USB_USB_TCR_REG_USB_VADJ_Pos          (5UL)                     /*!< USB USB_TCR_REG: USB_VADJ (Bit 5)                           */
#define USB_USB_TCR_REG_USB_VADJ_Msk          (0xe0UL)                  /*!< USB USB_TCR_REG: USB_VADJ (Bitfield-Mask: 0x07)             */

