wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AA.h
/* -------------------------------  USB_USB_UTR_REG  ------------------------------ */
#define USB_USB_UTR_REG_USB_UTR_RES_Pos       (0UL)                     /*!< USB USB_UTR_REG: USB_UTR_RES (Bit 0)                        */
#define USB_USB_UTR_REG_USB_UTR_RES_Msk       (0x1fUL)                  /*!< USB USB_UTR_REG: USB_UTR_RES (Bitfield-Mask: 0x1f)          */
#define USB_USB_UTR_REG_USB_SF_Pos            (5UL)                     /*!< USB USB_UTR_REG: USB_SF (Bit 5)                             */
#define USB_USB_UTR_REG_USB_SF_Msk            (0x20UL)                  /*!< USB USB_UTR_REG: USB_SF (Bitfield-Mask: 0x01)               */
#define USB_USB_UTR_REG_USB_NCRC_Pos          (6UL)                     /*!< USB USB_UTR_REG: USB_NCRC (Bit 6)                           */
#define USB_USB_UTR_REG_USB_NCRC_Msk          (0x40UL)                  /*!< USB USB_UTR_REG: USB_NCRC (Bitfield-Mask: 0x01)             */
#define USB_USB_UTR_REG_USB_DIAG_Pos          (7UL)                     /*!< USB USB_UTR_REG: USB_DIAG (Bit 7)                           */
#define USB_USB_UTR_REG_USB_DIAG_Msk          (0x80UL)                  /*!< USB USB_UTR_REG: USB_DIAG (Bitfield-Mask: 0x01)             */

/* -------------------------------  USB_USB_FAR_REG  ------------------------------ */
#define USB_USB_FAR_REG_USB_AD_Pos            (0UL)                     /*!< USB USB_FAR_REG: USB_AD (Bit 0)                             */
#define USB_USB_FAR_REG_USB_AD_Msk            (0x7fUL)                  /*!< USB USB_FAR_REG: USB_AD (Bitfield-Mask: 0x7f)               */
#define USB_USB_FAR_REG_USB_AD_EN_Pos         (7UL)                     /*!< USB USB_FAR_REG: USB_AD_EN (Bit 7)                          */
#define USB_USB_FAR_REG_USB_AD_EN_Msk         (0x80UL)                  /*!< USB USB_FAR_REG: USB_AD_EN (Bitfield-Mask: 0x01)            */

/* ------------------------------  USB_USB_NFSR_REG  ------------------------------ */
#define USB_USB_NFSR_REG_USB_NFS_Pos          (0UL)                     /*!< USB USB_NFSR_REG: USB_NFS (Bit 0)                           */
#define USB_USB_NFSR_REG_USB_NFS_Msk          (0x3UL)                   /*!< USB USB_NFSR_REG: USB_NFS (Bitfield-Mask: 0x03)             */

/* ------------------------------  USB_USB_MAEV_REG  ------------------------------ */
#define USB_USB_MAEV_REG_USB_WARN_Pos         (0UL)                     /*!< USB USB_MAEV_REG: USB_WARN (Bit 0)                          */
#define USB_USB_MAEV_REG_USB_WARN_Msk         (0x1UL)                   /*!< USB USB_MAEV_REG: USB_WARN (Bitfield-Mask: 0x01)            */
#define USB_USB_MAEV_REG_USB_ALT_Pos          (1UL)                     /*!< USB USB_MAEV_REG: USB_ALT (Bit 1)                           */
#define USB_USB_MAEV_REG_USB_ALT_Msk          (0x2UL)                   /*!< USB USB_MAEV_REG: USB_ALT (Bitfield-Mask: 0x01)             */
#define USB_USB_MAEV_REG_USB_TX_EV_Pos        (2UL)                     /*!< USB USB_MAEV_REG: USB_TX_EV (Bit 2)                         */
#define USB_USB_MAEV_REG_USB_TX_EV_Msk        (0x4UL)                   /*!< USB USB_MAEV_REG: USB_TX_EV (Bitfield-Mask: 0x01)           */
#define USB_USB_MAEV_REG_USB_FRAME_Pos        (3UL)                     /*!< USB USB_MAEV_REG: USB_FRAME (Bit 3)                         */
#define USB_USB_MAEV_REG_USB_FRAME_Msk        (0x8UL)                   /*!< USB USB_MAEV_REG: USB_FRAME (Bitfield-Mask: 0x01)           */
#define USB_USB_MAEV_REG_USB_NAK_Pos          (4UL)                     /*!< USB USB_MAEV_REG: USB_NAK (Bit 4)                           */
#define USB_USB_MAEV_REG_USB_NAK_Msk          (0x10UL)                  /*!< USB USB_MAEV_REG: USB_NAK (Bitfield-Mask: 0x01)             */
#define USB_USB_MAEV_REG_USB_ULD_Pos          (5UL)                     /*!< USB USB_MAEV_REG: USB_ULD (Bit 5)                           */
#define USB_USB_MAEV_REG_USB_ULD_Msk          (0x20UL)                  /*!< USB USB_MAEV_REG: USB_ULD (Bitfield-Mask: 0x01)             */
#define USB_USB_MAEV_REG_USB_RX_EV_Pos        (6UL)                     /*!< USB USB_MAEV_REG: USB_RX_EV (Bit 6)                         */
#define USB_USB_MAEV_REG_USB_RX_EV_Msk        (0x40UL)                  /*!< USB USB_MAEV_REG: USB_RX_EV (Bitfield-Mask: 0x01)           */
#define USB_USB_MAEV_REG_USB_INTR_Pos         (7UL)                     /*!< USB USB_MAEV_REG: USB_INTR (Bit 7)                          */
#define USB_USB_MAEV_REG_USB_INTR_Msk         (0x80UL)                  /*!< USB USB_MAEV_REG: USB_INTR (Bitfield-Mask: 0x01)            */
#define USB_USB_MAEV_REG_USB_EP0_TX_Pos       (8UL)                     /*!< USB USB_MAEV_REG: USB_EP0_TX (Bit 8)                        */
#define USB_USB_MAEV_REG_USB_EP0_TX_Msk       (0x100UL)                 /*!< USB USB_MAEV_REG: USB_EP0_TX (Bitfield-Mask: 0x01)          */
#define USB_USB_MAEV_REG_USB_EP0_RX_Pos       (9UL)                     /*!< USB USB_MAEV_REG: USB_EP0_RX (Bit 9)                        */
#define USB_USB_MAEV_REG_USB_EP0_RX_Msk       (0x200UL)                 /*!< USB USB_MAEV_REG: USB_EP0_RX (Bitfield-Mask: 0x01)          */
#define USB_USB_MAEV_REG_USB_EP0_NAK_Pos      (10UL)                    /*!< USB USB_MAEV_REG: USB_EP0_NAK (Bit 10)                      */
#define USB_USB_MAEV_REG_USB_EP0_NAK_Msk      (0x400UL)                 /*!< USB USB_MAEV_REG: USB_EP0_NAK (Bitfield-Mask: 0x01)         */
#define USB_USB_MAEV_REG_USB_CH_EV_Pos        (11UL)                    /*!< USB USB_MAEV_REG: USB_CH_EV (Bit 11)                        */
#define USB_USB_MAEV_REG_USB_CH_EV_Msk        (0x800UL)                 /*!< USB USB_MAEV_REG: USB_CH_EV (Bitfield-Mask: 0x01)           */

/* ------------------------------  USB_USB_MAMSK_REG  ----------------------------- */
#define USB_USB_MAMSK_REG_USB_M_WARN_Pos      (0UL)                     /*!< USB USB_MAMSK_REG: USB_M_WARN (Bit 0)                       */
#define USB_USB_MAMSK_REG_USB_M_WARN_Msk      (0x1UL)                   /*!< USB USB_MAMSK_REG: USB_M_WARN (Bitfield-Mask: 0x01)         */
#define USB_USB_MAMSK_REG_USB_M_ALT_Pos       (1UL)                     /*!< USB USB_MAMSK_REG: USB_M_ALT (Bit 1)                        */
#define USB_USB_MAMSK_REG_USB_M_ALT_Msk       (0x2UL)                   /*!< USB USB_MAMSK_REG: USB_M_ALT (Bitfield-Mask: 0x01)          */
#define USB_USB_MAMSK_REG_USB_M_TX_EV_Pos     (2UL)                     /*!< USB USB_MAMSK_REG: USB_M_TX_EV (Bit 2)                      */
#define USB_USB_MAMSK_REG_USB_M_TX_EV_Msk     (0x4UL)                   /*!< USB USB_MAMSK_REG: USB_M_TX_EV (Bitfield-Mask: 0x01)        */
#define USB_USB_MAMSK_REG_USB_M_FRAME_Pos     (3UL)                     /*!< USB USB_MAMSK_REG: USB_M_FRAME (Bit 3)                      */
#define USB_USB_MAMSK_REG_USB_M_FRAME_Msk     (0x8UL)                   /*!< USB USB_MAMSK_REG: USB_M_FRAME (Bitfield-Mask: 0x01)        */
#define USB_USB_MAMSK_REG_USB_M_NAK_Pos       (4UL)                     /*!< USB USB_MAMSK_REG: USB_M_NAK (Bit 4)                        */
#define USB_USB_MAMSK_REG_USB_M_NAK_Msk       (0x10UL)                  /*!< USB USB_MAMSK_REG: USB_M_NAK (Bitfield-Mask: 0x01)          */
#define USB_USB_MAMSK_REG_USB_M_ULD_Pos       (5UL)                     /*!< USB USB_MAMSK_REG: USB_M_ULD (Bit 5)                        */
#define USB_USB_MAMSK_REG_USB_M_ULD_Msk       (0x20UL)                  /*!< USB USB_MAMSK_REG: USB_M_ULD (Bitfield-Mask: 0x01)          */
#define USB_USB_MAMSK_REG_USB_M_RX_EV_Pos     (6UL)                     /*!< USB USB_MAMSK_REG: USB_M_RX_EV (Bit 6)                      */
#define USB_USB_MAMSK_REG_USB_M_RX_EV_Msk     (0x40UL)                  /*!< USB USB_MAMSK_REG: USB_M_RX_EV (Bitfield-Mask: 0x01)        */
#define USB_USB_MAMSK_REG_USB_M_INTR_Pos      (7UL)                     /*!< USB USB_MAMSK_REG: USB_M_INTR (Bit 7)                       */
#define USB_USB_MAMSK_REG_USB_M_INTR_Msk      (0x80UL)                  /*!< USB USB_MAMSK_REG: USB_M_INTR (Bitfield-Mask: 0x01)         */
#define USB_USB_MAMSK_REG_USB_M_EP0_TX_Pos    (8UL)                     /*!< USB USB_MAMSK_REG: USB_M_EP0_TX (Bit 8)                     */
#define USB_USB_MAMSK_REG_USB_M_EP0_TX_Msk    (0x100UL)                 /*!< USB USB_MAMSK_REG: USB_M_EP0_TX (Bitfield-Mask: 0x01)       */
#define USB_USB_MAMSK_REG_USB_M_EP0_RX_Pos    (9UL)                     /*!< USB USB_MAMSK_REG: USB_M_EP0_RX (Bit 9)                     */
#define USB_USB_MAMSK_REG_USB_M_EP0_RX_Msk    (0x200UL)                 /*!< USB USB_MAMSK_REG: USB_M_EP0_RX (Bitfield-Mask: 0x01)       */
#define USB_USB_MAMSK_REG_USB_M_EP0_NAK_Pos   (10UL)                    /*!< USB USB_MAMSK_REG: USB_M_EP0_NAK (Bit 10)                   */
#define USB_USB_MAMSK_REG_USB_M_EP0_NAK_Msk   (0x400UL)                 /*!< USB USB_MAMSK_REG: USB_M_EP0_NAK (Bitfield-Mask: 0x01)      */
#define USB_USB_MAMSK_REG_USB_M_CH_EV_Pos     (11UL)                    /*!< USB USB_MAMSK_REG: USB_M_CH_EV (Bit 11)                     */
#define USB_USB_MAMSK_REG_USB_M_CH_EV_Msk     (0x800UL)                 /*!< USB USB_MAMSK_REG: USB_M_CH_EV (Bitfield-Mask: 0x01)        */

