wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AA.h
/* ------------------------------  USB_USB_EPC3_REG  ------------------------------ */
#define USB_USB_EPC3_REG_USB_EP_Pos           (0UL)                     /*!< USB USB_EPC3_REG: USB_EP (Bit 0)                            */
#define USB_USB_EPC3_REG_USB_EP_Msk           (0xfUL)                   /*!< USB USB_EPC3_REG: USB_EP (Bitfield-Mask: 0x0f)              */
#define USB_USB_EPC3_REG_USB_EP_EN_Pos        (4UL)                     /*!< USB USB_EPC3_REG: USB_EP_EN (Bit 4)                         */
#define USB_USB_EPC3_REG_USB_EP_EN_Msk        (0x10UL)                  /*!< USB USB_EPC3_REG: USB_EP_EN (Bitfield-Mask: 0x01)           */
#define USB_USB_EPC3_REG_USB_ISO_Pos          (5UL)                     /*!< USB USB_EPC3_REG: USB_ISO (Bit 5)                           */
#define USB_USB_EPC3_REG_USB_ISO_Msk          (0x20UL)                  /*!< USB USB_EPC3_REG: USB_ISO (Bitfield-Mask: 0x01)             */
#define USB_USB_EPC3_REG_USB_STALL_Pos        (7UL)                     /*!< USB USB_EPC3_REG: USB_STALL (Bit 7)                         */
#define USB_USB_EPC3_REG_USB_STALL_Msk        (0x80UL)                  /*!< USB USB_EPC3_REG: USB_STALL (Bitfield-Mask: 0x01)           */

/* ------------------------------  USB_USB_TXD2_REG  ------------------------------ */
#define USB_USB_TXD2_REG_USB_TXFD_Pos         (0UL)                     /*!< USB USB_TXD2_REG: USB_TXFD (Bit 0)                          */
#define USB_USB_TXD2_REG_USB_TXFD_Msk         (0xffUL)                  /*!< USB USB_TXD2_REG: USB_TXFD (Bitfield-Mask: 0xff)            */

/* ------------------------------  USB_USB_TXS2_REG  ------------------------------ */
#define USB_USB_TXS2_REG_USB_TCOUNT_Pos       (0UL)                     /*!< USB USB_TXS2_REG: USB_TCOUNT (Bit 0)                        */
#define USB_USB_TXS2_REG_USB_TCOUNT_Msk       (0x1fUL)                  /*!< USB USB_TXS2_REG: USB_TCOUNT (Bitfield-Mask: 0x1f)          */
#define USB_USB_TXS2_REG_USB_TX_DONE_Pos      (5UL)                     /*!< USB USB_TXS2_REG: USB_TX_DONE (Bit 5)                       */
#define USB_USB_TXS2_REG_USB_TX_DONE_Msk      (0x20UL)                  /*!< USB USB_TXS2_REG: USB_TX_DONE (Bitfield-Mask: 0x01)         */
#define USB_USB_TXS2_REG_USB_ACK_STAT_Pos     (6UL)                     /*!< USB USB_TXS2_REG: USB_ACK_STAT (Bit 6)                      */
#define USB_USB_TXS2_REG_USB_ACK_STAT_Msk     (0x40UL)                  /*!< USB USB_TXS2_REG: USB_ACK_STAT (Bitfield-Mask: 0x01)        */
#define USB_USB_TXS2_REG_USB_TX_URUN_Pos      (7UL)                     /*!< USB USB_TXS2_REG: USB_TX_URUN (Bit 7)                       */
#define USB_USB_TXS2_REG_USB_TX_URUN_Msk      (0x80UL)                  /*!< USB USB_TXS2_REG: USB_TX_URUN (Bitfield-Mask: 0x01)         */

/* ------------------------------  USB_USB_TXC2_REG  ------------------------------ */
#define USB_USB_TXC2_REG_USB_TX_EN_Pos        (0UL)                     /*!< USB USB_TXC2_REG: USB_TX_EN (Bit 0)                         */
#define USB_USB_TXC2_REG_USB_TX_EN_Msk        (0x1UL)                   /*!< USB USB_TXC2_REG: USB_TX_EN (Bitfield-Mask: 0x01)           */
#define USB_USB_TXC2_REG_USB_LAST_Pos         (1UL)                     /*!< USB USB_TXC2_REG: USB_LAST (Bit 1)                          */
#define USB_USB_TXC2_REG_USB_LAST_Msk         (0x2UL)                   /*!< USB USB_TXC2_REG: USB_LAST (Bitfield-Mask: 0x01)            */
#define USB_USB_TXC2_REG_USB_TOGGLE_TX_Pos    (2UL)                     /*!< USB USB_TXC2_REG: USB_TOGGLE_TX (Bit 2)                     */
#define USB_USB_TXC2_REG_USB_TOGGLE_TX_Msk    (0x4UL)                   /*!< USB USB_TXC2_REG: USB_TOGGLE_TX (Bitfield-Mask: 0x01)       */
#define USB_USB_TXC2_REG_USB_FLUSH_Pos        (3UL)                     /*!< USB USB_TXC2_REG: USB_FLUSH (Bit 3)                         */
#define USB_USB_TXC2_REG_USB_FLUSH_Msk        (0x8UL)                   /*!< USB USB_TXC2_REG: USB_FLUSH (Bitfield-Mask: 0x01)           */
#define USB_USB_TXC2_REG_USB_RFF_Pos          (4UL)                     /*!< USB USB_TXC2_REG: USB_RFF (Bit 4)                           */
#define USB_USB_TXC2_REG_USB_RFF_Msk          (0x10UL)                  /*!< USB USB_TXC2_REG: USB_RFF (Bitfield-Mask: 0x01)             */
#define USB_USB_TXC2_REG_USB_TFWL_Pos         (5UL)                     /*!< USB USB_TXC2_REG: USB_TFWL (Bit 5)                          */
#define USB_USB_TXC2_REG_USB_TFWL_Msk         (0x60UL)                  /*!< USB USB_TXC2_REG: USB_TFWL (Bitfield-Mask: 0x03)            */
#define USB_USB_TXC2_REG_USB_IGN_ISOMSK_Pos   (7UL)                     /*!< USB USB_TXC2_REG: USB_IGN_ISOMSK (Bit 7)                    */
#define USB_USB_TXC2_REG_USB_IGN_ISOMSK_Msk   (0x80UL)                  /*!< USB USB_TXC2_REG: USB_IGN_ISOMSK (Bitfield-Mask: 0x01)      */

/* ------------------------------  USB_USB_EPC4_REG  ------------------------------ */
#define USB_USB_EPC4_REG_USB_EP_Pos           (0UL)                     /*!< USB USB_EPC4_REG: USB_EP (Bit 0)                            */
#define USB_USB_EPC4_REG_USB_EP_Msk           (0xfUL)                   /*!< USB USB_EPC4_REG: USB_EP (Bitfield-Mask: 0x0f)              */
#define USB_USB_EPC4_REG_USB_EP_EN_Pos        (4UL)                     /*!< USB USB_EPC4_REG: USB_EP_EN (Bit 4)                         */
#define USB_USB_EPC4_REG_USB_EP_EN_Msk        (0x10UL)                  /*!< USB USB_EPC4_REG: USB_EP_EN (Bitfield-Mask: 0x01)           */
#define USB_USB_EPC4_REG_USB_ISO_Pos          (5UL)                     /*!< USB USB_EPC4_REG: USB_ISO (Bit 5)                           */
#define USB_USB_EPC4_REG_USB_ISO_Msk          (0x20UL)                  /*!< USB USB_EPC4_REG: USB_ISO (Bitfield-Mask: 0x01)             */
#define USB_USB_EPC4_REG_USB_STALL_Pos        (7UL)                     /*!< USB USB_EPC4_REG: USB_STALL (Bit 7)                         */
#define USB_USB_EPC4_REG_USB_STALL_Msk        (0x80UL)                  /*!< USB USB_EPC4_REG: USB_STALL (Bitfield-Mask: 0x01)           */

/* ------------------------------  USB_USB_RXD2_REG  ------------------------------ */
#define USB_USB_RXD2_REG_USB_RXFD_Pos         (0UL)                     /*!< USB USB_RXD2_REG: USB_RXFD (Bit 0)                          */
#define USB_USB_RXD2_REG_USB_RXFD_Msk         (0xffUL)                  /*!< USB USB_RXD2_REG: USB_RXFD (Bitfield-Mask: 0xff)            */

/* ------------------------------  USB_USB_RXS2_REG  ------------------------------ */
#define USB_USB_RXS2_REG_USB_RCOUNT_Pos       (0UL)                     /*!< USB USB_RXS2_REG: USB_RCOUNT (Bit 0)                        */
#define USB_USB_RXS2_REG_USB_RCOUNT_Msk       (0xfUL)                   /*!< USB USB_RXS2_REG: USB_RCOUNT (Bitfield-Mask: 0x0f)          */
#define USB_USB_RXS2_REG_USB_RX_LAST_Pos      (4UL)                     /*!< USB USB_RXS2_REG: USB_RX_LAST (Bit 4)                       */
#define USB_USB_RXS2_REG_USB_RX_LAST_Msk      (0x10UL)                  /*!< USB USB_RXS2_REG: USB_RX_LAST (Bitfield-Mask: 0x01)         */
#define USB_USB_RXS2_REG_USB_TOGGLE_RX_Pos    (5UL)                     /*!< USB USB_RXS2_REG: USB_TOGGLE_RX (Bit 5)                     */
#define USB_USB_RXS2_REG_USB_TOGGLE_RX_Msk    (0x20UL)                  /*!< USB USB_RXS2_REG: USB_TOGGLE_RX (Bitfield-Mask: 0x01)       */
#define USB_USB_RXS2_REG_USB_SETUP_Pos        (6UL)                     /*!< USB USB_RXS2_REG: USB_SETUP (Bit 6)                         */
#define USB_USB_RXS2_REG_USB_SETUP_Msk        (0x40UL)                  /*!< USB USB_RXS2_REG: USB_SETUP (Bitfield-Mask: 0x01)           */
#define USB_USB_RXS2_REG_USB_RX_ERR_Pos       (7UL)                     /*!< USB USB_RXS2_REG: USB_RX_ERR (Bit 7)                        */
#define USB_USB_RXS2_REG_USB_RX_ERR_Msk       (0x80UL)                  /*!< USB USB_RXS2_REG: USB_RX_ERR (Bitfield-Mask: 0x01)          */

/* ------------------------------  USB_USB_RXC2_REG  ------------------------------ */
#define USB_USB_RXC2_REG_USB_RX_EN_Pos        (0UL)                     /*!< USB USB_RXC2_REG: USB_RX_EN (Bit 0)                         */
#define USB_USB_RXC2_REG_USB_RX_EN_Msk        (0x1UL)                   /*!< USB USB_RXC2_REG: USB_RX_EN (Bitfield-Mask: 0x01)           */
#define USB_USB_RXC2_REG_USB_IGN_SETUP_Pos    (2UL)                     /*!< USB USB_RXC2_REG: USB_IGN_SETUP (Bit 2)                     */
#define USB_USB_RXC2_REG_USB_IGN_SETUP_Msk    (0x4UL)                   /*!< USB USB_RXC2_REG: USB_IGN_SETUP (Bitfield-Mask: 0x01)       */
#define USB_USB_RXC2_REG_USB_FLUSH_Pos        (3UL)                     /*!< USB USB_RXC2_REG: USB_FLUSH (Bit 3)                         */
#define USB_USB_RXC2_REG_USB_FLUSH_Msk        (0x8UL)                   /*!< USB USB_RXC2_REG: USB_FLUSH (Bitfield-Mask: 0x01)           */
#define USB_USB_RXC2_REG_USB_RFWL_Pos         (5UL)                     /*!< USB USB_RXC2_REG: USB_RFWL (Bit 5)                          */
#define USB_USB_RXC2_REG_USB_RFWL_Msk         (0x60UL)                  /*!< USB USB_RXC2_REG: USB_RFWL (Bitfield-Mask: 0x03)            */

